import streamlit as st

questions = {
    '1': {
        'text': '《中华人民共和国药典》最早于何年颁布',
        'options': {
            'A': '1950年',
            'B': '1951年',
            'C': '1952年',
            'D': '1953年',
            'E': '1954年'
        },
        'answer': 'D',
        'answer_text': '1953年'
    },
    '2': {
        'text': '药师审查处方时发现处方有涂改处，应采取的正确措施是',
        'options': {
            'A': '让患者与处方医师联系写清',
            'B': '药师只要看清可予调配',
            'C': '药师向处方医师问明情况可予调配',
            'D': '药师与处方医师联系，让处方医师在涂改处签字后方可调配',
            'E': '药师向上级药师请示批准后，在涂改处签字后即可调配'
        },
        'answer': 'D',
        'answer_text': '药师与处方医师联系，让处方医师在涂改处签字后方可调配'
    },
    '3': {
        'text': '《中华人民共和国药典》是由',
        'options': {
            'A': '国家颁布的药品集',
            'B': '国家药品监督管理局制定的药品标准',
            'C': '国家药品委员会制定的药品手册',
            'D': '国家药品监督管理局制定的药品法典',
            'E': '国家编纂的药品规格标准的法典'
        },
        'answer': 'E',
        'answer_text': '国家编纂的药品规格标准的法典'
    },
    '4': {
        'text': '将液体制剂分为胶体溶液．混悬液．乳浊液等属于',
        'options': {
            'A': '按照分散系统分类',
            'B': '按照性状分类',
            'C': '按照物态分类',
            'D': '按照制备方法分类',
            'E': '按照给药途径分类'
        },
        'answer': 'A',
        'answer_text': '按照分散系统分类'
    },
    '5': {
        'text': '下列哪种药物可发生变旋反应',
        'options': {
            'A': '肾上腺素',
            'B': '丁卡因',
            'C': '后马托品',
            'D': '氯霉素',
            'E': '抗坏血酸'
        },
        'answer': 'A',
        'answer_text': '肾上腺素'
    },
    '6': {
        'text': '下列叙述种哪一条是正确的',
        'options': {
            'A': '氨基酸在酸性溶液中称为酸性氨基酸',
            'B': '氨基酸在碱性溶液中称为碱性氨基酸',
            'C': '氨基酸在中性溶液中称为中性氨基酸',
            'D': '以上叙述都对',
            'E': '以上叙述都错'
        },
        'answer': 'D',
        'answer_text': '以上叙述都对'
    },
    '7': {
        'text': '光加速实验一般在光加速实验橱中进行，光橱的照度及光照时间要求为',
        'options': {
            'A': '2000-4000LX，10天',
            'B': '4000-5000LX，10天',
            'C': '1000-3000LX，10天',
            'D': '1000-3000LX，15天',
            'E': '3000-4000LX，15天'
        },
        'answer': 'B',
        'answer_text': '4000-5000LX，10天'
    },
    '8': {
        'text': '以下关于加速试验法的描述哪一种是正确的',
        'options': {
            'A': '以Arrhenius指数方程为基础的加速实验法，只有热分解反应，且活化能在418-1254Kj/mol时才适用',
            'B': '经典恒温法应用于均相系统一般得出较满意的结果，对于非均相系统（如混悬液，乳浊液等）通常误差较大',
            'C': 'Arrhenius指数方程式假设活化能不随温度变化提出的，只考虑温度对反应速度的影响。因此，在加速实验中，其他条件（如溶液的pH）应保持恒定',
            'D': '加速实验测出的有效期为预测有效期，应与留样观察的结果对照，才能得出产品实质的有效期',
            'E': '以上叙述都正确'
        },
        'answer': 'D',
        'answer_text': '加速实验测出的有效期为预测有效期，应与留样观察的结果对照，才能得出产品实质的有效期'
    },
    '9': {
        'text': '下列各项中哪一项用pKb表示',
        'options': {
            'A': '酸的pH值',
            'B': '酸的电离常数',
            'C': '酸式盐的水解平衡常数的负对数',
            'D': '碱的pH值',
            'E': '碱的电离常数'
        },
        'answer': 'E',
        'answer_text': '碱的电离常数'
    },
    '10': {
        'text': '制备下列溶液时，哪个可应用加热溶解法',
        'options': {
            'A': '氢氧化钙',
            'B': '氯化铵',
            'C': '碳酸氢钠',
            'D': '氯化钙（CaCl2·2H2O）',
            'E': '氢氧化钠'
        },
        'answer': 'B',
        'answer_text': '氯化铵'
    },
    '11': {
        'text': '碘化钾有使碘助溶和稳定的作用，下列哪个碘化物有助溶和稳定的作用',
        'options': {
            'A': '碘奥酮（碘吡啦啥）',
            'B': '碘化钙',
            'C': '碘化银',
            'D': '碘化油',
            'E': '碘仿'
        },
        'answer': 'B',
        'answer_text': '碘化钙'
    },
    '12': {
        'text': '下面是关于注射剂稳定性的叙述，指出哪一条是错误的',
        'options': {
            'A': '注射剂的氧化主要是由于某些药物的分子结构中某些基团与空气中的氧相互作用所致。为了防止氧化变色，可加入适量焦亚硫酸钠、亚硫酸钠、硫代硫酸钠、硫脲、抗坏血酸等。',
            'B': '抗坏血酸、盐酸肾上腺素、盐酸普鲁卡因、水杨酸钠、盐酸多巴胺等，在有微量金属离子存在下，可加速变色或分解。实际工作中，为了避免金属离子对药物的催化作用，常加入一定浓度的依地酸二钠或依地酸钙钠。',
            'C': '在注射液中通入惰性气体，也是防止主药氧化变色的有效措施之一。',
            'D': '磺胺嘧啶钠注射液通入二氧化碳气体，以排除药液中溶解的及容器空间的氧，从而使药液稳定。',
            'E': '有些注射液，为了防止氧化、变质，常常是在加入抗氧剂的同时也通入惰性气体。'
        },
        'answer': 'D',
        'answer_text': '磺胺嘧啶钠注射液通入二氧化碳气体，以排除药液中溶解的及容器空间的氧，从而使药液稳定。'
    },
    '13': {
        'text': '下列有关化学动力学的描述哪个是错误的',
        'options': {
            'A': '化学动力学是制剂稳定性加速实验的理论依据，药物制剂降解的规律，生产工艺过程的制定，处方设计及有效期的确定等均与之有关。',
            'B': '化学动力学是研究化学反应的速度以及影响速度的因素的科学。',
            'C': '反应速度系指单位时间，单位体积中反应物下降的量或产物生成量。',
            'D': '在药物制剂的降解反应中，多数药物可按零级、一级反应处理。',
            'E': '对于零级降解的药物制剂，其反应速度积公式为lgC=(-K/2.303)*t+lgC0。'
        },
        'answer': 'E',
        'answer_text': '对于零级降解的药物制剂，其反应速度积公式为lgC=(-K/2.303)*t+lgC0。'
    },
    '14': {
        'text': '下列各种药物中哪个不能发生水解反应',
        'options': {
            'A': '盐酸普鲁卡因',
            'B': '乙酰水杨酸',
            'C': '青霉素和头孢菌素等',
            'D': '巴比妥类',
            'E': '维生素C'
        },
        'answer': 'E',
        'answer_text': '维生素C'
    },
    '15': {
        'text': '药物稳定与否的根本原因在于自身的化学结构，外界因素则是引起变化的条件，影响药物制剂降解的外界因素主要有',
        'options': {
            'A': 'pH值与温度',
            'B': '溶剂介电常数及电子强度',
            'C': '赋型剂或附加剂的影响',
            'D': '水分、氧、金属离子和光线',
            'E': '以上都对'
        },
        'answer': 'E',
        'answer_text': '以上都对'
    },
    '16': {
        'text': '对于液体制剂，为了延缓药物降解可采用下述那种措施',
        'options': {
            'A': '调节pH值或改变溶质组成',
            'B': '充入惰性气体',
            'C': '加入附加剂如抗氧剂、螯合剂、抗光解剂等',
            'D': '改变剂型',
            'E': '以上措施均可采用'
        },
        'answer': 'E',
        'answer_text': '以上措施均可采用'
    },
    '17': {
        'text': '对于固体制剂，延缓药物降解措施有',
        'options': {
            'A': '加入干燥剂或（和）改善包装',
            'B': '改变生产工艺和直接压片、包衣等',
            'C': '改变剂型',
            'D': '制定稳定的衍生物',
            'E': '以上措施均可采用'
        },
        'answer': 'E',
        'answer_text': '以上措施均可采用'
    },
    '18': {
        'text': '下列有关药物稳定性正确的叙述是',
        'options': {
            'A': '亚稳定型晶型属于热力学不稳定晶型，制剂中应避免使用。',
            'B': '乳剂的分层是不可逆现象。',
            'C': '为增加混悬液稳定性，加入的能降低Zeta电位、粒子絮凝程度增加的电解质称为絮凝剂。',
            'D': '乳剂破裂后，加以震摇，能重新分散，恢复成原来状态的乳剂。',
            'E': '凡给出质子或接受质子的物质的催化反应称特殊酸碱催化反应。'
        },
        'answer': 'C',
        'answer_text': '为增加混悬液稳定性，加入的能降低Zeta电位、粒子絮凝程度增加的电解质称为絮凝剂。'
    },
    '19': {
        'text': '关于药物稳定性的正确叙述是',
        'options': {
            'A': '盐酸普鲁卡因溶液的稳定性受温度影响，与pH值无关。',
            'B': '药物的降解速度与粒子强度无关。',
            'C': '固体制剂的赋型剂不影响药物稳定性。',
            'D': '药物的降解速度与溶剂无关。',
            'E': '零级反应的反应速度与反应溶度无关。'
        },
        'answer': 'E',
        'answer_text': '零级反应的反应速度与反应溶度无关。'
    },
    '20': {
        'text': '下列不属于表面活性剂类别的是',
        'options': {
            'A': '脱水山梨醇脂肪酸脂类',
            'B': '聚氧乙烯去水山梨醇脂肪酸脂类',
            'C': '聚氧乙烯脂肪酸脂类',
            'D': '聚氧乙烯脂肪醇醚类',
            'E': '聚氧乙烯脂肪酸醇类'
        },
        'answer': 'E',
        'answer_text': '聚氧乙烯脂肪酸醇类'
    },
    '21': {
        'text': '不同HLB值的表面活性剂用途不同，下列错误者为',
        'options': {
            'A': '增溶剂最适范围为15-18以上',
            'B': '去污剂最适范围为13-16',
            'C': '润湿剂与铺展剂最适范围为7-9',
            'D': '大部分消泡剂最适范围为5-8',
            'E': 'O/W乳化剂最适范围为8-16'
        },
        'answer': 'D',
        'answer_text': '大部分消泡剂最适范围为5-8'
    },
    '22': {
        'text': '天然高分子助悬剂阿拉伯胶(或胶浆)一般用量是',
        'options': {
            'A': '1%-2%',
            'B': '1%-5%',
            'C': '5%-15%',
            'D': '10%-15%',
            'E': '12%-15%'
        },
        'answer': 'C',
        'answer_text': '5%-15%'
    },
    '23': {
        'text': '下列与表面活性剂特性无关的是',
        'options': {
            'A': '适宜的粘稠度',
            'B': '克氏点和昙点',
            'C': '亲水亲油平衡值',
            'D': '临界胶团浓度',
            'E': '表面活性'
        },
        'answer': 'A',
        'answer_text': '适宜的粘稠度'
    },
    '24': {
        'text': '下属哪种方法不能增加药物溶解度',
        'options': {
            'A': '加入助溶剂',
            'B': '加入非离子型表面活性剂',
            'C': '制成盐类',
            'D': '应用潜溶剂',
            'E': '加入助悬剂'
        },
        'answer': 'E',
        'answer_text': '加入助悬剂'
    },
    '25': {
        'text': '下列关于表面活性剂性质的叙述中正确的是',
        'options': {
            'A': '有亲水基团，无疏水基团',
            'B': '有疏水基团，无亲水基团',
            'C': '疏水基团、亲水基团均有',
            'D': '有中等极性基团',
            'E': '无极性基团'
        },
        'answer': 'C',
        'answer_text': '疏水基团、亲水基团均有'
    },
    '26': {
        'text': '下列表面活性剂有起昙现象的主要是哪一类',
        'options': {
            'A': '肥皂',
            'B': '硫酸化物',
            'C': '磺酸化物',
            'D': '季铵化物',
            'E': '吐温'
        },
        'answer': 'E',
        'answer_text': '吐温'
    },
    '27': {
        'text': '灭菌的标准以杀死          为准。',
        'options': {
            'A': '热原',
            'B': '微生物',
            'C': '细菌',
            'D': '真菌',
            'E': '芽胞'
        },
        'answer': 'A',
        'answer_text': '热原'
    },
    '28': {
        'text': '作为热压灭菌法可靠性的控制标准是                    。',
        'options': {
            'A': 'F值',
            'B': 'F0值',
            'C': 'D值',
            'D': 'Z值',
            'E': 'N值'
        },
        'answer': 'B',
        'answer_text': 'F0值'
    },
    '29': {
        'text': '热压灭菌的F0一般要求为',
        'options': {
            'A': '8-12',
            'B': '6-8',
            'C': '2-8',
            'D': '1.6-2.0',
            'E': '4-6'
        },
        'answer': 'A',
        'answer_text': '8-12'
    },
    '30': {
        'text': '下列关于粉碎的叙述哪一项是错误的',
        'options': {
            'A': '一般的粉碎，主要利用外加机械力，部分的破坏物质分子间的内聚力来达到粉碎的目的',
            'B': '药物粉碎前，必须适当干燥',
            'C': '在粉碎过程中，应把已达到要求细度的粉末随时取出',
            'D': '一般说来，中草药用较高的温度急速加热并冷却后不利于粉碎的进行',
            'E': '一般可用降低温度来提高非晶体药物的粉碎效率'
        },
        'answer': 'D',
        'answer_text': '一般说来，中草药用较高的温度急速加热并冷却后不利于粉碎的进行'
    },
    '31': {
        'text': '下列关于单独粉碎的叙述哪一项是错误的',
        'options': {
            'A': '氧化性药物和还原性药物应单独粉碎',
            'B': '贵细药材应单独粉碎',
            'C': '挥发性强烈的药材应单独粉碎',
            'D': '含糖量较多的粘性药材应单独粉碎',
            'E': '细小种子类药材应单独粉碎'
        },
        'answer': 'D',
        'answer_text': '含糖量较多的粘性药材应单独粉碎'
    },
    '32': {
        'text': '下列关于混合粉碎法的叙述哪一项是错误的',
        'options': {
            'A': '处方中某些药物的性质及硬度相似，则可以将它们掺合在一起进行混合粉碎',
            'B': '混合粉碎可以避免一些粘性药物单独粉碎的困难',
            'C': '混合粉碎可以使粉碎和混合操作结合进行',
            'D': '含脂肪油较多的药物不宜混合粉碎',
            'E': '对混合粉碎可能产生共熔现象者，则视制剂具体要求决定粉碎方法'
        },
        'answer': 'D',
        'answer_text': '含脂肪油较多的药物不宜混合粉碎'
    },
    '33': {
        'text': '下列关于粉碎的叙述哪一项是错误的',
        'options': {
            'A': '干法粉碎是把药物经过适当的干燥处理，使药物含水量降低至一定限度再进行粉碎的方法',
            'B': '湿法粉碎是指药物中加入适量的水或其他液体进行研磨粉碎的方法',
            'C': '药物的干燥温度一般不宜超过105℃，含水量不宜超过1.0%',
            'D': '湿法粉碎通常液体的选用是以药物遇湿不膨胀、两者不起变化、不妨碍药效为原则',
            'E': '湿法粉碎常用的有“加液研磨法”和“水飞法”'
        },
        'answer': 'C',
        'answer_text': '药物的干燥温度一般不宜超过105℃，含水量不宜超过1.0%'
    },
    '34': {
        'text': '粉碎器械一般按其主要粉碎作用力分类，下列叙述哪一项是错误的',
        'options': {
            'A': '压片机、截切机、以截切作用为主',
            'B': '滚压机以挤压作用为主',
            'C': '万能磨粉机以撞击作用为主',
            'D': '流能磨以研磨作用为主',
            'E': '羚羊角粉碎机以锉削作用为主'
        },
        'answer': 'D',
        'answer_text': '流能磨以研磨作用为主'
    },
    '35': {
        'text': '下列关于球磨机的叙述哪一项是错误的',
        'options': {
            'A': '是以研磨与撞击作用为主的粉碎器械',
            'B': '一般要求粉碎物料的直径不应大于圆球直径的1/4-1/9',
            'C': '投料量为筒总容量的30%',
            'D': '圆球加入量为筒总容量的30%-35%',
            'E': '电机转速的实践经验值是临界转速的75%'
        },
        'answer': 'C',
        'answer_text': '投料量为筒总容量的30%'
    },
    '36': {
        'text': '工业筛筛孔数目即目数习惯上指',
        'options': {
            'A': '每厘米长度上筛孔数目',
            'B': '每平方米面积上筛孔数目',
            'C': '每英寸长度上筛孔的数目',
            'D': '每平方英寸面积上筛孔数目',
            'E': '每市寸长度上筛孔数目'
        },
        'answer': 'C',
        'answer_text': '每英寸长度上筛孔的数目'
    },
    '37': {
        'text': '六号药筛相当于工业筛多少目',
        'options': {
            'A': '24目',
            'B': '60目',
            'C': '80目',
            'D': '100目',
            'E': '120目'
        },
        'answer': 'D',
        'answer_text': '100目'
    },
    '38': {
        'text': '乳香．没药最好采用哪种方法粉碎',
        'options': {
            'A': '水飞法',
            'B': '串研法',
            'C': '串油法',
            'D': '低温法',
            'E': '加液研磨法'
        },
        'answer': 'D',
        'answer_text': '低温法'
    },
    '39': {
        'text': '需要水飞法粉碎的药物是',
        'options': {
            'A': '冰片',
            'B': '水杨酸',
            'C': '麦冬',
            'D': '朱砂',
            'E': '杏仁'
        },
        'answer': 'D',
        'answer_text': '朱砂'
    },
    '40': {
        'text': '关于灭菌法的叙述错误的是',
        'options': {
            'A': '灭菌法是指杀死或除去所有微生物的方法',
            'B': '微生物包括细菌．真菌．病毒',
            'C': '灭菌效果应以杀死芽孢为准',
            'D': '煮沸灭菌可杀灭细菌繁殖体及芽孢',
            'E': '热压灭菌法在制剂生产中应用最广泛'
        },
        'answer': 'D',
        'answer_text': '煮沸灭菌可杀灭细菌繁殖体及芽孢'
    },
    '41': {
        'text': '热压灭菌所用的蒸气是',
        'options': {
            'A': '过饱和蒸汽',
            'B': '饱和蒸汽',
            'C': '过热蒸汽',
            'D': '流通蒸汽',
            'E': '126℃蒸汽'
        },
        'answer': 'B',
        'answer_text': '饱和蒸汽'
    },
    '42': {
        'text': '油脂性基质的灭菌方法是',
        'options': {
            'A': '紫外线灭菌',
            'B': '干热空气灭菌',
            'C': '流通蒸汽灭菌',
            'D': '气体灭菌',
            'E': '辐射灭菌'
        },
        'answer': 'B',
        'answer_text': '干热空气灭菌'
    },
    "43": {
        "text": "A级洁净室每立方米浮游菌的总数不得超过",
        "options": {
            "A": "5",
            "B": "1",
            "C": "0",
            "D": "3",
            "E": "2"
        },
        "answer": "D",
        "answer_text": "3"
    },
    "44": {
        "text": "微生物限度检查抽样量为检验量的倍",
        "options": {
            "A": "1",
            "B": "2",
            "C": "3",
            "D": "4",
            "E": "5"
        },
        "answer": "C",
        "answer_text": "3"
    },
    "45": {
        "text": "湿法制粒压片工艺的目的是改善主药的",
        "options": {
            "A": "可压性和流动性",
            "B": "崩解性和溶出性",
            "C": "防潮性和稳定性",
            "D": "润滑性和抗黏着性",
            "E": "流动性和崩解性"
        },
        "answer": "A",
        "answer_text": "可压性和流动性"
    },
    "46": {
        "text": "湿法制粒压片的工艺流程为",
        "options": {
            "A": "原辅料→混合→制软材→制湿粒→干燥→整粒→压片",
            "B": "原辅料→混合→制软材→制湿粒→压片",
            "C": "原辅料→混合→制软材呻制干粒→压片",
            "D": "原辅料→混合→制湿粒→干燥→压片",
            "E": "原辅料→混合→制软材→干燥→压片"
        },
        "answer": "A",
        "answer_text": "原辅料→混合→制软材→制湿粒→干燥→整粒→压片"
    },
    "47": {
        "text": "属于干法制粒的是",
        "options": {
            "A": "一步制粒法",
            "B": "挤压制粒",
            "C": "喷雾制粒法",
            "D": "滚压制粒法",
            "E": "高速搅拌制粒"
        },
        "answer": "D",
        "answer_text": "滚压制粒法"
    },
    "48": {
        "text": "不属于液体药剂者为",
        "options": {
            "A": "合剂",
            "B": "搽剂",
            "C": "灌肠剂",
            "D": "醑剂",
            "E": "注射液"
        },
        "answer": "E",
        "answer_text": "注射液"
    },
    "49": {
        "text": "对液体制剂质量要求错误者为",
        "options": {
            "A": "溶液型药剂应澄明",
            "B": "分散媒最好用有机分散媒",
            "C": "有效成分浓度应准确．稳定",
            "D": "乳浊液型药剂应保证其分散相小而均匀",
            "E": "制剂应有一定的防腐能力"
        },
        "answer": "B",
        "answer_text": "分散媒最好用有机分散媒"
    },
    "50": {
        "text": "液体制剂规定染菌数限量要求为每克或每毫升内不超过",
        "options": {
            "A": "100个",
            "B": "200个",
            "C": "300个",
            "D": "400个",
            "E": "500个"
        },
        "answer": "A",
        "answer_text": "100个"
    },
    "51": {
        "text": "有关制剂pH对微生物生长影响叙述错误的是",
        "options": {
            "A": "霉菌可在较广pH范围内生长",
            "B": "霉菌生长最适宜pH是4-6",
            "C": "细菌通常是在中性时最易于生长",
            "D": "细菌生长适宜pH是5-8",
            "E": "碱性范围对霉菌、细菌都不适宜"
        },
        "answer": "B",
        "answer_text": "霉菌生长最适宜pH是4-6"
    },
    "52": {
        "text": "人工合成色素液体药剂中一般用量为",
        "options": {
            "A": "1/百万-2/百万",
            "B": "2/百万-5/百万",
            "C": "5/百万-10/百万",
            "D": "5/百万-8百万",
            "E": "8/百万-10/百万"
        },
        "answer": "C",
        "answer_text": "5/百万-10/百万"
    },
    "53": {
        "text": "最适合作O／W型乳剂的乳化剂的HLB值是",
        "options": {
            "A": "HLB值在1-3",
            "B": "HLB值在3-8",
            "C": "HLB值在8-16",
            "D": "HLB值在7-9",
            "E": "HLB值在13-16"
        },
        "answer": "C",
        "answer_text": "HLB值在8-16"
    },
    "54": {
        "text": "乳剂制备方法中水相加至含乳化剂的油相中的方法",
        "options": {
            "A": "手工法",
            "B": "干胶法",
            "C": "湿胶法",
            "D": "新生皂法",
            "E": "机械法"
        },
        "answer": "B",
        "answer_text": "干胶法"
    },
    "55": {
        "text": "单糖浆为蔗糖的水溶液，含蔗糖量",
        "options": {
            "A": "85%（g/ml）或64.7%(g/g)",
            "B": "86%(g/ml)或64.7%(g/g)",
            "C": "85%(g/ml)或65.7%(g/g)",
            "D": "86%(g/ml)或65.7%(g/g)",
            "E": "86%(g/ml)或66.7%(g/g)"
        },
        "answer": "A",
        "answer_text": "85%（g/ml）或64.7%(g/g)"
    },
    "56": {
        "text": "有关疏水胶的叙述错误者为",
        "options": {
            "A": "系多相分散体系",
            "B": "粘度与渗透压较大",
            "C": "表面张力与分散媒相近",
            "D": "分散相与分散媒没有亲和力",
            "E": "TynD．A．ll效应明显"
        },
        "answer": "B",
        "answer_text": "粘度与渗透压较大"
    },
    "57": {
        "text": "天然高分子助悬剂阿拉伯胶(或胶浆)一般用量是",
        "options": {
            "A": "1%-2%",
            "B": "2%-5%",
            "C": "5%-15%",
            "D": "10%-15%",
            "E": "12%-15%"
        },
        "answer": "C",
        "answer_text": "5%-15%"
    },
    "58": {
        "text": "微乳(miC，romulsions)乳滴直径在",
        "options": {
            "A": "120nm",
            "B": "140nm",
            "C": "160nm",
            "D": "180nm",
            "E": "200nm"
        },
        "answer": "B",
        "answer_text": "140nm"
    },
    "59": {
        "question": "下列乳剂处方拟定原则中错误者是",
        "options": {
            "A": "乳剂中两相体积比值应在25%-50%",
            "B": "根据乳剂类型不同，选用所需HLB（亲水亲脂平衡）值的乳化剂",
            "C": "根据需要调节乳剂粘度",
            "D": "选择适当的氧化剂",
            "E": "根据需要调节乳剂流变性"
        },
        "answer": "D",
        "answer_text": "选择适当的氧化剂"
    },
    "60": {
        "question": "制备混悬液时，加入亲水高分子材料，增加体系的黏度，称为",
        "options": {
            "A": "助悬剂",
            "B": "润湿剂",
            "C": "增溶剂",
            "D": "絮凝剂",
            "E": "乳剂"
        },
        "answer": "A",
        "answer_text": "助悬剂"
    },
    "61": {
        "question": "作为药用乳化剂最合适的HLB值为",
        "options": {
            "A": "2-5（W/O型）；6-10（O/W型）",
            "B": "4-9（W/O型）；8-10（O/W型）",
            "C": "3-8（W/O型）；8-16（O/W型）",
            "D": "8（W/O型）；6-10（O/W型）",
            "E": "2-5（W/O型）；8-16（O/W型）"
        },
        "answer": "C",
        "answer_text": "3-8（W/O型）；8-16（O/W型）"
    },
    "62": {
        "question": "以下关于液体药剂的叙述错误的是",
        "options": {
            "A": "溶液分散相粒径一般小于1nm",
            "B": "胶体溶液型药剂分散相粒径一般在1-100nm",
            "C": "混悬型药剂分散相微粒的粒径一般在100μm以上",
            "D": "乳浊液分散相液滴直径在1nm-25μm",
            "E": "混悬型药剂属粗分散系"
        },
        "answer": "C",
        "answer_text": "混悬型药剂分散相微粒的粒径一般在100μm以上"
    },
    "63": {
        "question": "乳剂中分散的乳滴聚集形成疏松的聚集体，经振摇即能恢复成均匀乳剂的现象，称为乳剂的",
        "options": {
            "A": "分层",
            "B": "絮凝",
            "C": "转相",
            "D": "合并",
            "E": "破裂"
        },
        "answer": "B",
        "answer_text": "絮凝"
    },
    "64": {
        "question": "下列哪种物质不能作为混悬剂的助悬剂用",
        "options": {
            "A": "西黄蓍胶",
            "B": "海藻酸钠",
            "C": "硬脂酸钠",
            "D": "羧甲基纤维素",
            "E": "硅皂土"
        },
        "answer": "C",
        "answer_text": "硬脂酸钠"
    },
    "65": {
        "question": "根据Stoke's定律，混悬微粒沉降速度与下列哪个因素成正比",
        "options": {
            "A": "混悬微粒半径",
            "B": "混悬微粒粒速",
            "C": "混悬微粒半径平方",
            "D": "混悬微粒粉碎度",
            "E": "混悬微粒直径"
        },
        "answer": "A",
        "answer_text": "混悬微粒半径"
    },
    "66": {
        "question": "有“万能”溶剂之称的是",
        "options": {
            "A": "水",
            "B": "甘油",
            "C": "乙醇",
            "D": "二甲基亚砜",
            "E": "醋酸乙酯"
        },
        "answer": "D",
        "answer_text": "二甲基亚砜"
    },
    "67": {
        "question": "属于半极性溶剂的是",
        "options": {
            "A": "水",
            "B": "甘油",
            "C": "丙二醇",
            "D": "二甲基亚砜",
            "E": "脂肪油"
        },
        "answer": "C",
        "answer_text": "丙二醇"
    },
    "68": {
        "question": "于溶胶剂中加入亲水性高分子溶液，作为",
        "options": {
            "A": "助悬剂",
            "B": "絮凝剂",
            "C": "脱水剂",
            "D": "保护胶",
            "E": "乳化剂"
        },
        "answer": "D",
        "answer_text": "保护胶"
    },
    "69": {
        "question": "属于O／W型固体微粒类乳化剂的是",
        "options": {
            "A": "氢氧化钙",
            "B": "氢氧化锌",
            "C": "氢氧化铝",
            "D": "阿拉伯胶",
            "E": "十二烷基硫酸钠"
        },
        "answer": "C",
        "answer_text": "氢氧化铝"
    },
    "70": {
        "question": "溶液型液体制剂分散相质点的直径是",
        "options": {
            "A": ">lnm",
            "B": ">lμm",
            "C": "<lμm",
            "D": "<lnm",
            "E": "<10μm"
        },
        "answer": "D",
        "answer_text": "<lnm"
    },
    "71": {
        "question": "单糖浆的含糖量(g／m1)应为",
        "options": {
            "A": "85％",
            "B": "65％",
            "C": "60％",
            "D": "64．7％",
            "E": "75％"
        },
        "answer": "A",
        "answer_text": "85％"
    },
    "72": {
        "question": "混悬剂中添加胶浆剂的主要作用是",
        "options": {
            "A": "分散",
            "B": "絮凝",
            "C": "润湿",
            "D": "乳化",
            "E": "助悬"
        },
        "answer": "E",
        "answer_text": "助悬"
    },
    "73": {
        "question": "下列属于均相分散体系的是",
        "options": {
            "A": "混悬剂",
            "B": "溶胶剂",
            "C": "O/W型乳剂",
            "D": "高分子溶液剂",
            "E": "W/O型乳剂"
        },
        "answer": "D",
        "answer_text": "高分子溶液剂"
    },
    "74": {
        "question": "下述哪种方法不能增加药物的溶解度",
        "options": {
            "A": "加入助溶剂",
            "B": "加入增溶剂",
            "C": "采用混合溶剂",
            "D": "搅拌",
            "E": "制成盐类"
        },
        "answer": "D",
        "answer_text": "搅拌"
    },
    "75": {
        "question": "根据Stoke`s定律，混悬微粒沉降速率与下列哪个因素成反比",
        "options": {
            "A": "混悬微粒的半径",
            "B": "混悬微粒的直径",
            "C": "混悬微粒的半径平方",
            "D": "分散介质的黏度",
            "E": "混悬微粒的密度"
        },
        "answer": "D",
        "answer_text": "分散介质的黏度"
    },
    "76": {
        "question": "极性溶剂是",
        "options": {
            "A": "甘油",
            "B": "聚乙二醇",
            "C": "丙二醇",
            "D": "液体石蜡",
            "E": "醋酸乙酯"
        },
        "answer": "A",
        "answer_text": "甘油"
    },
    "77": {
        "question": "非极性溶剂是",
        "options": {
            "A": "水",
            "B": "聚乙二醇",
            "C": "甘油",
            "D": "液体石蜡",
            "E": "DMSO"
        },
        "answer": "D",
        "answer_text": "液体石蜡"
    },
    "78": {
        "question": "下列哪是常用防腐剂",
        "options": {
            "A": "氯化钠",
            "B": "苯甲酸钠",
            "C": "氢氧化钠",
            "D": "亚硫酸钠",
            "E": "硫酸钠"
        },
        "answer": "B",
        "answer_text": "苯甲酸钠"
    },
    "79": {
        "question": "关于溶液剂的制法叙述错误的是",
        "options": {
            "A": "制备工艺过程中先取处方中全部溶剂加药物溶解",
            "B": "处方中如有附加剂或溶解度较小的药物，应先将其溶解于溶剂中",
            "C": "药物在溶解过程中应采用粉碎、加热、搅拌等措施",
            "D": "易氧化的药物溶解时宜将溶剂加热放冷后再溶解药物",
            "E": "对易挥发性药物应在最后加入"
        },
        "answer": "A",
        "answer_text": "制备工艺过程中先取处方中全部溶剂加药物溶解"
    },
    "80": {
        "question": "最适合作W／O型乳剂的乳化剂的HLB值是",
        "options": {
            "A": "HLB值在1-3",
            "B": "HLB值在3-8",
            "C": "HLB值在8-16",
            "D": "HLB值在7-9",
            "E": "HLB值在13-16"
        },
        "answer": "B",
        "answer_text": "HLB值在3-8"
    },
    "81": {
        "question": "关于注射剂的质量要求叙述正确的是",
        "options": {
            "A": "允许pH值范围在5-11",
            "B": "脊椎腔内注射的药液可以偏低渗",
            "C": "溶液型注射液不得有肉眼可见的混浊或异物",
            "D": "脊椎腔注射的注射剂因为用量小可不进行热原检查",
            "E": "大量输入体内的注射剂可以低渗"
        },
        "answer": "C",
        "answer_text": "溶液型注射液不得有肉眼可见的混浊或异物"
    },
    "82": {
        "question": "关于注射剂的给药途径的叙述正确的是",
        "options": {
            "A": "静脉注射起效快，为急救首选的手段",
            "B": "油溶液型和混悬型注射液可以少量静脉注射",
            "C": "油溶液型和混悬型注射液不可作肌内注射",
            "D": "皮内注射是注射于真皮与肌肉之间",
            "E": "皮下注射是注射于表皮与真皮之间，一次注射量在0.2m1以下"
        },
        "answer": "A",
        "answer_text": "静脉注射起效快，为急救首选的手段"
    },
    "83": {
        "question": "注射用水和蒸馏水的检查项目的主要区别是",
        "options": {
            "A": "酸碱度",
            "B": "热原",
            "C": "氯化物",
            "D": "氨",
            "E": "硫酸盐"
        },
        "answer": "B",
        "answer_text": "热原"
    },
    "84": {
        "question": "中国药典规定的注射用水应是",
        "options": {
            "A": "纯净水",
            "B": "蒸馏水",
            "C": "去离子水",
            "D": "灭菌蒸馏水",
            "E": "蒸馏水或去离子水再经蒸馏而制得的水"
        },
        "answer": "E",
        "answer_text": "蒸馏水或去离子水再经蒸馏而制得的水"
    },
    "85": {
        "question": "热原是微生物产生的内毒素，其致热活性中心是",
        "options": {
            "A": "蛋白质",
            "B": "多糖",
            "C": "磷脂",
            "D": "脂多糖",
            "E": "核糖核酸"
        },
        "answer": "D",
        "answer_text": "脂多糖"
    },
    "86": {
        "question": "下列对热原性质的正确描述是",
        "options": {
            "A": "有一定的耐热性、不挥发",
            "B": "有一定的耐热性、不溶于水",
            "C": "有挥发性但可被吸附",
            "D": "溶于水，不能被吸附",
            "E": "耐强酸、强碱、强氧化剂"
        },
        "answer": "ACE",
        "answer_text": "A.有一定的耐热性、不挥发, C.有挥发性但可被吸附, E.耐强酸、强碱、强氧化剂"
    },
    "87": {
        "question": "热原的相对分子质量一般为",
        "options": {
            "A": "104",
            "B": "105",
            "C": "106",
            "D": "107",
            "E": "108"
        },
        "answer": "C",
        "answer_text": "106"
    },
    "88": {
        "question": "下列关于热原的叙述正确的是",
        "options": {
            "A": "180℃ 3—4h可以彻底破坏热原",
            "B": "热原大小在1-5mm之间，可以被微孔滤膜截留",
            "C": "热原能溶于水，超滤装置也不能将其除去",
            "D": "活性炭可以吸附色素与杂质，但不能吸附热原",
            "E": "反渗透法不能除去热原"
        },
        "answer": "A",
        "answer_text": "180℃ 3—4h可以彻底破坏热原"
    },
    "89": {
        "question": "综合法制备注射用水的工艺流程正确的",
        "options": {
            "A": "自来水一过滤器—离子交换树脂床—多效蒸馏水机—电渗析装置一注射用水",
            "B": "自来水一离子交换树脂床—电渗析装置一过滤器—多效蒸馏水机—注射用水",
            "C": "自来水一过滤器一离子交换树脂床一电渗析装置一多效蒸馏水机一注射用水",
            "D": "自来水一过滤器一电渗析装置一离子交换树脂床一多效蒸馏水机一注射用水",
            "E": "自来水一离子交换树脂床一电渗析装置一多效蒸馏水机一过滤器一注射用水"
        },
        "answer": "D",
        "answer_text": "自来水一过滤器一电渗析装置一离子交换树脂床一多效蒸馏水机一注射用水"
    },
    "90": {
        "question": "在某注射剂中加入焦亚硫酸钠，其作用为",
        "options": {
            "A": "抑菌剂",
            "B": "抗氧剂",
            "C": "止痛剂",
            "D": "络合剂",
            "E": "乳化剂"
        },
        "answer": "B",
        "answer_text": "抗氧剂"
    },
    "91": {
        "question": "一般不能用于注射剂的表面活性剂是",
        "options": {
            "A": "硬脂酸钙",
            "B": "泊洛沙姆188",
            "C": "聚山梨酯80",
            "D": "卵磷脂",
            "E": "聚氧乙烯蓖麻油"
        },
        "answer": "A",
        "answer_text": "硬脂酸钙"
    },
    "92": {
        "question": "注射剂中加入硫代硫酸钠作为抗氧剂时，通入的气体应该是",
        "options": {
            "A": "O2",
            "B": "H2",
            "C": "CO2",
            "D": "空气",
            "E": "N2"
        },
        "answer": "E",
        "answer_text": "N2"
    },
    "93": {
        "question": "焦亚硫酸钠是一种常用的抗氧剂，最适用于",
        "options": {
            "A": "偏酸性溶液",
            "B": "偏碱性溶液",
            "C": "不受酸碱性影响",
            "D": "强酸溶液",
            "E": "以上均不适用"
        },
        "answer": "A",
        "answer_text": "偏酸性溶液"
    },
    "94": {
        "question": "在制剂中作为金属离子络合剂使用的是",
        "options": {
            "A": "NaHCO3",
            "B": "NaCl",
            "C": "焦亚硫酸钠",
            "D": "NaOH",
            "E": "依地酸二钠"
        },
        "answer": "E",
        "answer_text": "依地酸二钠"
    },
    "95": {
        "question": "关于注射剂生产区域的划分，下列说法错误的是",
        "options": {
            "A": "洁净区是指有较高洁净度要求和较严格菌落数要求的生产房间",
            "B": "控制区是指洁净度和菌落数有一定要求的生产或辅助房间",
            "C": "一般生产区是指无空气洁净度要求的生产或辅助房间",
            "D": "注射剂的灭菌、印字和包装应在控制区完成",
            "E": "最后可灭菌的注射剂的精滤应在洁净区完成"
        },
        "answer": "D",
        "answer_text": "注射剂的灭菌、印字和包装应在控制区完成"
    },
    "96": {
        "question": "空气净化技术主要是通过控制生产场所中的哪一项",
        "options": {
            "A": "空气中的尘粒浓度",
            "B": "空气细菌污染水平",
            "C": "保持适宜的温度",
            "D": "保持适宜的湿度",
            "E": "以上均控制"
        },
        "answer": "E",
        "answer_text": "以上均控制"
    },
    "97": {
        "question": "大体积(>50ml)注射剂过滤和灌封生产区的洁净度要求是",
        "options": {
            "A": "D级",
            "B": "C级",
            "C": "B级",
            "D": "A级",
            "E": "E级"
        },
        "answer": "E",
        "answer_text": "E级"
    },
    "98": {
        "question": "注射用抗生素粉末分装室洁净度要求为",
        "options": {
            "A": "D级",
            "B": "C级",
            "C": "B级",
            "D": "A级",
            "E": "BC均可"
        },
        "answer": "D",
        "answer_text": "A级"
    },
    "99": {
        "question": "关于层流净化特点的叙述错误的是",
        "options": {
            "A": "可控制洁净室的温度与湿度",
            "B": "进入洁净室的空气经滤过处理",
            "C": "洁净室新产生的微粒可沿层流方向带走",
            "D": "空调净化就是层流净化",
            "E": "室内空气不会出现停滞"
        },
        "answer": "D",
        "answer_text": "空调净化就是层流净化"
    },
    "100": {
        "question": "关于注射剂容器的处理错误的说法是",
        "options": {
            "A": "安瓿一般在烘箱内120—140℃干燥",
            "B": "盛装无菌操作的安瓿须用180℃干热灭菌1h",
            "C": "盛装低温灭菌的安瓿须用180℃干热灭菌1h",
            "D": "大量生产多采用隧道式烘箱干燥，隧道内平均温度200℃",
            "E": "采用远红外干燥装置350℃经lmin，能达到安瓿灭菌的目的"
        },
        "answer": "E",
        "answer_text": "采用远红外干燥装置350℃经lmin，能达到安瓿灭菌的目的"
    },
    "101": {
        "question": "关于注射液的配制方法叙述正确的是",
        "options": {
            "A": "原料质量不好时宜采用稀配法",
            "B": "溶解度小的杂质在稀配时容易滤过除去",
            "C": "原料质量好时宜采用浓配法",
            "D": "活性炭在碱性溶液中对杂质的吸附作用比在酸性溶液中强",
            "E": "活性炭吸附杂质常用浓度为0.1％-0.3％"
        },
        "answer": "E",
        "answer_text": "活性炭吸附杂质常用浓度为0.1％-0.3％"
    },
    "102": {
        "question": "滤过的影响因素不包括",
        "options": {
            "A": "待滤过液的体积",
            "B": "滤过压力差",
            "C": "毛细管半径",
            "D": "滤渣层厚度",
            "E": "滤液粘度"
        },
        "answer": "D",
        "answer_text": "滤过的影响因素不包括滤渣层厚度"
    },
    "103": {
        "question": "关于滤过器的特点叙述错误的是",
        "options": {
            "A": "垂熔玻璃滤器化学性质稳定，易于清洗，可以热压灭菌",
            "B": "砂滤棒对药液吸附性强，价廉易得、滤速快",
            "C": "微孔滤膜截留能力强，不易堵塞，不易破碎",
            "D": "微孔滤膜孔径测定一般用气泡点法",
            "E": "钛滤器抗热抗震性能好，不易破碎，可用于注射剂中的脱炭过滤和除微粒过滤"
        },
        "answer": "C",
        "answer_text": "微孔滤膜截留能力强，不易堵塞，不易破碎"
    },
    "104": {
        "question": "关于滤过装置的叙述错误的是",
        "options": {
            "A": "高位静压滤过压力稳定，质量好，滤速慢",
            "B": "减压滤过压力稳定，滤层不易松动，药液不易污染",
            "C": "加压滤过压力稳定，滤速快，药液不易污染",
            "D": "无菌滤过宜采用加压滤过",
            "E": "滤过一般采用砂滤棒—垂熔玻璃滤球一微孔滤膜的串联模式"
        },
        "answer": "B",
        "answer_text": "减压滤过压力稳定，滤层不易松动，药液不易污染"
    },
    "105": {
        "question": "关于注射剂的灭菌叙述错误的是",
        "options": {
            "A": "选择灭菌法时应考虑灭菌效果与制剂的稳定性",
            "B": "凡对热稳定的产品应该热压灭菌",
            "C": "對热不稳定的产品可采用流通蒸气灭菌，但生产过程应注意避菌",
            "D": "相同品种，不同批号的注射剂可在同一灭菌区内同时灭菌",
            "E": "相同色泽．不同品种的注射剂不可在同一灭菌区内同时灭菌"
        },
        "answer": "D",
        "answer_text": "相同品种，不同批号的注射剂可在同一灭菌区内同时灭菌"
    },
    "106": {
        "question": "关于注射剂的质量检查叙述错误的是",
        "options": {
            "A": "澄明度检查应在红色背景，20W照明荧光灯光源下用目检视",
            "B": "中国药典规定热原检查采用家兔法",
            "C": "鲎试剂法是利用鲎的变形细胞溶解物与内毒素间的胶凝反应",
            "D": "鲎试剂法检查热原需要做阳性对照和阴性对照",
            "E": "检查降压物质以猫为实验动物"
        },
        "answer": "A",
        "answer_text": "澄明度检查应在红色背景，20W照明荧光灯光源下用目检视"
    },
    "107": {
        "question": "关于盐酸普鲁卡因注射液叙述错误的有",
        "options": {
            "A": "氯化钠用于调节等渗",
            "B": "氯化钠可以提高盐酸普鲁卡因的稳定性",
            "C": "盐酸控制pH在3．5-5．0，提高盐酸普鲁卡因的稳定性",
            "D": "采用热压灭菌",
            "E": "采用流通蒸气100℃， 30min灭菌"
        },
        "answer": "D",
        "answer_text": "采用热压灭菌"
    },
    "108": {
        "question": "维生素C注射液的表述错误的是",
        "options": {
            "A": "可采用亚硫酸氢钠作抗氧剂",
            "B": "处方中加入氢氧化钠调节pH值使成偏碱性",
            "C": "采用依地酸二钠络合金属离子，增加维生素C的稳定性",
            "D": "配制时使用的注射用水需用二氧化碳饱和",
            "E": "采用100℃流通蒸气15min灭菌"
        },
        "answer": "B",
        "answer_text": "处方中加入氢氧化钠调节pH值使成偏碱性"
    },
    "109": {
        "question": "处方：右旋糖酐    60g\n氯化钠      9g\n注射用水加至    1000ml\n关于右旋糖酐注射液(6％)错误的叙述是",
        "options": {
            "A": "用于治疗低血容量性休克",
            "B": "制备过程中要加入活性炭吸附热原",
            "C": "对热不稳定，应在较低温度下过滤",
            "D": "112℃ ，30min灭菌",
            "E": "贮存温度较低或相对分子质量偏高可能析出结晶"
        },
        "answer": "C",
        "answer_text": "对热不稳定，应在较低温度下过滤"
    },
    "110": {
        "question": "头孢噻吩钠的氯化钠等渗当量为0．24，配制2％滴眼剂100ml需加多少克氯化钠",
        "options": {
            "A": "0．42g",
            "B": "0．61g",
            "C": "0．36g",
            "D": "1．42g",
            "E": "1．36g"
        },
        "answer": "A",
        "answer_text": "0．42g"
    },
    "111": {
        "question": "配制100m1，0．5％盐酸普鲁卡因溶液，需加入多少克氯化钠使其成等渗(1％盐酸普鲁卡因水溶液的冰点下降度数为0．12℃，1％的氯化钠水溶液的冰点下降度数为0．58℃)",
        "options": {
            "A": "0．45g",
            "B": "0．90g",
            "C": "0．48g",
            "D": "0．79g",
            "E": "0．05g"
        },
        "answer": "A",
        "answer_text": "0．45g"
    },
    "112": {
        "question": "已知盐酸普鲁卡因的氯化钠等渗当量为0．18，若配制0．5％盐酸普鲁卡因等渗溶液200ml需加入NaCl",
        "options": {
            "A": "0．72g",
            "B": "0．18g",
            "C": "0．81g",
            "D": "1．62g",
            "E": "2．33g"
        },
        "answer": "D",
        "answer_text": "1．62g"
    },
    "113": {
        "question": "氯化钠是常用的等渗调节剂，其1％溶液的冰点下降度数为",
        "options": {
            "A": "0．52℃",
            "B": "0．56℃",
            "C": "0．50℃",
            "D": "0．58℃",
            "E": "0．85℃"
        },
        "answer": "A",
        "answer_text": "0．52℃"
    },
    "114": {
        "question": "注射用青霉素粉针，临用前应加入",
        "options": {
            "A": "注射用水",
            "B": "蒸馏水",
            "C": "去离子水",
            "D": "灭菌注射用水",
            "E": "酒精"
        },
        "answer": "D",
        "answer_text": "灭菌注射用水"
    },
    "115": {
        "question": "关于冷冻干燥的叙述错误的是",
        "options": {
            "A": "预冻温度应在低共熔点以下10～20℃",
            "B": "速冻法制得结晶细微，产品疏松易溶",
            "C": "速冻引起蛋白质变性的几率小，对于酶类和活菌保存有利",
            "D": "慢冻法制得结晶粗，但有利于提高冻干效率",
            "E": "粘稠、熔点低的药物宜采用一次升华法"
        },
        "answer": "E",
        "answer_text": "粘稠、熔点低的药物宜采用一次升华法"
    },
    "116": {
        "question": "注射剂的等渗调节剂应选用",
        "options": {
            "A": "硼酸",
            "B": "HCL",
            "C": "苯甲酸",
            "D": "Na2C03",
            "E": "NaCl"
        },
        "answer": "E",
        "answer_text": "NaCl"
    },
    "117": {
        "question": "氯化钠等渗当量是指",
        "options": {
            "A": "与100g药物成等渗的氯化钠重量",
            "B": "与10g药物成等渗的氯化钠重量",
            "C": "与1g药物成等渗的氯化钠重量",
            "D": "与1g氯化钠成等渗的药物重量",
            "E": "氯化钠与药物的重量各占50％"
        },
        "answer": "C",
        "answer_text": "与1g药物成等渗的氯化钠重量"
    },
    "118": {
        "question": "关于输液瓶的洗涤正确的说法是",
        "options": {
            "A": "碱洗法可用2％氢氧化钠冲洗，多用于旧瓶的洗涤",
            "B": "碱洗法可用1％—3％碳酸氢钠冲洗，多用于旧瓶的洗涤",
            "C": "酸洗法用重铬酸钾清洁液洗涤，多用于新瓶的洗涤",
            "D": "碱洗法的洗涤作用比酸洗法弱，故应与玻璃容器有较长的接触时间",
            "E": "酸洗法有强力的消灭微生物和热原的作用，同时能对瓶壁游离碱起中和作用"
        },
        "answer": "E",
        "answer_text": "酸洗法有强力的消灭微生物和热原的作用，同时能对瓶壁游离碱起中和作用"
    },
    "119": {
        "question": "关于输液的灭菌叙述错误的是",
        "choices": {
            "A": "从配制到灭菌以不超过4h为宜",
            "B": "为缩短灭菌时间，输液灭菌开始应速升温",
            "C": "灭菌锅压力下降到零后才能缓慢打开灭菌锅门",
            "D": "塑料输液袋可以采用109℃ 45min灭菌",
            "E": "对于大容器要求F0值大于8min，常用12min"
        },
        "answer": "B",
        "answer_text": "为缩短灭菌时间，输液灭菌开始应速升温"
    },
    "120": {
        "question": "某试制的注射液(输液)使用后造成溶血，应该如何进行改进",
        "choices": {
            "A": "酌情加入抑菌剂",
            "B": "适当增大一些酸性",
            "C": "适当增加NaCl用量",
            "D": "适当增大一些碱性",
            "E": "适当增加水的用量"
        },
        "answer": "C",
        "answer_text": "适当增加NaCl用量"
    },
    "121": {
        "question": "注射用油的灭菌方法是",
        "choices": {
            "A": "干热250℃",
            "B": "干热150℃",
            "C": "湿热121℃",
            "D": "湿热115℃",
            "E": "流通蒸气"
        },
        "answer": "B",
        "answer_text": "干热150℃"
    },
    "122": {
        "question": "下列哪个可作滴眼剂的抑菌剂",
        "choices": {
            "A": "吐温80",
            "B": "三氯叔丁醇",
            "C": "环氧乙烷",
            "D": "碘仿",
            "E": "煤酚皂"
        },
        "answer": "B",
        "answer_text": "三氯叔丁醇"
    },
    "123": {
        "question": "下列哪个因素不影响溶液的滤过速度",
        "choices": {
            "A": "滤器面积",
            "B": "压力差",
            "C": "溶液粘度",
            "D": "颗粒细度",
            "E": "溶液体积"
        },
        "answer": "E",
        "answer_text": "溶液体积"
    },
    "124": {
        "question": "下列哪种物质不能作注射剂的溶媒",
        "choices": {
            "A": "注射用水",
            "B": "注射用油",
            "C": "乙醇",
            "D": "甘油",
            "E": "二甲基亚砜"
        },
        "answer": "E",
        "answer_text": "二甲基亚砜"
    },
    "125": {
        "question": "关于等渗溶液与等张溶液的叙述正确的是",
        "choices": {
            "A": "0．9％的氯化钠既等渗又等张",
            "B": "等渗是生物学概念",
            "C": "等张是物理化学概念",
            "D": "等渗溶液是指与红细胞张力相等的溶液",
            "E": "等张溶液是指渗透压与血浆相等的溶液"
        },
        "answer": "A",
        "answer_text": "0．9％的氯化钠既等渗又等张"
    },
    "126": {
        "question": "混悬型注射剂的质量要求不包括",
        "choices": {
            "A": "颗粒大小适宜",
            "B": "具有良好的通针性",
            "C": "具有良好的再分散性",
            "D": "不得有肉眼可见的浑浊",
            "E": "贮存过程中不结块"
        },
        "answer": "D",
        "answer_text": "不得有肉眼可见的浑浊"
    },
    "127": {
        "question": "制备注射剂的环境区域划分哪一条是正确的",
        "choices": {
            "A": "精滤,灌封,灭菌为洁净区",
            "B": "精滤,灌封,安瓿干燥灭菌后冷却为洁净区",
            "C": "配制,灌封,灭菌为洁净区",
            "D": "灌封,灭菌为洁净区",
            "E": "配制,精滤,灌封,灯检为洁净区"
        },
        "answer": "B",
        "answer_text": "精滤,灌封,安瓿干燥灭菌后冷却为洁净区"
    },
    "128": {
        "question": "噻孢霉素钠的氯化钠等渗当量为0．24，配制2％滴眼剂100ml需加多少克氯化钠",
        "choices": {
            "A": "0．42g",
            "B": "0．61g",
            "C": "0．36g",
            "D": "1．42g",
            "E": "1．36g"
        },
        "answer": "A",
        "answer_text": "0．42g"
    },
    "129": {
        "question": "对维生素C注射液错误的表述是",
        "choices": {
            "A": "可采用亚硫酸氢钠作抗氧剂",
            "B": "处方中加入碳酸氢钠调节pH值使成偏碱性，避免肌注时疼痛",
            "C": "可采用依地酸二钠络合金属离子，增加维生素C稳定性",
            "D": "配制时使用的注射用水需用二氧化碳饱和",
            "E": "采用100℃流通蒸汽15min灭菌"
        },
        "answer": "B",
        "answer_text": "处方中加入碳酸氢钠调节pH值使成偏碱性，避免肌注时疼痛"
    },
    "130": {
        "question": "在注射剂中具有局部止痛和抑菌双重作用的附加剂是",
        "choices": {
            "A": "盐酸普鲁卡因",
            "B": "盐酸利多卡因",
            "C": "苯酚",
            "D": "苯甲醇",
            "E": "硫柳汞"
        },
        "answer": "D",
        "answer_text": "苯甲醇"
    },
    "131": {
        "question": "下列关于冷冻干燥的正确表述",
        "choices": {
            "A": "冷冻干燥是在升温降压条件下水的气液平衡向生成气的方向移动的结果",
            "B": "冷冻干燥是在升温降压条件下水的固气平衡向生成气的方向移动的结果",
            "C": "冷冻干燥应在水的三相点以上的温度与压力下进行",
            "D": "冷冻干燥过程是水分由固变液而后液变气的过程",
            "E": "粘度大的样品较粘度小的样品容易进行冷冻干燥"
        },
        "answer": "E",
        "answer_text": "粘度大的样品较粘度小的样品容易进行冷冻干燥"
    }
}

def display_questions(start, end):
    st.title('试卷展示')
    st.header('选择题')
    st.subheader('[A型题]')

    for question_id, question in questions.items():
        if start <= int(question_id) <= end:
            st.write(f'{question_id}. {question["text"]}')
            for option_key, option_value in question['options'].items():
                st.write(f'{option_key}. {option_value}')
            st.write('---')

def display_question(question_number, question_data):
    st.subheader(f"题目 {question_number}:")
    st.write(question_data['text'])

def search_question(keyword):
    results = []
    for question_number, question_data in questions.items():
        if keyword in question_data['text']:
            results.append(question_number)
    return results

def main():
    st.title("试卷展示应用")
    # display_questions(1,7)
    # 搜索框
    search_keyword = st.text_input('输入关键字搜索题目：')

    # 搜索按钮
    search_button = st.button('搜索')

    if search_button:
        # 执行搜索
        search_results = search_question(search_keyword)

        # 显示搜索结果
        if search_results:
            st.markdown('### 搜索结果：')
            for question_num in search_results:
                # Retrieve question data based on the question number
                question_data = questions.get(str(question_num))
                # Display the question and options
                if question_data:
                    st.markdown(f"**{question_num}.{question_data['text']}**")
                    for option, text in question_data['options'].items():
                        st.markdown(f'- {option}. {text}')
                    st.markdown(f'答案：{question_data["answer"]} - <span style="background-color: yellow;">{question_data["answer_text"]}</span>', unsafe_allow_html=True)
                    st.markdown('---')
                else:
                    st.error("Question not found!")
        else:
            st.markdown('### 搜索结果：无匹配题目')

    # 显示所有题目
    st.markdown('### 所有题目：')
    for question_num, question_data in questions.items():
        st.markdown(f'**题目 {question_num}:** {question_data["text"]}')
        for option, text in question_data['options'].items():
            st.markdown(f'- {option}. {text}')
        st.markdown('---')


if __name__ == '__main__':
    main()
