# -*- coding: utf-8 -*-

import streamlit as st

questions = {
    '1': {
        'text': '《中华人民共和国药典》最早于何年颁布',
        'options': {
            'A': '1950年',
            'B': '1951年',
            'C': '1952年',
            'D': '1953年',
            'E': '1954年'
        },
        'answer': 'D',
        'answer_text': '1953年'
    },
    '2': {
        'text': '药师审查处方时发现处方有涂改处，应采取的正确措施是',
        'options': {
            'A': '让患者与处方医师联系写清',
            'B': '药师只要看清可予调配',
            'C': '药师向处方医师问明情况可予调配',
            'D': '药师与处方医师联系，让处方医师在涂改处签字后方可调配',
            'E': '药师向上级药师请示批准后，在涂改处签字后即可调配'
        },
        'answer': 'D',
        'answer_text': '药师与处方医师联系，让处方医师在涂改处签字后方可调配'
    },
    '3': {
        'text': '《中华人民共和国药典》是由',
        'options': {
            'A': '国家颁布的药品集',
            'B': '国家药品监督管理局制定的药品标准',
            'C': '国家药品委员会制定的药品手册',
            'D': '国家药品监督管理局制定的药品法典',
            'E': '国家编纂的药品规格标准的法典'
        },
        'answer': 'E',
        'answer_text': '国家编纂的药品规格标准的法典'
    },
    '4': {
        'text': '将液体制剂分为胶体溶液．混悬液．乳浊液等属于',
        'options': {
            'A': '按照分散系统分类',
            'B': '按照性状分类',
            'C': '按照物态分类',
            'D': '按照制备方法分类',
            'E': '按照给药途径分类'
        },
        'answer': 'A',
        'answer_text': '按照分散系统分类'
    },
    '5': {
        'text': '下列哪种药物可发生变旋反应',
        'options': {
            'A': '肾上腺素',
            'B': '丁卡因',
            'C': '后马托品',
            'D': '氯霉素',
            'E': '抗坏血酸'
        },
        'answer': 'A',
        'answer_text': '肾上腺素'
    },
    '6': {
        'text': '下列叙述种哪一条是正确的',
        'options': {
            'A': '氨基酸在酸性溶液中称为酸性氨基酸',
            'B': '氨基酸在碱性溶液中称为碱性氨基酸',
            'C': '氨基酸在中性溶液中称为中性氨基酸',
            'D': '以上叙述都对',
            'E': '以上叙述都错'
        },
        'answer': 'D',
        'answer_text': '以上叙述都对'
    },
    '7': {
        'text': '光加速实验一般在光加速实验橱中进行，光橱的照度及光照时间要求为',
        'options': {
            'A': '2000-4000LX，10天',
            'B': '4000-5000LX，10天',
            'C': '1000-3000LX，10天',
            'D': '1000-3000LX，15天',
            'E': '3000-4000LX，15天'
        },
        'answer': 'B',
        'answer_text': '4000-5000LX，10天'
    },
    '8': {
        'text': '以下关于加速试验法的描述哪一种是正确的',
        'options': {
            'A': '以Arrhenius指数方程为基础的加速实验法，只有热分解反应，且活化能在418-1254Kj/mol时才适用',
            'B': '经典恒温法应用于均相系统一般得出较满意的结果，对于非均相系统（如混悬液，乳浊液等）通常误差较大',
            'C': 'Arrhenius指数方程式假设活化能不随温度变化提出的，只考虑温度对反应速度的影响。因此，在加速实验中，其他条件（如溶液的pH）应保持恒定',
            'D': '加速实验测出的有效期为预测有效期，应与留样观察的结果对照，才能得出产品实质的有效期',
            'E': '以上叙述都正确'
        },
        'answer': 'D',
        'answer_text': '加速实验测出的有效期为预测有效期，应与留样观察的结果对照，才能得出产品实质的有效期'
    },
    '9': {
        'text': '下列各项中哪一项用pKb表示',
        'options': {
            'A': '酸的pH值',
            'B': '酸的电离常数',
            'C': '酸式盐的水解平衡常数的负对数',
            'D': '碱的pH值',
            'E': '碱的电离常数'
        },
        'answer': 'E',
        'answer_text': '碱的电离常数'
    },
    '10': {
        'text': '制备下列溶液时，哪个可应用加热溶解法',
        'options': {
            'A': '氢氧化钙',
            'B': '氯化铵',
            'C': '碳酸氢钠',
            'D': '氯化钙（CaCl2·2H2O）',
            'E': '氢氧化钠'
        },
        'answer': 'B',
        'answer_text': '氯化铵'
    },
    '11': {
        'text': '碘化钾有使碘助溶和稳定的作用，下列哪个碘化物有助溶和稳定的作用',
        'options': {
            'A': '碘奥酮（碘吡啦啥）',
            'B': '碘化钙',
            'C': '碘化银',
            'D': '碘化油',
            'E': '碘仿'
        },
        'answer': 'B',
        'answer_text': '碘化钙'
    },
    '12': {
        'text': '下面是关于注射剂稳定性的叙述，指出哪一条是错误的',
        'options': {
            'A': '注射剂的氧化主要是由于某些药物的分子结构中某些基团与空气中的氧相互作用所致。为了防止氧化变色，可加入适量焦亚硫酸钠、亚硫酸钠、硫代硫酸钠、硫脲、抗坏血酸等。',
            'B': '抗坏血酸、盐酸肾上腺素、盐酸普鲁卡因、水杨酸钠、盐酸多巴胺等，在有微量金属离子存在下，可加速变色或分解。实际工作中，为了避免金属离子对药物的催化作用，常加入一定浓度的依地酸二钠或依地酸钙钠。',
            'C': '在注射液中通入惰性气体，也是防止主药氧化变色的有效措施之一。',
            'D': '磺胺嘧啶钠注射液通入二氧化碳气体，以排除药液中溶解的及容器空间的氧，从而使药液稳定。',
            'E': '有些注射液，为了防止氧化、变质，常常是在加入抗氧剂的同时也通入惰性气体。'
        },
        'answer': 'D',
        'answer_text': '磺胺嘧啶钠注射液通入二氧化碳气体，以排除药液中溶解的及容器空间的氧，从而使药液稳定。'
    },
    '13': {
        'text': '下列有关化学动力学的描述哪个是错误的',
        'options': {
            'A': '化学动力学是制剂稳定性加速实验的理论依据，药物制剂降解的规律，生产工艺过程的制定，处方设计及有效期的确定等均与之有关。',
            'B': '化学动力学是研究化学反应的速度以及影响速度的因素的科学。',
            'C': '反应速度系指单位时间，单位体积中反应物下降的量或产物生成量。',
            'D': '在药物制剂的降解反应中，多数药物可按零级、一级反应处理。',
            'E': '对于零级降解的药物制剂，其反应速度积公式为lgC=(-K/2.303)*t+lgC0。'
        },
        'answer': 'E',
        'answer_text': '对于零级降解的药物制剂，其反应速度积公式为lgC=(-K/2.303)*t+lgC0。'
    },
    '14': {
        'text': '下列各种药物中哪个不能发生水解反应',
        'options': {
            'A': '盐酸普鲁卡因',
            'B': '乙酰水杨酸',
            'C': '青霉素和头孢菌素等',
            'D': '巴比妥类',
            'E': '维生素C'
        },
        'answer': 'E',
        'answer_text': '维生素C'
    },
    '15': {
        'text': '药物稳定与否的根本原因在于自身的化学结构，外界因素则是引起变化的条件，影响药物制剂降解的外界因素主要有',
        'options': {
            'A': 'pH值与温度',
            'B': '溶剂介电常数及电子强度',
            'C': '赋型剂或附加剂的影响',
            'D': '水分、氧、金属离子和光线',
            'E': '以上都对'
        },
        'answer': 'E',
        'answer_text': '以上都对'
    },
    '16': {
        'text': '对于液体制剂，为了延缓药物降解可采用下述那种措施',
        'options': {
            'A': '调节pH值或改变溶质组成',
            'B': '充入惰性气体',
            'C': '加入附加剂如抗氧剂、螯合剂、抗光解剂等',
            'D': '改变剂型',
            'E': '以上措施均可采用'
        },
        'answer': 'E',
        'answer_text': '以上措施均可采用'
    },
    '17': {
        'text': '对于固体制剂，延缓药物降解措施有',
        'options': {
            'A': '加入干燥剂或（和）改善包装',
            'B': '改变生产工艺和直接压片、包衣等',
            'C': '改变剂型',
            'D': '制定稳定的衍生物',
            'E': '以上措施均可采用'
        },
        'answer': 'E',
        'answer_text': '以上措施均可采用'
    },
    '18': {
        'text': '下列有关药物稳定性正确的叙述是',
        'options': {
            'A': '亚稳定型晶型属于热力学不稳定晶型，制剂中应避免使用。',
            'B': '乳剂的分层是不可逆现象。',
            'C': '为增加混悬液稳定性，加入的能降低Zeta电位、粒子絮凝程度增加的电解质称为絮凝剂。',
            'D': '乳剂破裂后，加以震摇，能重新分散，恢复成原来状态的乳剂。',
            'E': '凡给出质子或接受质子的物质的催化反应称特殊酸碱催化反应。'
        },
        'answer': 'C',
        'answer_text': '为增加混悬液稳定性，加入的能降低Zeta电位、粒子絮凝程度增加的电解质称为絮凝剂。'
    },
    '19': {
        'text': '关于药物稳定性的正确叙述是',
        'options': {
            'A': '盐酸普鲁卡因溶液的稳定性受温度影响，与pH值无关。',
            'B': '药物的降解速度与粒子强度无关。',
            'C': '固体制剂的赋型剂不影响药物稳定性。',
            'D': '药物的降解速度与溶剂无关。',
            'E': '零级反应的反应速度与反应溶度无关。'
        },
        'answer': 'E',
        'answer_text': '零级反应的反应速度与反应溶度无关。'
    },
    '20': {
        'text': '下列不属于表面活性剂类别的是',
        'options': {
            'A': '脱水山梨醇脂肪酸脂类',
            'B': '聚氧乙烯去水山梨醇脂肪酸脂类',
            'C': '聚氧乙烯脂肪酸脂类',
            'D': '聚氧乙烯脂肪醇醚类',
            'E': '聚氧乙烯脂肪酸醇类'
        },
        'answer': 'E',
        'answer_text': '聚氧乙烯脂肪酸醇类'
    },
    '21': {
        'text': '不同HLB值的表面活性剂用途不同，下列错误者为',
        'options': {
            'A': '增溶剂最适范围为15-18以上',
            'B': '去污剂最适范围为13-16',
            'C': '润湿剂与铺展剂最适范围为7-9',
            'D': '大部分消泡剂最适范围为5-8',
            'E': 'O/W乳化剂最适范围为8-16'
        },
        'answer': 'D',
        'answer_text': '大部分消泡剂最适范围为5-8'
    },
    '22': {
        'text': '天然高分子助悬剂阿拉伯胶(或胶浆)一般用量是',
        'options': {
            'A': '1%-2%',
            'B': '1%-5%',
            'C': '5%-15%',
            'D': '10%-15%',
            'E': '12%-15%'
        },
        'answer': 'C',
        'answer_text': '5%-15%'
    },
    '23': {
        'text': '下列与表面活性剂特性无关的是',
        'options': {
            'A': '适宜的粘稠度',
            'B': '克氏点和昙点',
            'C': '亲水亲油平衡值',
            'D': '临界胶团浓度',
            'E': '表面活性'
        },
        'answer': 'A',
        'answer_text': '适宜的粘稠度'
    },
    '24': {
        'text': '下属哪种方法不能增加药物溶解度',
        'options': {
            'A': '加入助溶剂',
            'B': '加入非离子型表面活性剂',
            'C': '制成盐类',
            'D': '应用潜溶剂',
            'E': '加入助悬剂'
        },
        'answer': 'E',
        'answer_text': '加入助悬剂'
    },
    '25': {
        'text': '下列关于表面活性剂性质的叙述中正确的是',
        'options': {
            'A': '有亲水基团，无疏水基团',
            'B': '有疏水基团，无亲水基团',
            'C': '疏水基团、亲水基团均有',
            'D': '有中等极性基团',
            'E': '无极性基团'
        },
        'answer': 'C',
        'answer_text': '疏水基团、亲水基团均有'
    },
    '26': {
        'text': '下列表面活性剂有起昙现象的主要是哪一类',
        'options': {
            'A': '肥皂',
            'B': '硫酸化物',
            'C': '磺酸化物',
            'D': '季铵化物',
            'E': '吐温'
        },
        'answer': 'E',
        'answer_text': '吐温'
    },
    '27': {
        'text': '灭菌的标准以杀死          为准。',
        'options': {
            'A': '热原',
            'B': '微生物',
            'C': '细菌',
            'D': '真菌',
            'E': '芽胞'
        },
        'answer': 'A',
        'answer_text': '热原'
    },
    '28': {
        'text': '作为热压灭菌法可靠性的控制标准是                    。',
        'options': {
            'A': 'F值',
            'B': 'F0值',
            'C': 'D值',
            'D': 'Z值',
            'E': 'N值'
        },
        'answer': 'B',
        'answer_text': 'F0值'
    },
    '29': {
        'text': '热压灭菌的F0一般要求为',
        'options': {
            'A': '8-12',
            'B': '6-8',
            'C': '2-8',
            'D': '1.6-2.0',
            'E': '4-6'
        },
        'answer': 'A',
        'answer_text': '8-12'
    },
    '30': {
        'text': '下列关于粉碎的叙述哪一项是错误的',
        'options': {
            'A': '一般的粉碎，主要利用外加机械力，部分的破坏物质分子间的内聚力来达到粉碎的目的',
            'B': '药物粉碎前，必须适当干燥',
            'C': '在粉碎过程中，应把已达到要求细度的粉末随时取出',
            'D': '一般说来，中草药用较高的温度急速加热并冷却后不利于粉碎的进行',
            'E': '一般可用降低温度来提高非晶体药物的粉碎效率'
        },
        'answer': 'D',
        'answer_text': '一般说来，中草药用较高的温度急速加热并冷却后不利于粉碎的进行'
    },
    '31': {
        'text': '下列关于单独粉碎的叙述哪一项是错误的',
        'options': {
            'A': '氧化性药物和还原性药物应单独粉碎',
            'B': '贵细药材应单独粉碎',
            'C': '挥发性强烈的药材应单独粉碎',
            'D': '含糖量较多的粘性药材应单独粉碎',
            'E': '细小种子类药材应单独粉碎'
        },
        'answer': 'D',
        'answer_text': '含糖量较多的粘性药材应单独粉碎'
    },
    '32': {
        'text': '下列关于混合粉碎法的叙述哪一项是错误的',
        'options': {
            'A': '处方中某些药物的性质及硬度相似，则可以将它们掺合在一起进行混合粉碎',
            'B': '混合粉碎可以避免一些粘性药物单独粉碎的困难',
            'C': '混合粉碎可以使粉碎和混合操作结合进行',
            'D': '含脂肪油较多的药物不宜混合粉碎',
            'E': '对混合粉碎可能产生共熔现象者，则视制剂具体要求决定粉碎方法'
        },
        'answer': 'D',
        'answer_text': '含脂肪油较多的药物不宜混合粉碎'
    },
    '33': {
        'text': '下列关于粉碎的叙述哪一项是错误的',
        'options': {
            'A': '干法粉碎是把药物经过适当的干燥处理，使药物含水量降低至一定限度再进行粉碎的方法',
            'B': '湿法粉碎是指药物中加入适量的水或其他液体进行研磨粉碎的方法',
            'C': '药物的干燥温度一般不宜超过105℃，含水量不宜超过1.0%',
            'D': '湿法粉碎通常液体的选用是以药物遇湿不膨胀、两者不起变化、不妨碍药效为原则',
            'E': '湿法粉碎常用的有“加液研磨法”和“水飞法”'
        },
        'answer': 'C',
        'answer_text': '药物的干燥温度一般不宜超过105℃，含水量不宜超过1.0%'
    },
    '34': {
        'text': '粉碎器械一般按其主要粉碎作用力分类，下列叙述哪一项是错误的',
        'options': {
            'A': '压片机、截切机、以截切作用为主',
            'B': '滚压机以挤压作用为主',
            'C': '万能磨粉机以撞击作用为主',
            'D': '流能磨以研磨作用为主',
            'E': '羚羊角粉碎机以锉削作用为主'
        },
        'answer': 'D',
        'answer_text': '流能磨以研磨作用为主'
    },
    '35': {
        'text': '下列关于球磨机的叙述哪一项是错误的',
        'options': {
            'A': '是以研磨与撞击作用为主的粉碎器械',
            'B': '一般要求粉碎物料的直径不应大于圆球直径的1/4-1/9',
            'C': '投料量为筒总容量的30%',
            'D': '圆球加入量为筒总容量的30%-35%',
            'E': '电机转速的实践经验值是临界转速的75%'
        },
        'answer': 'C',
        'answer_text': '投料量为筒总容量的30%'
    },
    '36': {
        'text': '工业筛筛孔数目即目数习惯上指',
        'options': {
            'A': '每厘米长度上筛孔数目',
            'B': '每平方米面积上筛孔数目',
            'C': '每英寸长度上筛孔的数目',
            'D': '每平方英寸面积上筛孔数目',
            'E': '每市寸长度上筛孔数目'
        },
        'answer': 'C',
        'answer_text': '每英寸长度上筛孔的数目'
    },
    '37': {
        'text': '六号药筛相当于工业筛多少目',
        'options': {
            'A': '24目',
            'B': '60目',
            'C': '80目',
            'D': '100目',
            'E': '120目'
        },
        'answer': 'D',
        'answer_text': '100目'
    },
    '38': {
        'text': '乳香．没药最好采用哪种方法粉碎',
        'options': {
            'A': '水飞法',
            'B': '串研法',
            'C': '串油法',
            'D': '低温法',
            'E': '加液研磨法'
        },
        'answer': 'D',
        'answer_text': '低温法'
    },
    '39': {
        'text': '需要水飞法粉碎的药物是',
        'options': {
            'A': '冰片',
            'B': '水杨酸',
            'C': '麦冬',
            'D': '朱砂',
            'E': '杏仁'
        },
        'answer': 'D',
        'answer_text': '朱砂'
    },
    '40': {
        'text': '关于灭菌法的叙述错误的是',
        'options': {
            'A': '灭菌法是指杀死或除去所有微生物的方法',
            'B': '微生物包括细菌．真菌．病毒',
            'C': '灭菌效果应以杀死芽孢为准',
            'D': '煮沸灭菌可杀灭细菌繁殖体及芽孢',
            'E': '热压灭菌法在制剂生产中应用最广泛'
        },
        'answer': 'D',
        'answer_text': '煮沸灭菌可杀灭细菌繁殖体及芽孢'
    },
    '41': {
        'text': '热压灭菌所用的蒸气是',
        'options': {
            'A': '过饱和蒸汽',
            'B': '饱和蒸汽',
            'C': '过热蒸汽',
            'D': '流通蒸汽',
            'E': '126℃蒸汽'
        },
        'answer': 'B',
        'answer_text': '饱和蒸汽'
    },
    '42': {
        'text': '油脂性基质的灭菌方法是',
        'options': {
            'A': '紫外线灭菌',
            'B': '干热空气灭菌',
            'C': '流通蒸汽灭菌',
            'D': '气体灭菌',
            'E': '辐射灭菌'
        },
        'answer': 'B',
        'answer_text': '干热空气灭菌'
    },
    "43": {
        "text": "A级洁净室每立方米浮游菌的总数不得超过",
        "options": {
            "A": "5",
            "B": "1",
            "C": "0",
            "D": "3",
            "E": "2"
        },
        "answer": "D",
        "answer_text": "3"
    },
    "44": {
        "text": "微生物限度检查抽样量为检验量的倍",
        "options": {
            "A": "1",
            "B": "2",
            "C": "3",
            "D": "4",
            "E": "5"
        },
        "answer": "C",
        "answer_text": "3"
    },
    "45": {
        "text": "湿法制粒压片工艺的目的是改善主药的",
        "options": {
            "A": "可压性和流动性",
            "B": "崩解性和溶出性",
            "C": "防潮性和稳定性",
            "D": "润滑性和抗黏着性",
            "E": "流动性和崩解性"
        },
        "answer": "A",
        "answer_text": "可压性和流动性"
    },
    "46": {
        "text": "湿法制粒压片的工艺流程为",
        "options": {
            "A": "原辅料→混合→制软材→制湿粒→干燥→整粒→压片",
            "B": "原辅料→混合→制软材→制湿粒→压片",
            "C": "原辅料→混合→制软材呻制干粒→压片",
            "D": "原辅料→混合→制湿粒→干燥→压片",
            "E": "原辅料→混合→制软材→干燥→压片"
        },
        "answer": "A",
        "answer_text": "原辅料→混合→制软材→制湿粒→干燥→整粒→压片"
    },
    "47": {
        "text": "属于干法制粒的是",
        "options": {
            "A": "一步制粒法",
            "B": "挤压制粒",
            "C": "喷雾制粒法",
            "D": "滚压制粒法",
            "E": "高速搅拌制粒"
        },
        "answer": "D",
        "answer_text": "滚压制粒法"
    },
    "48": {
        "text": "不属于液体药剂者为",
        "options": {
            "A": "合剂",
            "B": "搽剂",
            "C": "灌肠剂",
            "D": "醑剂",
            "E": "注射液"
        },
        "answer": "E",
        "answer_text": "注射液"
    },
    "49": {
        "text": "对液体制剂质量要求错误者为",
        "options": {
            "A": "溶液型药剂应澄明",
            "B": "分散媒最好用有机分散媒",
            "C": "有效成分浓度应准确．稳定",
            "D": "乳浊液型药剂应保证其分散相小而均匀",
            "E": "制剂应有一定的防腐能力"
        },
        "answer": "B",
        "answer_text": "分散媒最好用有机分散媒"
    },
    "50": {
        "text": "液体制剂规定染菌数限量要求为每克或每毫升内不超过",
        "options": {
            "A": "100个",
            "B": "200个",
            "C": "300个",
            "D": "400个",
            "E": "500个"
        },
        "answer": "A",
        "answer_text": "100个"
    },
    "51": {
        "text": "有关制剂pH对微生物生长影响叙述错误的是",
        "options": {
            "A": "霉菌可在较广pH范围内生长",
            "B": "霉菌生长最适宜pH是4-6",
            "C": "细菌通常是在中性时最易于生长",
            "D": "细菌生长适宜pH是5-8",
            "E": "碱性范围对霉菌、细菌都不适宜"
        },
        "answer": "B",
        "answer_text": "霉菌生长最适宜pH是4-6"
    },
    "52": {
        "text": "人工合成色素液体药剂中一般用量为",
        "options": {
            "A": "1/百万-2/百万",
            "B": "2/百万-5/百万",
            "C": "5/百万-10/百万",
            "D": "5/百万-8百万",
            "E": "8/百万-10/百万"
        },
        "answer": "C",
        "answer_text": "5/百万-10/百万"
    },
    "53": {
        "text": "最适合作O／W型乳剂的乳化剂的HLB值是",
        "options": {
            "A": "HLB值在1-3",
            "B": "HLB值在3-8",
            "C": "HLB值在8-16",
            "D": "HLB值在7-9",
            "E": "HLB值在13-16"
        },
        "answer": "C",
        "answer_text": "HLB值在8-16"
    },
    "54": {
        "text": "乳剂制备方法中水相加至含乳化剂的油相中的方法",
        "options": {
            "A": "手工法",
            "B": "干胶法",
            "C": "湿胶法",
            "D": "新生皂法",
            "E": "机械法"
        },
        "answer": "B",
        "answer_text": "干胶法"
    },
    "55": {
        "text": "单糖浆为蔗糖的水溶液，含蔗糖量",
        "options": {
            "A": "85%（g/ml）或64.7%(g/g)",
            "B": "86%(g/ml)或64.7%(g/g)",
            "C": "85%(g/ml)或65.7%(g/g)",
            "D": "86%(g/ml)或65.7%(g/g)",
            "E": "86%(g/ml)或66.7%(g/g)"
        },
        "answer": "A",
        "answer_text": "85%（g/ml）或64.7%(g/g)"
    },
    "56": {
        "text": "有关疏水胶的叙述错误者为",
        "options": {
            "A": "系多相分散体系",
            "B": "粘度与渗透压较大",
            "C": "表面张力与分散媒相近",
            "D": "分散相与分散媒没有亲和力",
            "E": "TynD．A．ll效应明显"
        },
        "answer": "B",
        "answer_text": "粘度与渗透压较大"
    },
    "57": {
        "text": "天然高分子助悬剂阿拉伯胶(或胶浆)一般用量是",
        "options": {
            "A": "1%-2%",
            "B": "2%-5%",
            "C": "5%-15%",
            "D": "10%-15%",
            "E": "12%-15%"
        },
        "answer": "C",
        "answer_text": "5%-15%"
    },
    "58": {
        "text": "微乳(miC，romulsions)乳滴直径在",
        "options": {
            "A": "120nm",
            "B": "140nm",
            "C": "160nm",
            "D": "180nm",
            "E": "200nm"
        },
        "answer": "B",
        "answer_text": "140nm"
    },
    "59": {
        "text": "下列乳剂处方拟定原则中错误者是",
        "options": {
            "A": "乳剂中两相体积比值应在25%-50%",
            "B": "根据乳剂类型不同，选用所需HLB（亲水亲脂平衡）值的乳化剂",
            "C": "根据需要调节乳剂粘度",
            "D": "选择适当的氧化剂",
            "E": "根据需要调节乳剂流变性"
        },
        "answer": "D",
        "answer_text": "选择适当的氧化剂"
    },
    "60": {
        "text": "制备混悬液时，加入亲水高分子材料，增加体系的黏度，称为",
        "options": {
            "A": "助悬剂",
            "B": "润湿剂",
            "C": "增溶剂",
            "D": "絮凝剂",
            "E": "乳剂"
        },
        "answer": "A",
        "answer_text": "助悬剂"
    },
    "61": {
        "text": "作为药用乳化剂最合适的HLB值为",
        "options": {
            "A": "2-5（W/O型）；6-10（O/W型）",
            "B": "4-9（W/O型）；8-10（O/W型）",
            "C": "3-8（W/O型）；8-16（O/W型）",
            "D": "8（W/O型）；6-10（O/W型）",
            "E": "2-5（W/O型）；8-16（O/W型）"
        },
        "answer": "C",
        "answer_text": "3-8（W/O型）；8-16（O/W型）"
    },
    "62": {
        "text": "以下关于液体药剂的叙述错误的是",
        "options": {
            "A": "溶液分散相粒径一般小于1nm",
            "B": "胶体溶液型药剂分散相粒径一般在1-100nm",
            "C": "混悬型药剂分散相微粒的粒径一般在100μm以上",
            "D": "乳浊液分散相液滴直径在1nm-25μm",
            "E": "混悬型药剂属粗分散系"
        },
        "answer": "C",
        "answer_text": "混悬型药剂分散相微粒的粒径一般在100μm以上"
    },
    "63": {
        "text": "乳剂中分散的乳滴聚集形成疏松的聚集体，经振摇即能恢复成均匀乳剂的现象，称为乳剂的",
        "options": {
            "A": "分层",
            "B": "絮凝",
            "C": "转相",
            "D": "合并",
            "E": "破裂"
        },
        "answer": "B",
        "answer_text": "絮凝"
    },
    "64": {
        "text": "下列哪种物质不能作为混悬剂的助悬剂用",
        "options": {
            "A": "西黄蓍胶",
            "B": "海藻酸钠",
            "C": "硬脂酸钠",
            "D": "羧甲基纤维素",
            "E": "硅皂土"
        },
        "answer": "C",
        "answer_text": "硬脂酸钠"
    },
    "65": {
        "text": "根据Stoke's定律，混悬微粒沉降速度与下列哪个因素成正比",
        "options": {
            "A": "混悬微粒半径",
            "B": "混悬微粒粒速",
            "C": "混悬微粒半径平方",
            "D": "混悬微粒粉碎度",
            "E": "混悬微粒直径"
        },
        "answer": "A",
        "answer_text": "混悬微粒半径"
    },
    "66": {
        "text": "有“万能”溶剂之称的是",
        "options": {
            "A": "水",
            "B": "甘油",
            "C": "乙醇",
            "D": "二甲基亚砜",
            "E": "醋酸乙酯"
        },
        "answer": "D",
        "answer_text": "二甲基亚砜"
    },
    "67": {
        "text": "属于半极性溶剂的是",
        "options": {
            "A": "水",
            "B": "甘油",
            "C": "丙二醇",
            "D": "二甲基亚砜",
            "E": "脂肪油"
        },
        "answer": "C",
        "answer_text": "丙二醇"
    },
    "68": {
        "text": "于溶胶剂中加入亲水性高分子溶液，作为",
        "options": {
            "A": "助悬剂",
            "B": "絮凝剂",
            "C": "脱水剂",
            "D": "保护胶",
            "E": "乳化剂"
        },
        "answer": "D",
        "answer_text": "保护胶"
    },
    "69": {
        "text": "属于O／W型固体微粒类乳化剂的是",
        "options": {
            "A": "氢氧化钙",
            "B": "氢氧化锌",
            "C": "氢氧化铝",
            "D": "阿拉伯胶",
            "E": "十二烷基硫酸钠"
        },
        "answer": "C",
        "answer_text": "氢氧化铝"
    },
    "70": {
        "text": "溶液型液体制剂分散相质点的直径是",
        "options": {
            "A": ">lnm",
            "B": ">lμm",
            "C": "<lμm",
            "D": "<lnm",
            "E": "<10μm"
        },
        "answer": "D",
        "answer_text": "<lnm"
    },
    "71": {
        "text": "单糖浆的含糖量(g／m1)应为",
        "options": {
            "A": "85％",
            "B": "65％",
            "C": "60％",
            "D": "64．7％",
            "E": "75％"
        },
        "answer": "A",
        "answer_text": "85％"
    },
    "72": {
        "text": "混悬剂中添加胶浆剂的主要作用是",
        "options": {
            "A": "分散",
            "B": "絮凝",
            "C": "润湿",
            "D": "乳化",
            "E": "助悬"
        },
        "answer": "E",
        "answer_text": "助悬"
    },
    "73": {
        "text": "下列属于均相分散体系的是",
        "options": {
            "A": "混悬剂",
            "B": "溶胶剂",
            "C": "O/W型乳剂",
            "D": "高分子溶液剂",
            "E": "W/O型乳剂"
        },
        "answer": "D",
        "answer_text": "高分子溶液剂"
    },
    "74": {
        "text": "下述哪种方法不能增加药物的溶解度",
        "options": {
            "A": "加入助溶剂",
            "B": "加入增溶剂",
            "C": "采用混合溶剂",
            "D": "搅拌",
            "E": "制成盐类"
        },
        "answer": "D",
        "answer_text": "搅拌"
    },
    "75": {
        "text": "根据Stoke`s定律，混悬微粒沉降速率与下列哪个因素成反比",
        "options": {
            "A": "混悬微粒的半径",
            "B": "混悬微粒的直径",
            "C": "混悬微粒的半径平方",
            "D": "分散介质的黏度",
            "E": "混悬微粒的密度"
        },
        "answer": "D",
        "answer_text": "分散介质的黏度"
    },
    "76": {
        "text": "极性溶剂是",
        "options": {
            "A": "甘油",
            "B": "聚乙二醇",
            "C": "丙二醇",
            "D": "液体石蜡",
            "E": "醋酸乙酯"
        },
        "answer": "A",
        "answer_text": "甘油"
    },
    "77": {
        "text": "非极性溶剂是",
        "options": {
            "A": "水",
            "B": "聚乙二醇",
            "C": "甘油",
            "D": "液体石蜡",
            "E": "DMSO"
        },
        "answer": "D",
        "answer_text": "液体石蜡"
    },
    "78": {
        "text": "下列哪是常用防腐剂",
        "options": {
            "A": "氯化钠",
            "B": "苯甲酸钠",
            "C": "氢氧化钠",
            "D": "亚硫酸钠",
            "E": "硫酸钠"
        },
        "answer": "B",
        "answer_text": "苯甲酸钠"
    },
    "79": {
        "text": "关于溶液剂的制法叙述错误的是",
        "options": {
            "A": "制备工艺过程中先取处方中全部溶剂加药物溶解",
            "B": "处方中如有附加剂或溶解度较小的药物，应先将其溶解于溶剂中",
            "C": "药物在溶解过程中应采用粉碎、加热、搅拌等措施",
            "D": "易氧化的药物溶解时宜将溶剂加热放冷后再溶解药物",
            "E": "对易挥发性药物应在最后加入"
        },
        "answer": "A",
        "answer_text": "制备工艺过程中先取处方中全部溶剂加药物溶解"
    },
    "80": {
        "text": "最适合作W／O型乳剂的乳化剂的HLB值是",
        "options": {
            "A": "HLB值在1-3",
            "B": "HLB值在3-8",
            "C": "HLB值在8-16",
            "D": "HLB值在7-9",
            "E": "HLB值在13-16"
        },
        "answer": "B",
        "answer_text": "HLB值在3-8"
    },
    "81": {
        "text": "关于注射剂的质量要求叙述正确的是",
        "options": {
            "A": "允许pH值范围在5-11",
            "B": "脊椎腔内注射的药液可以偏低渗",
            "C": "溶液型注射液不得有肉眼可见的混浊或异物",
            "D": "脊椎腔注射的注射剂因为用量小可不进行热原检查",
            "E": "大量输入体内的注射剂可以低渗"
        },
        "answer": "C",
        "answer_text": "溶液型注射液不得有肉眼可见的混浊或异物"
    },
    "82": {
        "text": "关于注射剂的给药途径的叙述正确的是",
        "options": {
            "A": "静脉注射起效快，为急救首选的手段",
            "B": "油溶液型和混悬型注射液可以少量静脉注射",
            "C": "油溶液型和混悬型注射液不可作肌内注射",
            "D": "皮内注射是注射于真皮与肌肉之间",
            "E": "皮下注射是注射于表皮与真皮之间，一次注射量在0.2m1以下"
        },
        "answer": "A",
        "answer_text": "静脉注射起效快，为急救首选的手段"
    },
    "83": {
        "text": "注射用水和蒸馏水的检查项目的主要区别是",
        "options": {
            "A": "酸碱度",
            "B": "热原",
            "C": "氯化物",
            "D": "氨",
            "E": "硫酸盐"
        },
        "answer": "B",
        "answer_text": "热原"
    },
    "84": {
        "text": "中国药典规定的注射用水应是",
        "options": {
            "A": "纯净水",
            "B": "蒸馏水",
            "C": "去离子水",
            "D": "灭菌蒸馏水",
            "E": "蒸馏水或去离子水再经蒸馏而制得的水"
        },
        "answer": "E",
        "answer_text": "蒸馏水或去离子水再经蒸馏而制得的水"
    },
    "85": {
        "text": "热原是微生物产生的内毒素，其致热活性中心是",
        "options": {
            "A": "蛋白质",
            "B": "多糖",
            "C": "磷脂",
            "D": "脂多糖",
            "E": "核糖核酸"
        },
        "answer": "D",
        "answer_text": "脂多糖"
    },
    "86": {
        "text": "下列对热原性质的正确描述是",
        "options": {
            "A": "有一定的耐热性、不挥发",
            "B": "有一定的耐热性、不溶于水",
            "C": "有挥发性但可被吸附",
            "D": "溶于水，不能被吸附",
            "E": "耐强酸、强碱、强氧化剂"
        },
        "answer": "ACE",
        "answer_text": "A.有一定的耐热性、不挥发, C.有挥发性但可被吸附, E.耐强酸、强碱、强氧化剂"
    },
    "87": {
        "text": "热原的相对分子质量一般为",
        "options": {
            "A": "104",
            "B": "105",
            "C": "106",
            "D": "107",
            "E": "108"
        },
        "answer": "C",
        "answer_text": "106"
    },
    "88": {
        "text": "下列关于热原的叙述正确的是",
        "options": {
            "A": "180℃ 3—4h可以彻底破坏热原",
            "B": "热原大小在1-5mm之间，可以被微孔滤膜截留",
            "C": "热原能溶于水，超滤装置也不能将其除去",
            "D": "活性炭可以吸附色素与杂质，但不能吸附热原",
            "E": "反渗透法不能除去热原"
        },
        "answer": "A",
        "answer_text": "180℃ 3—4h可以彻底破坏热原"
    },
    "89": {
        "text": "综合法制备注射用水的工艺流程正确的",
        "options": {
            "A": "自来水一过滤器—离子交换树脂床—多效蒸馏水机—电渗析装置一注射用水",
            "B": "自来水一离子交换树脂床—电渗析装置一过滤器—多效蒸馏水机—注射用水",
            "C": "自来水一过滤器一离子交换树脂床一电渗析装置一多效蒸馏水机一注射用水",
            "D": "自来水一过滤器一电渗析装置一离子交换树脂床一多效蒸馏水机一注射用水",
            "E": "自来水一离子交换树脂床一电渗析装置一多效蒸馏水机一过滤器一注射用水"
        },
        "answer": "D",
        "answer_text": "自来水一过滤器一电渗析装置一离子交换树脂床一多效蒸馏水机一注射用水"
    },
    "90": {
        "text": "在某注射剂中加入焦亚硫酸钠，其作用为",
        "options": {
            "A": "抑菌剂",
            "B": "抗氧剂",
            "C": "止痛剂",
            "D": "络合剂",
            "E": "乳化剂"
        },
        "answer": "B",
        "answer_text": "抗氧剂"
    },
    "91": {
        "text": "一般不能用于注射剂的表面活性剂是",
        "options": {
            "A": "硬脂酸钙",
            "B": "泊洛沙姆188",
            "C": "聚山梨酯80",
            "D": "卵磷脂",
            "E": "聚氧乙烯蓖麻油"
        },
        "answer": "A",
        "answer_text": "硬脂酸钙"
    },
    "92": {
        "text": "注射剂中加入硫代硫酸钠作为抗氧剂时，通入的气体应该是",
        "options": {
            "A": "O2",
            "B": "H2",
            "C": "CO2",
            "D": "空气",
            "E": "N2"
        },
        "answer": "E",
        "answer_text": "N2"
    },
    "93": {
        "text": "焦亚硫酸钠是一种常用的抗氧剂，最适用于",
        "options": {
            "A": "偏酸性溶液",
            "B": "偏碱性溶液",
            "C": "不受酸碱性影响",
            "D": "强酸溶液",
            "E": "以上均不适用"
        },
        "answer": "A",
        "answer_text": "偏酸性溶液"
    },
    "94": {
        "text": "在制剂中作为金属离子络合剂使用的是",
        "options": {
            "A": "NaHCO3",
            "B": "NaCl",
            "C": "焦亚硫酸钠",
            "D": "NaOH",
            "E": "依地酸二钠"
        },
        "answer": "E",
        "answer_text": "依地酸二钠"
    },
    "95": {
        "text": "关于注射剂生产区域的划分，下列说法错误的是",
        "options": {
            "A": "洁净区是指有较高洁净度要求和较严格菌落数要求的生产房间",
            "B": "控制区是指洁净度和菌落数有一定要求的生产或辅助房间",
            "C": "一般生产区是指无空气洁净度要求的生产或辅助房间",
            "D": "注射剂的灭菌、印字和包装应在控制区完成",
            "E": "最后可灭菌的注射剂的精滤应在洁净区完成"
        },
        "answer": "D",
        "answer_text": "注射剂的灭菌、印字和包装应在控制区完成"
    },
    "96": {
        "text": "空气净化技术主要是通过控制生产场所中的哪一项",
        "options": {
            "A": "空气中的尘粒浓度",
            "B": "空气细菌污染水平",
            "C": "保持适宜的温度",
            "D": "保持适宜的湿度",
            "E": "以上均控制"
        },
        "answer": "E",
        "answer_text": "以上均控制"
    },
    "97": {
        "text": "大体积(>50ml)注射剂过滤和灌封生产区的洁净度要求是",
        "options": {
            "A": "D级",
            "B": "C级",
            "C": "B级",
            "D": "A级",
            "E": "E级"
        },
        "answer": "E",
        "answer_text": "E级"
    },
    "98": {
        "text": "注射用抗生素粉末分装室洁净度要求为",
        "options": {
            "A": "D级",
            "B": "C级",
            "C": "B级",
            "D": "A级",
            "E": "BC均可"
        },
        "answer": "D",
        "answer_text": "A级"
    },
    "99": {
        "text": "关于层流净化特点的叙述错误的是",
        "options": {
            "A": "可控制洁净室的温度与湿度",
            "B": "进入洁净室的空气经滤过处理",
            "C": "洁净室新产生的微粒可沿层流方向带走",
            "D": "空调净化就是层流净化",
            "E": "室内空气不会出现停滞"
        },
        "answer": "D",
        "answer_text": "空调净化就是层流净化"
    },
    "100": {
        "text": "关于注射剂容器的处理错误的说法是",
        "options": {
            "A": "安瓿一般在烘箱内120—140℃干燥",
            "B": "盛装无菌操作的安瓿须用180℃干热灭菌1h",
            "C": "盛装低温灭菌的安瓿须用180℃干热灭菌1h",
            "D": "大量生产多采用隧道式烘箱干燥，隧道内平均温度200℃",
            "E": "采用远红外干燥装置350℃经lmin，能达到安瓿灭菌的目的"
        },
        "answer": "E",
        "answer_text": "采用远红外干燥装置350℃经lmin，能达到安瓿灭菌的目的"
    },
    "101": {
        "text": "关于注射液的配制方法叙述正确的是",
        "options": {
            "A": "原料质量不好时宜采用稀配法",
            "B": "溶解度小的杂质在稀配时容易滤过除去",
            "C": "原料质量好时宜采用浓配法",
            "D": "活性炭在碱性溶液中对杂质的吸附作用比在酸性溶液中强",
            "E": "活性炭吸附杂质常用浓度为0.1％-0.3％"
        },
        "answer": "E",
        "answer_text": "活性炭吸附杂质常用浓度为0.1％-0.3％"
    },
    "102": {
        "text": "滤过的影响因素不包括",
        "options": {
            "A": "待滤过液的体积",
            "B": "滤过压力差",
            "C": "毛细管半径",
            "D": "滤渣层厚度",
            "E": "滤液粘度"
        },
        "answer": "D",
        "answer_text": "滤过的影响因素不包括滤渣层厚度"
    },
    "103": {
        "text": "关于滤过器的特点叙述错误的是",
        "options": {
            "A": "垂熔玻璃滤器化学性质稳定，易于清洗，可以热压灭菌",
            "B": "砂滤棒对药液吸附性强，价廉易得、滤速快",
            "C": "微孔滤膜截留能力强，不易堵塞，不易破碎",
            "D": "微孔滤膜孔径测定一般用气泡点法",
            "E": "钛滤器抗热抗震性能好，不易破碎，可用于注射剂中的脱炭过滤和除微粒过滤"
        },
        "answer": "C",
        "answer_text": "微孔滤膜截留能力强，不易堵塞，不易破碎"
    },
    "104": {
        "text": "关于滤过装置的叙述错误的是",
        "options": {
            "A": "高位静压滤过压力稳定，质量好，滤速慢",
            "B": "减压滤过压力稳定，滤层不易松动，药液不易污染",
            "C": "加压滤过压力稳定，滤速快，药液不易污染",
            "D": "无菌滤过宜采用加压滤过",
            "E": "滤过一般采用砂滤棒—垂熔玻璃滤球一微孔滤膜的串联模式"
        },
        "answer": "B",
        "answer_text": "减压滤过压力稳定，滤层不易松动，药液不易污染"
    },
    "105": {
        "text": "关于注射剂的灭菌叙述错误的是",
        "options": {
            "A": "选择灭菌法时应考虑灭菌效果与制剂的稳定性",
            "B": "凡对热稳定的产品应该热压灭菌",
            "C": "對热不稳定的产品可采用流通蒸气灭菌，但生产过程应注意避菌",
            "D": "相同品种，不同批号的注射剂可在同一灭菌区内同时灭菌",
            "E": "相同色泽．不同品种的注射剂不可在同一灭菌区内同时灭菌"
        },
        "answer": "D",
        "answer_text": "相同品种，不同批号的注射剂可在同一灭菌区内同时灭菌"
    },
    "106": {
        "text": "关于注射剂的质量检查叙述错误的是",
        "options": {
            "A": "澄明度检查应在红色背景，20W照明荧光灯光源下用目检视",
            "B": "中国药典规定热原检查采用家兔法",
            "C": "鲎试剂法是利用鲎的变形细胞溶解物与内毒素间的胶凝反应",
            "D": "鲎试剂法检查热原需要做阳性对照和阴性对照",
            "E": "检查降压物质以猫为实验动物"
        },
        "answer": "A",
        "answer_text": "澄明度检查应在红色背景，20W照明荧光灯光源下用目检视"
    },
    "107": {
        "text": "关于盐酸普鲁卡因注射液叙述错误的有",
        "options": {
            "A": "氯化钠用于调节等渗",
            "B": "氯化钠可以提高盐酸普鲁卡因的稳定性",
            "C": "盐酸控制pH在3．5-5．0，提高盐酸普鲁卡因的稳定性",
            "D": "采用热压灭菌",
            "E": "采用流通蒸气100℃， 30min灭菌"
        },
        "answer": "D",
        "answer_text": "采用热压灭菌"
    },
    "108": {
        "text": "维生素C注射液的表述错误的是",
        "options": {
            "A": "可采用亚硫酸氢钠作抗氧剂",
            "B": "处方中加入氢氧化钠调节pH值使成偏碱性",
            "C": "采用依地酸二钠络合金属离子，增加维生素C的稳定性",
            "D": "配制时使用的注射用水需用二氧化碳饱和",
            "E": "采用100℃流通蒸气15min灭菌"
        },
        "answer": "B",
        "answer_text": "处方中加入氢氧化钠调节pH值使成偏碱性"
    },
    "109": {
        "text": "处方：右旋糖酐    60g\n氯化钠      9g\n注射用水加至    1000ml\n关于右旋糖酐注射液(6％)错误的叙述是",
        "options": {
            "A": "用于治疗低血容量性休克",
            "B": "制备过程中要加入活性炭吸附热原",
            "C": "对热不稳定，应在较低温度下过滤",
            "D": "112℃ ，30min灭菌",
            "E": "贮存温度较低或相对分子质量偏高可能析出结晶"
        },
        "answer": "C",
        "answer_text": "对热不稳定，应在较低温度下过滤"
    },
    "110": {
        "text": "头孢噻吩钠的氯化钠等渗当量为0．24，配制2％滴眼剂100ml需加多少克氯化钠",
        "options": {
            "A": "0．42g",
            "B": "0．61g",
            "C": "0．36g",
            "D": "1．42g",
            "E": "1．36g"
        },
        "answer": "A",
        "answer_text": "0．42g"
    },
    "111": {
        "text": "配制100m1，0．5％盐酸普鲁卡因溶液，需加入多少克氯化钠使其成等渗(1％盐酸普鲁卡因水溶液的冰点下降度数为0．12℃，1％的氯化钠水溶液的冰点下降度数为0．58℃)",
        "options": {
            "A": "0．45g",
            "B": "0．90g",
            "C": "0．48g",
            "D": "0．79g",
            "E": "0．05g"
        },
        "answer": "A",
        "answer_text": "0．45g"
    },
    "112": {
        "text": "已知盐酸普鲁卡因的氯化钠等渗当量为0．18，若配制0．5％盐酸普鲁卡因等渗溶液200ml需加入NaCl",
        "options": {
            "A": "0．72g",
            "B": "0．18g",
            "C": "0．81g",
            "D": "1．62g",
            "E": "2．33g"
        },
        "answer": "D",
        "answer_text": "1．62g"
    },
    "113": {
        "text": "氯化钠是常用的等渗调节剂，其1％溶液的冰点下降度数为",
        "options": {
            "A": "0．52℃",
            "B": "0．56℃",
            "C": "0．50℃",
            "D": "0．58℃",
            "E": "0．85℃"
        },
        "answer": "A",
        "answer_text": "0．52℃"
    },
    "114": {
        "text": "注射用青霉素粉针，临用前应加入",
        "options": {
            "A": "注射用水",
            "B": "蒸馏水",
            "C": "去离子水",
            "D": "灭菌注射用水",
            "E": "酒精"
        },
        "answer": "D",
        "answer_text": "灭菌注射用水"
    },
    "115": {
        "text": "关于冷冻干燥的叙述错误的是",
        "options": {
            "A": "预冻温度应在低共熔点以下10～20℃",
            "B": "速冻法制得结晶细微，产品疏松易溶",
            "C": "速冻引起蛋白质变性的几率小，对于酶类和活菌保存有利",
            "D": "慢冻法制得结晶粗，但有利于提高冻干效率",
            "E": "粘稠、熔点低的药物宜采用一次升华法"
        },
        "answer": "E",
        "answer_text": "粘稠、熔点低的药物宜采用一次升华法"
    },
    "116": {
        "text": "注射剂的等渗调节剂应选用",
        "options": {
            "A": "硼酸",
            "B": "HCL",
            "C": "苯甲酸",
            "D": "Na2C03",
            "E": "NaCl"
        },
        "answer": "E",
        "answer_text": "NaCl"
    },
    "117": {
        "text": "氯化钠等渗当量是指",
        "options": {
            "A": "与100g药物成等渗的氯化钠重量",
            "B": "与10g药物成等渗的氯化钠重量",
            "C": "与1g药物成等渗的氯化钠重量",
            "D": "与1g氯化钠成等渗的药物重量",
            "E": "氯化钠与药物的重量各占50％"
        },
        "answer": "C",
        "answer_text": "与1g药物成等渗的氯化钠重量"
    },
    "118": {
        "text": "关于输液瓶的洗涤正确的说法是",
        "options": {
            "A": "碱洗法可用2％氢氧化钠冲洗，多用于旧瓶的洗涤",
            "B": "碱洗法可用1％—3％碳酸氢钠冲洗，多用于旧瓶的洗涤",
            "C": "酸洗法用重铬酸钾清洁液洗涤，多用于新瓶的洗涤",
            "D": "碱洗法的洗涤作用比酸洗法弱，故应与玻璃容器有较长的接触时间",
            "E": "酸洗法有强力的消灭微生物和热原的作用，同时能对瓶壁游离碱起中和作用"
        },
        "answer": "E",
        "answer_text": "酸洗法有强力的消灭微生物和热原的作用，同时能对瓶壁游离碱起中和作用"
    },
    "119": {
        "text": "关于输液的灭菌叙述错误的是",
        "options": {
            "A": "从配制到灭菌以不超过4h为宜",
            "B": "为缩短灭菌时间，输液灭菌开始应速升温",
            "C": "灭菌锅压力下降到零后才能缓慢打开灭菌锅门",
            "D": "塑料输液袋可以采用109℃ 45min灭菌",
            "E": "对于大容器要求F0值大于8min，常用12min"
        },
        "answer": "B",
        "answer_text": "为缩短灭菌时间，输液灭菌开始应速升温"
    },
    "120": {
        "text": "某试制的注射液(输液)使用后造成溶血，应该如何进行改进",
        "options": {
            "A": "酌情加入抑菌剂",
            "B": "适当增大一些酸性",
            "C": "适当增加NaCl用量",
            "D": "适当增大一些碱性",
            "E": "适当增加水的用量"
        },
        "answer": "C",
        "answer_text": "适当增加NaCl用量"
    },
    "121": {
        "text": "注射用油的灭菌方法是",
        "options": {
            "A": "干热250℃",
            "B": "干热150℃",
            "C": "湿热121℃",
            "D": "湿热115℃",
            "E": "流通蒸气"
        },
        "answer": "B",
        "answer_text": "干热150℃"
    },
    "122": {
        "text": "下列哪个可作滴眼剂的抑菌剂",
        "options": {
            "A": "吐温80",
            "B": "三氯叔丁醇",
            "C": "环氧乙烷",
            "D": "碘仿",
            "E": "煤酚皂"
        },
        "answer": "B",
        "answer_text": "三氯叔丁醇"
    },
    "123": {
        "text": "下列哪个因素不影响溶液的滤过速度",
        "options": {
            "A": "滤器面积",
            "B": "压力差",
            "C": "溶液粘度",
            "D": "颗粒细度",
            "E": "溶液体积"
        },
        "answer": "E",
        "answer_text": "溶液体积"
    },
    "124": {
        "text": "下列哪种物质不能作注射剂的溶媒",
        "options": {
            "A": "注射用水",
            "B": "注射用油",
            "C": "乙醇",
            "D": "甘油",
            "E": "二甲基亚砜"
        },
        "answer": "E",
        "answer_text": "二甲基亚砜"
    },
    "125": {
        "text": "关于等渗溶液与等张溶液的叙述正确的是",
        "options": {
            "A": "0．9％的氯化钠既等渗又等张",
            "B": "等渗是生物学概念",
            "C": "等张是物理化学概念",
            "D": "等渗溶液是指与红细胞张力相等的溶液",
            "E": "等张溶液是指渗透压与血浆相等的溶液"
        },
        "answer": "A",
        "answer_text": "0．9％的氯化钠既等渗又等张"
    },
    "126": {
        "text": "混悬型注射剂的质量要求不包括",
        "options": {
            "A": "颗粒大小适宜",
            "B": "具有良好的通针性",
            "C": "具有良好的再分散性",
            "D": "不得有肉眼可见的浑浊",
            "E": "贮存过程中不结块"
        },
        "answer": "D",
        "answer_text": "不得有肉眼可见的浑浊"
    },
    "127": {
        "text": "制备注射剂的环境区域划分哪一条是正确的",
        "options": {
            "A": "精滤,灌封,灭菌为洁净区",
            "B": "精滤,灌封,安瓿干燥灭菌后冷却为洁净区",
            "C": "配制,灌封,灭菌为洁净区",
            "D": "灌封,灭菌为洁净区",
            "E": "配制,精滤,灌封,灯检为洁净区"
        },
        "answer": "B",
        "answer_text": "精滤,灌封,安瓿干燥灭菌后冷却为洁净区"
    },
    "128": {
        "text": "噻孢霉素钠的氯化钠等渗当量为0．24，配制2％滴眼剂100ml需加多少克氯化钠",
        "options": {
            "A": "0．42g",
            "B": "0．61g",
            "C": "0．36g",
            "D": "1．42g",
            "E": "1．36g"
        },
        "answer": "A",
        "answer_text": "0．42g"
    },
    "129": {
        "text": "对维生素C注射液错误的表述是",
        "options": {
            "A": "可采用亚硫酸氢钠作抗氧剂",
            "B": "处方中加入碳酸氢钠调节pH值使成偏碱性，避免肌注时疼痛",
            "C": "可采用依地酸二钠络合金属离子，增加维生素C稳定性",
            "D": "配制时使用的注射用水需用二氧化碳饱和",
            "E": "采用100℃流通蒸汽15min灭菌"
        },
        "answer": "B",
        "answer_text": "处方中加入碳酸氢钠调节pH值使成偏碱性，避免肌注时疼痛"
    },
    "130": {
        "text": "在注射剂中具有局部止痛和抑菌双重作用的附加剂是",
        "options": {
            "A": "盐酸普鲁卡因",
            "B": "盐酸利多卡因",
            "C": "苯酚",
            "D": "苯甲醇",
            "E": "硫柳汞"
        },
        "answer": "D",
        "answer_text": "苯甲醇"
    },
    "131": {
        "text": "下列关于冷冻干燥的正确表述",
        "options": {
            "A": "冷冻干燥是在升温降压条件下水的气液平衡向生成气的方向移动的结果",
            "B": "冷冻干燥是在升温降压条件下水的固气平衡向生成气的方向移动的结果",
            "C": "冷冻干燥应在水的三相点以上的温度与压力下进行",
            "D": "冷冻干燥过程是水分由固变液而后液变气的过程",
            "E": "粘度大的样品较粘度小的样品容易进行冷冻干燥"
        },
        "answer": "E",
        "answer_text": "粘度大的样品较粘度小的样品容易进行冷冻干燥"
    },
    "132": {
        "text": "下列关于散剂的叙述哪一项是错误的",
        "options": {
            "A": "散剂是指药物或与适宜辅料经粉碎.均匀混合而制成的干燥粉末状制剂",
            "B": "中药制剂在临床广泛应用,《中华人民共和国药典》2015年版一部收载散剂59种",
            "C": "散剂按用途可分为内服散剂和局部用散剂",
            "D": "散剂制作单位剂量易控制,便于小儿服用",
            "E": "散剂比表面积大,易分散奏效快"
        },
        "answer": "B",
        "answer_text": "中药制剂在临床广泛应用,《中华人民共和国药典》2015年版一部收载散剂59种"
    },
    "133": {
        "text": "药物装硬胶囊时,易风化药物易使胶囊",
        "options": {
            "A": "变硬",
            "B": "变色",
            "C": "分解",
            "D": "软化",
            "E": "变脆"
        },
        "answer": "D",
        "answer_text": "软化"
    },
    "134": {
        "text": "下列叙述不符合散剂制备方法一般原则的是",
        "options": {
            "A": "组分数量差异大者,采用等量递加混合法",
            "B": "组分堆密度差异大时,堆密度小者先放入混合容器中,再放入堆密度大者",
            "C": "含低共熔成分时,应避免共熔",
            "D": "剂量小的毒性药品,应制成倍散",
            "E": "含液体组分,可用处方中其他组分或吸收剂吸收"
        },
        "answer": "C",
        "answer_text": "含低共熔成分时,应避免共熔"
    },
    "135": {
        "text": "下面的叙述哪一个是错的",
        "options": {
            "A": "粉碎度(n)等于物料粉碎前的粒径(D)与粉碎后的粒径(D1.)的比值",
            "B": "散剂的粉碎并不是愈细愈好,而应适度,以达有效.安全.省时.节能的目的",
            "C": "一般散剂应为中粉,能全部通过四号筛,但混有能通过五号筛不超过60%的粉末",
            "D": "儿科或外用散剂应为最细粉末,其中能通过七号筛的细粉含量不少于95%",
            "E": "散剂所含水分,除药典另有规定外,不得超过9.0%"
        },
        "answer": "C",
        "answer_text": "一般散剂应为中粉,能全部通过四号筛,但混有能通过五号筛不超过60%的粉末"
    },
    "136": {
        "text": "一般制成倍散的是",
        "options": {
            "A": "含毒性药品的散剂",
            "B": "眼用散剂",
            "C": "含液体药物的散剂",
            "D": "含低共熔成分的散剂",
            "E": "含浸膏的散剂"
        },
        "answer": "A",
        "answer_text": "含毒性药品的散剂"
    },
    "137": {
        "text": "适宜制成胶囊剂的药物是",
        "options": {
            "A": "药物的水溶液",
            "B": "易溶性的刺激剂药物",
            "C": "风化性药物",
            "D": "含油量高的药物",
            "E": "药物的稀乙醇溶液"
        },
        "answer": "D",
        "answer_text": "含油量高的药物"
    },
    "138": {
        "text": "下列宜制成软胶囊剂的是",
        "options": {
            "A": "O/W乳剂",
            "B": "硫酸辛",
            "C": "维生素E",
            "D": "药物的稀乙醇溶液",
            "E": "药物的水溶液"
        },
        "answer": "C",
        "answer_text": "维生素E"
    },
    "139": {
        "text": "下列何种药物可以制成胶囊剂",
        "options": {
            "A": "硫酸镁",
            "B": "复方樟脑酊",
            "C": "亚油酸",
            "D": "水合氯醛",
            "E": "以上都是"
        },
        "answer": "C",
        "answer_text": "亚油酸"
    },
    "140": {
        "text": "滴制法制备软胶囊的丸粒大小取决于",
        "options": {
            "A": "基质吸附率",
            "B": "喷头大小和温度",
            "C": "药液的温度和粘度",
            "D": "滴制速度",
            "E": "以上均是"
        },
        "answer": "E",
        "answer_text": "以上均是"
    },
    "141": {
        "text": "当胶囊剂囊心物的平均装量为0.2g时,其装量差异限度为",
        "options": {
            "A": "土10.0%",
            "B": "±7.5%",
            "C": "±5.0%",
            "D": "±2.0%",
            "E": "±1.0%"
        },
        "answer": "A",
        "answer_text": "土10.0%"
    },
    "142": {
        "text": "硬胶囊剂的崩解时限要求为",
        "options": {
            "A": "15min",
            "B": "30min",
            "C": "45min",
            "D": "60min",
            "E": "120min"
        },
        "answer": "B",
        "answer_text": "30min"
    },
    "143": {
        "text": "以水溶性强的基质制备滴丸时应选用下列哪一种冷凝液",
        "options": {
            "A": "水与乙醇的混合物",
            "B": "乙醇与甘油的混合物",
            "C": "液体石蜡与乙醇的混合物",
            "D": "煤油与乙醇的混合物",
            "E": "液体石蜡"
        },
        "answer": "E",
        "answer_text": "液体石蜡"
    },
    "144": {
        "text": "滴丸与胶丸的共同点是",
        "options": {
            "A": "均为药丸",
            "B": "均为滴制法制备",
            "C": "均采用明胶膜材料",
            "D": "均采用PEC(聚乙二醇)类基质",
            "E": "无相同之处"
        },
        "answer": "B",
        "answer_text": "均为滴制法制备"
    },
    "145": {
        "text": "下列关于滴制法制备丸剂特点的叙述,哪一项是错的",
        "options": {
            "A": "工艺周期短,生产率高 ",
            "B": "受热时间短,易氧化及具挥发性的药物溶于基质后,可增加其稳定性",
            "C": "可使液态药物固态化",
            "D": "用固体分散技术制备的滴丸减低药物的生物利用度",
            "E": "生产条件较易控制,含量较准确"
        },
        "answer": "D",
        "answer_text": "用固体分散技术制备的滴丸减低药物的生物利用度"
    },
    "146": {
        "text": "散剂按医疗用途可分为",
        "options": {
            "A": "单散剂与复散剂",
            "B": "倍散剂与普通散剂",
            "C": "内散剂与局部散剂",
            "D": "分剂量散剂与不分剂量散剂",
            "E": "一般散剂与泡腾散剂"
        },
        "answer": "C",
        "answer_text": "内散剂与局部散剂"
    },
    "147": {
        "text": "软胶囊的胶皮处方,较适宜的重量比是增塑剂:明胶:水为",
        "options": {
            "A": "0.4-0.6:1:1",
            "B": "1:0.4-0.6:1",
            "C": "1:1:1",
            "D": "0.5:1:1",
            "E": "1:0.5:1"
        },
        "answer": "A",
        "answer_text": "0.4-0.6:1:1"
    },
    "148": {
        "text": "空胶囊壳的主要原料为",
        "options": {
            "A": "淀粉",
            "B": "蔗糖",
            "C": "糊精",
            "D": "明胶",
            "E": "阿拉伯胶"
        },
        "answer": "D",
        "answer_text": "明胶"
    },
    "149": {
        "text": "我国药典对片重差异检查有详细规定,下列叙述错误的是",
        "options": {"A":"取20片,精密称定片重并求得平均值", "B":"片重小于0.3g的片剂,重量差异限度为±7.5%","C":"片重大于或等于0.3g的片剂,重量差异限度为±5%","D":"超出差异限度的药片不得多于2片","E":"不得有2片超出限度1倍"},
        "answer": "E",
        "answer_text": "不得有2片超出限度1倍"
    },
    "150": {
        "text": "片剂辅料中的崩解剂是",
        "options": {"A":"乙基纤维素","B":"羟丙基甲基纤维素","C":"滑石粉","D":"羧甲基淀粉钠","E":"糊精"},
        "answer": "D",
        "answer_text": "羧甲基淀粉钠"
    },
    "151": {
        "text": "片剂辅料中既可做填充剂又可做粘合剂与崩解剂的物质是",
        "options": {"A":"糊精","B":"微晶纤维素","C":"羧甲基纤维素钠","D":"微粉硅胶","E":"甘露醇"},
        "answer": "A",
        "answer_text": "糊精"
    },
    "152": {
        "text": "片剂生产中制粒的目的是",
        "options": {"A":"减少微粉的飞扬","B":"避免片剂含量不均匀","C":"改善原辅料的可压性","D":"为了生产出的片剂硬度合格","E":"避免复方制剂中各成分间的配伍变化"},
        "answer": "C",
        "answer_text": "改善原辅料的可压性"
    },
    "153": {
        "text": "关于片剂等制剂成品的质量检查,下列叙述错误的是",
        "options": {"A":"糖衣片应在包衣后检查片剂的重量差异","B":"栓剂应进行融变时限检查","C":"凡检查含量均匀度的制剂,不再检查重量差异","D":"凡检查溶出度的制剂,不再进行崩解时限检查","E":"对一些遇胃液易破坏或需要在肠内释放的药物,制成片剂后应包肠溶衣"},
        "answer": "A",
        "answer_text": "糖衣片应在包衣后检查片剂的重量差异"
    },
    "154": {
        "text": "舌下片应符合以下要求",
        "options": {"A":"按崩解时限检查法检查,应在10分钟内全部溶化","B":"按崩解时限检查法检查,应在5分钟内全部崩解","C":"所含药物应是易溶性的","D":"所含药物与辅料均应是易溶性的","E":"药物在舌下发挥局部作用"},
        "answer": "D",
        "answer_text": "所含药物与辅料均应是易溶性的"
    },
    "155": {
        "text": "关于咀嚼片的叙述,错误的是",
        "options": {"A":"硬度宜小于普通片","B":"不进行崩解时限检查","C":"一般在胃肠道中发挥局部作用","D":"口感良好,较适用于小儿服用","E":"对于崩解困难的药物,做成咀嚼片后可提高药效"},
        "answer": "C",
        "answer_text": "一般在胃肠道中发挥局部作用"
    },
    "156": {
        "text": "按崩解时限检查法检查,普通片剂应在多长时间内崩解",
        "options": {"A":"15分钟","B":"30分钟","C":"60分钟","D":"20分钟","E":"10分钟"},
        "answer": "A",
        "answer_text": "15分钟"
    },
    "157": {
        "text": "淀粉在片剂中的作用不正确的是",
        "options": {"A":"填充剂","B":"淀粉浆为黏合剂 ","C":"崩解剂","D":"润滑剂","E":"稀释剂"},
        "answer": "C",
        "answer_text": "崩解剂"
    },
    "158": {
        "text": "羧甲基淀粉钠一般可作片剂的",
        "options": {"A":"稀释剂","B":"崩解剂","C":"黏合剂","D":"抗黏着剂","E":"润滑剂"},
        "answer": "B",
        "answer_text": "崩解剂"
    },
    "159": {
        "text": "常作为粉末直接压片中助流剂的是",
        "options": {"A":"淀粉","B":"糊精","C":"糖粉","D":"微粉硅胶","E":"滑石粉"},
        "answer": "D",
        "answer_text": "微粉硅胶"
    },
    "160": {
        "text": "欲治疗咽喉疾病,可将药物制成",
        "options": {"A":"口含片","B":"咀嚼片","C":"多层片","D":"植入片","E":"泡腾片"},
        "answer": "A",
        "answer_text": "口含片"
    },
    "161": {
        "text": "下列哪种片剂可避免肝脏的首过作用",
        "options": {"A":"泡腾片","B":"分散片","C":"舌下片","D":"普通片","E":"溶液片"},
        "answer": "C",
        "answer_text": "舌下片"
    },
    "162": {
        "text": "下列哪种片剂用药后可缓缓释药、维持疗效几周、几月甚至几年",
        "options": {"A":"多层片","B":"植入片","C":"包衣片","D":"肠溶衣片","E":"普通缓释片"},
        "answer": "B",
        "answer_text": "植入片"
    },
    "163": {
        "text": "为增加片剂的体积和重量,应加入",
        "options": {"A":"稀释剂","B":"崩解剂","C":"吸收剂","D":"润滑剂","E":"黏合剂"},
        "answer": "A",
        "answer_text": "稀释剂"
    },
    "164": {
        "text": "片剂辅料中的崩解剂是",
        "options": {"A":"乙基纤维素","B":"羟丙基甲基纤维素","C":"滑石粉","D":"羧甲基淀粉钠","E":"糊精"},
        "answer": "D",
        "answer_text": "羧甲基淀粉钠"
    },
    "165": {
        "text": "哪种片剂是以碳酸氢钠与枸橼酸为崩解剂",
        "options": {"A":"泡腾片","B":"分散片","C":"缓释片","D":"舌下片","E":"植入片"},
        "answer": "A",
        "answer_text": "泡腾片"
    },
    "166": {
        "text": "片剂辅料中既可做填充剂又可做干黏合剂与崩解剂的物质是",
        "options": {"A":"糊精","B":"微晶纤维素","C":"羧甲基纤维素钠","D":"微粉硅胶","E":"甘露醇"},
        "answer": "B",
        "answer_text": "微晶纤维素"
    },
    "167": {
        "text": "主要用于片剂黏合剂的是",
        "options": {"A":"羧甲基淀粉钠","B":"羧甲基纤维素钠","C":"干淀粉","D":"低取代羟丙基纤维素","E":"交联聚维酮"},
        "answer": "B",
        "answer_text": "羧甲基纤维素钠"
    },
    "168": {
        "text": "最适合做片剂崩解剂的是",
        "options": {"A":"羟丙甲基纤维素","B":"硫酸钙","C":"微粉硅胶","D":"低取代羟丙基纤维素","E":"甲基纤维素"},
        "answer": "D",
        "answer_text": "低取代羟丙基纤维素"
    },
    "169": {
        "text": "压片力过大,黏合剂过量,疏水性润滑剂用量过多可能造成下列哪种片剂质量         问题",
        "options": {"A":"裂片","B":"松片","C":"崩解迟缓","D":"黏冲","E":"片重差异大"},
        "answer": "C",
        "answer_text": "崩解迟缓"
    },
    "170": {
        "text": "哪一个不是造成黏冲的原因",
        "options": {"A":"颗粒含水量过多","B":"压力不够","C":"冲模表面粗糙","D":"润滑剂使用不当","E":"环境湿度过大"},
        "answer": "B",
        "answer_text": "压力不够"
    },
    "171": {
        "text": "哪一个不是造成裂片的原因",
        "options": {"A":"压力分布的不均匀","B":"颗粒中细粉太多","C":"颗粒过干","D":"冲模已磨损","E":"压力不够"},
        "answer": "E",
        "answer_text": "压力不够"
    },
    "172": {
        "text": "片重差异超限的原因不包括",
        "options": {"A":"冲模表面粗糙","B":"颗粒流动性不好","C":"颗粒内的细粉太多或颗粒的大小相差悬殊","D":"加料斗内的颗粒时多时少","E":"冲头与模孔吻合性不好"},
        "answer": "A",
        "answer_text": "冲模表面粗糙"
    },
    "173": {
        "text": "普通片剂应在多长时间内崩",
        "options": {"A":"15min","B":"30min","C":"60min","D":"20min","E":"10min"},
        "answer": "C",
        "answer_text": "60min"
    },
    "174": {
        "text": "片剂平均片重为0.5g,其重量差异限度为",
        "options": {"A":"±1%","B":"±2.5%","C":"±5%","D":"±7.5%","E":"±10%"},
        "answer": "C",
        "answer_text": "±5%"
    },
    "175": {
        "text": "小剂量药物必须测定",
        "options": {"A":"含量均匀度","B":"溶出度","C":"崩解度","D":"硬度","E":"脆碎度"},
        "answer": "A",
        "answer_text": "含量均匀度"
    },
    "176": {
        "text": "下列哪条不是片剂包衣的目的?",
        "options": {"A":"增进美观","B":"保护易变质的主药","C":"防止片剂碎裂","D":"掩盖药物的不良嗅味","E":"控制药物的释放速度"},
        "answer": "C",
        "answer_text": "防止片剂碎裂"
    },
    "177": {
        "text": "关于肠溶片的叙述,错误的是",
        "options": {"A":"胃内不稳定的药物可包肠溶衣","B":"强烈刺激胃的药物可包肠溶衣","C":"在胃内不崩解,而在肠中必须崩解","D":"肠溶衣片服用时不宜嚼碎","E":"小儿服用肠溶片应先将其粉碎再服用"},
        "answer": "E",
        "answer_text": "小儿服用肠溶片应先将其粉碎再服用"
    },
    "178": {
        "text": "下列哪项为包糖衣的工序",
        "options": {"A":"粉衣层→隔离层→色糖衣层→糖衣层→打光","B":"隔离层→粉衣层→糖衣层→色糖衣层→打光","C":"粉衣层→隔离层→糖衣层→色糖衣层→打光","D":"隔离层→粉衣层→色糖衣层→糖衣层→打光","E":"粉衣层→色糖衣层→隔离层→糖衣层→打光"},
        "answer": "B",
        "answer_text": "隔离层→粉衣层→糖衣层→色糖衣层→打光"
    },
    "179": {
        "text": "HPMCP可作为片剂的何种材料",
        "options": {"A":"肠溶衣","B":"糖衣","C":"胃溶衣","D":"崩解剂","E":"润滑剂"},
        "answer": "A",
        "answer_text": "肠溶衣"
    },
    "180": {
        "text": "不作为栓剂质量检查的项目是",
        "options": {"A":"溶点范围测定","B":"溶变时限测定","C":"重量差异测定","D":"稠度检查","E":"药物溶出速度"},
        "answer": "D",
        "answer_text": "稠度检查"
    },
    "181": {
        "text": "下属哪一种基质不是水溶性软膏基质",
        "options": {"A":"聚乙二醇","B":"甘油明胶","C":"羊毛脂","D":"纤维素衍生物","E":"卡波普"},
        "answer": "C",
        "answer_text": "羊毛脂"
    },
    "182": {
        "text": "指出哪项不是一般眼膏剂的质量检查项目",
        "options": {"A":"装量","B":"无菌","C":"粒度","D":"金属性异物","E":"微生物限度"},
        "answer": "B",
        "answer_text": "无菌"
    },
    "183": {
        "text": "哪种物质不宜作为眼膏基质成分",
        "options": {"A":"液体石蜡","B":"羊毛脂","C":"白凡士林","D":"甘油","E":"卡波普"},
        "answer": "C",
        "answer_text": "白凡士林"
    },
    "184": {
        "text": "以下哪项检查最能反映栓剂的生物利用度",
        "options": {"A":"体外溶出实验","B":"融变时限","C":"重量差异","D":"体内吸收实验","E":"硬度测定"},
        "answer": "D",
        "answer_text": "体内吸收实验"
    },
    "185": {
        "text": "下面是关于软膏制备的叙述错误的是",
        "options": {"A":"软膏中的药物若不能溶解时,则应先研成极细粉末过筛,再加入基质研匀","B":"应用熔融法时,可将粉末研细后,加到熔融的基质中,搅拌至冷凝","C":"固体浸膏可加入少量液体糊化后与基质混合","D":"半固体黏稠性药物要溶于少量水中以增加流动性,再与油性基质混合","E":"含挥发性或易升华药物,一般应使基质温度降至40°C以下,再与药物混合"},
        "answer": "D",
        "answer_text": "半固体黏稠性药物要溶于少量水中以增加流动性,再与油性基质混合"
    },
    "186": {
        "text": "下列哪一种不是水溶性软膏基质",
        "options": {"A":"聚乙二醇","B":"甘油明胶","C":"羊毛脂","D":"卡波姆","E":"海藻酸钠"},
        "answer": "C",
        "answer_text": "羊毛脂"
    },
    "187": {
        "text": "关于下列处方的叙述中,错误的是",
        "options": {"A":"硬脂醇可起辅助乳化及稳定作用","B":"十二烷基硫酸钠为W/O型乳化剂","C":"丙二醇为保湿剂","D":"白凡士林可以防止基质水分蒸发,并有利于角质层水合作用","E":"硬脂醇为油相"},
        "answer": "B",
        "answer_text": "十二烷基硫酸钠为W/O型乳化剂"
    },
    "188": {
        "text": "下列关于软膏基质的叙述中正确的是",
        "options": {"A":"凡士林中加入羊毛脂可增加吸油性","B":"液体石蜡主要用于调节软膏稠度","C":"乳剂型基质中因含有表面活性剂,对药物的释放和穿透均较油质性基质差","D":"基质主要作为药物载体,对药物释放影响不大","E":"水溶性基质无需再加入润湿剂"},
        "answer": "B",
        "answer_text": "液体石蜡主要用于调节软膏稠度"
    },
    "189": {
        "text": "有关气雾剂叙述中错误的是",
        "options": {"A":"可避免药物在胃肠道中降解,无首过效应","B":"药物呈微粒状,在肺部吸收完全","C":"使用剂量小,药物的副作用也小","D":"常用的抛射剂氟里昂对环保有害,今后将逐部被取代","E":"气雾剂可发挥全身治疗或某些局部治疗作用"},
        "answer": "B",
        "answer_text": "药物呈微粒状,在肺部吸收完全"
    },
    "190": {
        "text": "吸入粉雾剂中的药物微粒,大多数应在多少μm以下",
        "options": {"A":"10μm","B":"15μm","C":"5μm","D":"2μm","E":"3μm"},
        "answer": "A",
        "answer_text": "10μm"
    },
    "191": {
        "text": "鼻用粉雾剂中的药物微粒,大多数应控制在什么范围",
        "options": {"A":"30-150μm","B":"50-150μm","C":"30-100μm","D":"50-100μm","E":"30-50μm"},
        "answer": "A",
        "answer_text": "30-150μm"
    },
    "192": {
        "text": "关于吸入的三相气雾剂叙述,哪条是错误的",
        "options": {"A":"为防止药物微粒的凝聚,制剂过程中应严格控制水分的含量","B":"药物微粒的粒径大多数应在5μm以下","C":"成品需进行泄漏和爆破检查","D":"按有效部位药物沉积量测定法测定,药品沉积量应不少于每揿主药标示含量的2.0%","E":"成品需进行微生物限度检查"},
        "answer": "D",
        "answer_text": "按有效部位药物沉积量测定法测定,药品沉积量应不少于每揿主药标示含量的2.0%"
    },
    "193": {
        "text": "吸入气雾剂每揿主药含量应标示量的",
        "options": {
            "A": "90%-110%",
            "B": "80%-120%",
            "C": "85%-115%",
            "D": "75%-125%",
            "E": "70%-130%"
        },
        "answer": "B",
        "answer_text": "80%-120%"
    },
    "194": {
        "text": "吸入粉雾剂每揿主药含量应为标示量的",
        "options": {
            "A": "70%-130%",
            "B": "75%-125%",
            "C": "65%-135%",
            "D": "80%-120%",
            "E": "85%-115%"
        },
        "answer": "C",
        "answer_text": "65%-135%"
    },
    "195": {
        "text": "有关抛射剂的叙述中，错误的为",
        "options": {
            "A": "抛射剂是喷射药物的动力",
            "B": "抛射剂是气雾剂中药物的溶剂",
            "C": "抛射剂是气雾剂中药物的稀释剂",
            "D": "抛射剂是一类高沸点的物质",
            "E": "抛射剂在常温下蒸气压大于大气压"
        },
        "answer": "D",
        "answer_text": "抛射剂是一类高沸点的物质"
    },
    "196": {
        "text": "泡沫气雾剂是",
        "options": {
            "A": "溶液型气雾剂",
            "B": "混悬型气雾剂",
            "C": "二项气雾剂",
            "D": "乳剂型气雾剂",
            "E": "以上均不是"
        },
        "answer": "B",
        "answer_text": "混悬型气雾剂"
    },
    "197": {
        "text": "吸入型气雾剂药物的主要吸收部位是",
        "options": {
            "A": "肺泡管",
            "B": "肺泡",
            "C": "气管",
            "D": "支气管",
            "E": "细支气管"
        },
        "answer": "D",
        "answer_text": "支气管"
    },
    "198": {
        "text": "气雾剂雾滴的大小，影响其在呼吸道不同部位的沉积，一般起局部作用的粒子",
        "options": {
            "A": "以0.5－1μm大小为宜",
            "B": "以1－2μm大小为宜",
            "C": "以2－3μm大小为宜",
            "D": "以3－10μm大小为宜",
            "E": "以5－12μm大小为宜"
        },
        "answer": "A",
        "answer_text": "以0.5－1μm大小为宜"
    },
    "199": {
        "text": "气雾剂雾滴的大小，影响其在呼吸道不同部位的沉积，一般发挥全身作用的粒子",
        "options": {
            "A": "0.5－1μm大小为宜",
            "B": "以1－2μm大小为宜",
            "C": "以2－3μm大小为宜",
            "D": "以3－10μm大小为宜",
            "E": "以5－12μm大小为宜"
        },
        "answer": "B",
        "answer_text": "以1－2μm大小为宜"
    },
    "200": {
        "text": "气雾剂质量要求中，吸入气雾剂的药粉粒径应控制在",
        "options": {
            "A": "5μm以下",
            "B": "10μm以下",
            "C": "6μm以下",
            "D": "8μm以下",
            "E": "9μm以下"
        },
        "answer": "C",
        "answer_text": "6μm以下"
    },
    "201": {
        "text": "决定了每次用药剂量的因素",
        "options": {
            "A": "药物的量",
            "B": "附加剂的量",
            "C": "抛射剂的量",
            "D": "耐压容器的容积",
            "E": "定量阀门的容积"
        },
        "answer": "D",
        "answer_text": "耐压容器的容积"
    },
    "202": {
        "text": "采用冷灌法充填抛射剂的特点不包括",
        "options": {
            "A": "生产速度快",
            "B": "对阀门无影响",
            "C": "容器中空气易排出",
            "D": "在低温条件下操作，抛射剂消耗小",
            "E": "含水产品不宜采用本法"
        },
        "answer": "D",
        "answer_text": "在低温条件下操作，抛射剂消耗小"
    },
    "203": {
        "text": "关于气雾剂的叙述中，正确的是",
        "options": {
            "A": "抛射剂用量少，蒸气压高",
            "B": "加入丙酮，会升高抛射剂的蒸气压",
            "C": "给药剂量难以控制",
            "D": "抛射剂可以作为药物的溶剂",
            "E": "抛射剂的存在，降低了药物的稳定性"
        },
        "answer": "D",
        "answer_text": "抛射剂可以作为药物的溶剂"
    },
    "204": {
        "text": "以下对眼膏剂叙述错误的是",
        "options": {
            "A": "对眼部无刺激，无微生物污染",
            "B": "眼用的软膏剂的配制需在清洁．灭菌环境下进行",
            "C": "不溶性药物应先研成极细粉末，并通过九号筛",
            "D": "眼膏剂的基质主要是白凡士林8份．液体石蜡1．份和羊毛脂1．份",
            "E": "要均匀．细腻，易于涂布"
        },
        "answer": "D",
        "answer_text": "眼膏剂的基质主要是白凡士林8份．液体石蜡1．份和羊毛脂1．份"
    },
    "205": {
        "text": "滴眼剂常用的缓冲溶液是",
        "options": {
            "A": "磷酸盐缓冲液",
            "B": "碳酸盐缓冲液",
            "C": "枸橼酸盐缓冲液",
            "D": "醋酸盐缓冲液",
            "E": "要均"
        },
        "answer": "A",
        "answer_text": "磷酸盐缓冲液"
    },
    "206": {
        "text": "滴眼液的渗透压，除可用氯化钠调节外，还可用          调节。",
        "options": {
            "A": "硼酸和硼砂",
            "B": "氯化钾",
            "C": "葡萄糖",
            "D": "磷酸盐缓冲液",
            "E": "有机酸"
        },
        "answer": "C",
        "answer_text": "葡萄糖"
    },
    "207": {
        "text": "滴眼剂的抑菌剂不宜选用下列哪个品种",
        "options": {
            "A": "尼泊金类",
            "B": "三氯叔丁醇",
            "C": "硝酸苯汞",
            "D": "乙醇",
            "E": "山梨酸"
        },
        "answer": "D",
        "answer_text": "乙醇"
    },
    "208": {
        "text": "氯霉素眼药水中硼酸的主要作用是",
        "options": {
            "A": "增溶",
            "B": "调节pH值",
            "C": "防腐",
            "D": "增加疗效",
            "E": "以上都不是"
        },
        "answer": "B",
        "answer_text": "调节pH值"
    },
    "209": {
        "text": "以下关于眼膏剂叙述正确的是",
        "options": {
            "A": "眼膏剂中的药物必须极细",
            "B": "一般用黄凡士林8份、液体石蜡、羊毛脂各一份混合作眼膏基质",
            "C": "眼膏基质加热熔合后保温过滤，并用流通蒸汽灭菌",
            "D": "眼膏剂的制备必须在净化条件下进行",
            "E": "手术用眼膏剂不应添加抑菌剂"
        },
        "answer": "C",
        "answer_text": "眼膏基质加热熔合后保温过滤，并用流通蒸汽灭菌"
    },
    "210": {
        "text": "处方：\n白蜂蜡120．5g，\n石蜡120g，\n液体石蜡560g，\n硼砂5g，\n蒸馏水加至1000g。\n依上述处方配制的软膏基质属于何种性质",
        "options": {
            "A": "油脂性基质",
            "B": "水溶性基质",
            "C": "O／W型乳剂基质",
            "D": "W／0型乳剂基质",
            "E": "凝胶型基质"
        },
        "answer": "E",
        "answer_text": "凝胶型基质"
    },
    "211": {
        "text": "下列关于眼膏剂的叙述正确的是",
        "options": {
            "A": "眼膏剂是供眼用的限菌的半固体制剂",
            "B": "眼膏剂加入抑菌剂后无需再灭菌",
            "C": "眼膏剂生产设备和环境没有特殊要求",
            "D": "眼膏剂的基质应用白凡士林",
            "E": "眼膏使用的基质和药物必须过200目筛"
        },
        "answer": "E",
        "answer_text": "眼膏使用的基质和药物必须过200目筛"
    },
    "212": {
        "text": "渗透泵型片剂控释的基本原理是",
        "options": {
            "A": "减少溶出",
            "B": "减慢扩散",
            "C": "片外渗透压大于片内，将片内药物压出",
            "D": "片剂膜渗透压大于片剂膜外，将药物从细孔压出",
            "E": "片剂外面包控释膜，使药物均速释出"
        },
        "answer": "D",
        "answer_text": "片剂膜渗透压大于片剂膜外，将药物从细孔压出"
    },
    "213": {
        "text": "药物透皮吸收是指",
        "options": {
            "A": "药物通过表皮到达深组织",
            "B": "药物主要通过毛囊和皮脂腺到达体内",
            "C": "药物通过表皮在用药部位发挥作用",
            "D": "药物通过表皮，被毛细血管和淋巴吸收进入体循环的过程",
            "E": "药物通过破损的皮肤，进入体内的过程"
        },
        "answer": "A",
        "answer_text": "药物通过表皮到达深组织"
    },
    "214": {
        "text": "现已制成缓释钾制剂市售品（如slow-K®），这是通过以下哪种方法实现的",
        "options": {
            "A": "利用一种缓慢溶解的碳酸钾盐",
            "B": "用肠溶衣包多层氯化钾",
            "C": "用蜡纸骨架做片芯，使钾缓慢溶解",
            "D": "外层是快速溶解的氯化钾而片芯是缓慢溶解的葡萄糖酸钾",
            "E": "把一系列包有肠溶衣的氯化钾颗粒压制成片剂"
        },
        "answer": "D",
        "answer_text": "外层是快速溶解的氯化钾而片芯是缓慢溶解的葡萄糖酸钾"
    },
    "215": {
        "text": "下列关于固体分散体的叙述哪一项是错误的",
        "options": {
            "A": "药物在固态溶液中是以分子状态分散的",
            "B": "共沉淀物中的药物是以稳定晶型存在的",
            "C": "药物在简单低共溶混合物中仅以较细微的晶体形式分散于载体中",
            "D": "固体分散体也存在某些缺点，例如储存过程中老化、溶出速度变慢等",
            "E": "固体分散体可以促进药物溶出"
        },
        "answer": "D",
        "answer_text": "固体分散体也存在某些缺点，例如储存过程中老化、溶出速度变慢等"
    },
    "216": {
        "text": "亲水性凝胶骨架片的材料为",
        "options": {
            "A": "硅橡胶",
            "B": "蜡类",
            "C": "海藻酸钠",
            "D": "聚氯乙烯",
            "E": "脂肪"
        },
        "answer": "C",
        "answer_text": "海藻酸钠"
    },
    "217": {
        "text": "以下不是以减少扩散速度为主要原理制备缓控释制剂的工艺为",
        "options": {
            "A": "胃内滞留型",
            "B": "包衣",
            "C": "制成微囊",
            "D": "制成植入剂",
            "E": "制成药树脂"
        },
        "answer": "A",
        "answer_text": "胃内滞留型"
    },
    "218": {
        "text": "常用做控释给药系统中控释膜材料的物质是",
        "options": {
            "A": "聚丙烯",
            "B": "聚乳酸",
            "C": "氢化蓖麻油",
            "D": "乙烯-醋酸乙烯共聚物",
            "E": "聚硅氧烷"
        },
        "answer": "B",
        "answer_text": "聚乳酸"
    },
    "219": {
        "text": "下列关于骨架片的叙述中，哪一条是错误的",
        "options": {
            "A": "是以一种含无毒的惰性物质作为释放组滞剂的片剂",
            "B": "药品自骨架中释放的速度低于普通片",
            "C": "本品要通过溶出度检查，不需要通过崩解度检查",
            "D": "药物自剂型中按零级速率方式释药",
            "E": "骨架片一般有三种类型"
        },
        "answer": "B",
        "answer_text": "药品自骨架中释放的速度低于普通片"
    },
    "220": {
        "text": "下列有关渗透泵的叙述哪一条是错误的",
        "options": {
            "A": "渗透泵是一种由半透膜性质的包衣和易溶于水的药物为片芯所组成的片剂",
            "B": "为了药物的释放，片衣上用激光打出若干个微孔",
            "C": "服药后，水分子通过半透膜进入片芯，溶解药物后由微孔流出而为机体所吸收",
            "D": "本剂型具有控释性质，释药均匀，缓慢，药物溶液态释放可减轻局部刺激性",
            "E": "释药不受pH值影响"
        },
        "answer": "C",
        "answer_text": "服药后，水分子通过半透膜进入片芯，溶解药物后由微孔流出而为机体所吸收"
    },
    "221": {
        "text": "以下不属于毫微粒制备方法的是",
        "options": {
            "A": "胶囊聚合法",
            "B": "加热固化法",
            "C": "盐析固化法",
            "D": "乳化聚合法",
            "E": "界面聚合法"
        },
        "answer": "B",
        "answer_text": "加热固化法"
    },
    "222": {
        "text": "属于被动靶向给药系统的是",
        "options": {
            "A": "DNA-柔红霉素结合物",
            "B": "药物-抗体结合物",
            "C": "氨苄青霉素毫微粒",
            "D": "抗体-药物载体复合物",
            "E": "磁性微球"
        },
        "answer": "A",
        "answer_text": "DNA-柔红霉素结合物"
    },
    "223": {
        "text": "有关环糊精的叙述哪一条是错误的",
        "options": {
            "A": "环糊精是环糊精葡萄糖聚糖转位酶作用于淀粉后形成的产物",
            "B": "是水溶性、还原性的白色结晶性粉末",
            "C": "是由6-10个葡萄糖分子结合而成的环状低聚糖化合物",
            "D": "其中结构是中空圆筒型",
            "E": "其中以β-环糊精的溶解度最小"
        },
        "answer": "A",
        "answer_text": "环糊精是环糊精葡萄糖聚糖转位酶作用于淀粉后形成的产物"
    },
    "224": {
        "text": "不属于透皮给药系统的是",
        "options": {
            "A": "宫内给药装置",
            "B": "微孔膜控释系统",
            "C": "粘胶剂层扩散系统",
            "D": "三醋酸纤维素超微孔膜系统",
            "E": "多储库型透皮给药系统"
        },
        "answer": "E",
        "answer_text": "多储库型透皮给药系统"
    },
    "225": {
        "text": "可用于制备透皮给药系统的药物熔点范围为",
        "options": {
            "A": "40℃以下",
            "B": "100℃以上",
            "C": "121℃以上",
            "D": "40℃-60℃",
            "E": "85℃以下"
        },
        "answer": "E",
        "answer_text": "85℃以下"
    },
    "226": {
        "text": "TDS代表",
        "options": {
            "A": "药物释放系统",
            "B": "透皮给药系统",
            "C": "多剂量给药系统",
            "D": "靶向制剂",
            "E": "控释制剂"
        },
        "answer": "B",
        "answer_text": "透皮给药系统"
    },
    "227": {
        "text": "关于缓释制剂特点，错误的是",
        "options": {
            "A": "可减少用药次数",
            "B": "处方组成中一般只有缓释药物",
            "C": "血药浓度平稳",
            "D": "不适宜于半衰期很短的药物",
            "E": "不适宜于作用剧烈的药物"
        },
        "answer": "A",
        "answer_text": "可减少用药次数"
    },
    "228": {
        "text": "渗透泵片控释的原理是",
        "options": {
            "A": "减少溶出",
            "B": "减慢扩散",
            "C": "片外渗透压大于片内，将片内药物压出",
            "D": "片内渗透压大于片外将药物从细孔子压出",
            "E": "片外有控释膜，使药物恒速释出"
        },
        "answer": "E",
        "answer_text": "片外有控释膜，使药物恒速释出"
    },
    "229": {
        "text": "以下对渗透泵片的叙述，错误的是：",
        "options": {
            "A": "释药不受胃肠道pH的影响",
            "B": "当片芯中药物浓度低于饱和溶液浓度时，药物以非零级速率释放",
            "C": "当片芯中的药物未被全部溶解时，药物以一级速率释放",
            "D": "药物在胃与肠中的释药速率相等",
            "E": "药物的释放与半渗透性衣膜的厚度有关"
        },
        "answer": "B",
        "answer_text": "当片芯中药物浓度低于饱和溶液浓度时，药物以非零级速率释放"
    },
    "230": {
        "text": "缓释制剂中延缓释药主要应用于",
        "options": {
            "A": "口服制剂",
            "B": "注射制剂",
            "C": "粘膜制剂",
            "D": "皮肤制剂",
            "E": "直肠制剂"
        },
        "answer": "E",
        "answer_text": "直肠制剂"
    },
    "231": {
        "text": "下列关于骨架型缓释片的叙述，错误的是",
        "options": {
            "A": "亲水凝胶骨架片中药物的释放比较完全",
            "B": "不溶性骨架片中要求药物的溶解度较小",
            "C": "药物从骨架片中的释放速度比普通片剂慢",
            "D": "骨架型缓释片一般有三种类型",
            "E": "骨架型缓释片应进行释放度检查，不进行崩解时限检查"
        },
        "answer": "B",
        "answer_text": "不溶性骨架片中要求药物的溶解度较小"
    },
    "232": {
        "text": "微囊剂与胶囊剂比较，特殊之处在于",
        "options": {
            "A": "可使液体药物粉末化",
            "B": "增加药物稳定性",
            "C": "提高生物利用度",
            "D": "药物释放延缓",
            "E": "掩盖药物不良嗅味"
        },
        "answer": "A",
        "answer_text": "可使液体药物粉末化"
    },
    "233": {
        "text": "利用亲水胶体的盐析作用而析出微囊的是",
        "options": {
            "A": "单凝聚法",
            "B": "复凝聚法",
            "C": "溶剂-非溶剂法",
            "D": "界面缩聚法",
            "E": "喷雾干燥法"
        },
        "answer": "B",
        "answer_text": "复凝聚法"
    },
    "234": {
        "text": "可作为渗透泵制剂中渗透促进剂的是",
        "options": {
            "A": "氢化植物油",
            "B": "脂肪",
            "C": "淀粉浆",
            "D": "蔗糖",
            "E": "邻苯二甲酸醋酸纤维素"
        },
        "answer": "C",
        "answer_text": "淀粉浆"
    },
    "235": {
        "text": "可作为溶蚀性骨架片骨架材料的是",
        "options": {
            "A": "硬脂酸",
            "B": "聚丙烯",
            "C": "聚硅氧烷",
            "D": "聚乙烯",
            "E": "乙基纤维素"
        },
        "answer": "E",
        "answer_text": "乙基纤维素"
    },
    "236": {
        "text": "以下可用于制备亲水凝胶骨架片的材料是",
        "options": {
            "A": "海藻酸钠",
            "B": "聚氯乙烯",
            "C": "脂肪酸",
            "D": "硅橡胶",
            "E": "蜂蜡"
        },
        "answer": "B",
        "answer_text": "聚氯乙烯"
    },
    "237": {
        "text": "以下不属于靶向制剂的是",
        "options": {
            "A": "药物-抗体结合物",
            "B": "纳米囊",
            "C": "微球",
            "D": "环糊精包合物",
            "E": "脂质体"
        },
        "answer": "D",
        "answer_text": "环糊精包合物"
    },
    "238": {
        "text": "以下属于主动靶向给药系统的是",
        "options": {
            "A": "磁性微球",
            "B": "乳剂",
            "C": "药物-单克隆抗体结合物",
            "D": "药物微粒",
            "E": "pH敏感脂质体"
        },
        "answer": "C",
        "answer_text": "药物-单克隆抗体结合物"
    },
    "239": {
        "text": "以下不能用于制备脂质体的方法是",
        "options": {
            "A": "复凝聚法",
            "B": "逆相蒸发法",
            "C": "冷冻干燥法",
            "D": "注入法",
            "E": "薄膜分散法"
        },
        "answer": "A",
        "answer_text": "复凝聚法"
    },
    "240": {
        "text": "以下关于判断微粒是否为脂质体的说法正确的是",
        "options": {
            "A": "具有微型囊泡",
            "B": "球状小体",
            "C": "具有类脂质双分子层的结构的微型囊泡",
            "D": "具有磷脂双分子结构的微型囊泡",
            "E": "由表面活性剂构成的胶团"
        },
        "answer": "C",
        "answer_text": "具有类脂质双分子层的结构的微型囊泡"
    },
    "241": {
        "text": "以下不是脂质体与细胞作用机制的是",
        "options": {
            "A": "融合",
            "B": "降解",
            "C": "内吞",
            "D": "吸附",
            "E": "脂交换"
        },
        "answer": "B",
        "answer_text": "降解"
    },
    "242": {
        "text": "以下关于脂质体相变温度的叙述错误的为",
        "options": {
            "A": "在相变温度以上，升高温度脂质体膜的流动性减小",
            "B": "在一定条件下，由不同磷脂组成的脂质体有可能存在不同的相",
            "C": "与磷脂的种类有关",
            "D": "在相变温度以上，升高温度脂质体双分子层中疏水链可从有序排列变为无序排列",
            "E": "在相变温度以上，升高温度脂质体膜的厚度减小"
        },
        "answer": "A",
        "answer_text": "在相变温度以上，升高温度脂质体膜的流动性减小"
    },
    "243": {
        "text": "以下不用于制备纳米粒的有",
        "options": {
            "A": "乳化聚合法",
            "B": "天然高分子凝聚法",
            "C": "液中干燥法",
            "D": "自动乳化法",
            "E": "干膜超声法"
        },
        "answer": "B",
        "answer_text": "天然高分子凝聚法"
    },
    "244": {
        "text": "以下关于脂质体的说法不正确的是",
        "options": {
            "A": "脂质体在体内与细胞的作用包括吸附．脂交换．内吞．融合",
            "B": "吸附是脂质体在体内与细胞作用的开始，受粒子大小．表面电荷的影响",
            "C": "膜的组成．制备方法，特别是温度和超声波处理，对脂质体的形态有很大影响",
            "D": "设计脂质体作为药物载体最主要的目的是实现药物的缓释性",
            "E": "磷脂是构成细胞膜和脂质体的基础物质"
        },
        "answer": "D",
        "answer_text": "设计脂质体作为药物载体最主要的目的是实现药物的缓释性"
    },
    "245": {
        "text": "下列因素中，不影响药物经皮吸收的是",
        "options": {
            "A": "皮肤因素",
            "B": "经皮吸收促进剂的浓度",
            "C": "背衬层的厚度",
            "D": "基质的pH",
            "E": "药物相对分子质量"
        },
        "answer": "C",
        "answer_text": "背衬层的厚度"
    },
    "246": {
        "text": "下列有关药物经皮吸收的叙述，错误的为",
        "options": {
            "A": "皮肤破损时，药物的吸收增加",
            "B": "当药物与组织的结合力强时，可能在皮肤内形成药物的储库",
            "C": "水溶性药物的穿透能力大于脂溶性药物",
            "D": "非解离型药物的穿透能力大于离子型药物",
            "E": "同系药物中相对分子质量小的药物的穿透能力大于相对分子质量大的"
        },
        "answer": "C",
        "answer_text": "水溶性药物的穿透能力大于脂溶性药物"
    },
    "247": {
        "text": "下列关于透皮给药系统的叙述，正确的是",
        "options": {
            "A": "药物分子量大，有利于透皮吸收",
            "B": "药物熔点高，有利于透皮吸收",
            "C": "透皮给药能使药物直接进入血流，避免了首过效应",
            "D": "剂量大的药物适合透皮给药",
            "E": "透皮吸收制剂需要频繁给药"
        },
        "answer": "C",
        "answer_text": "透皮给药能使药物直接进入血流，避免了首过效应"
    },
    "248": {
        "text": "以下各项中，不是透皮给药系统组成的是",
        "options": {
            "A": "崩解剂",
            "B": "背衬层",
            "C": "粘胶剂层（压敏胶）",
            "D": "防粘层",
            "E": "渗透促进剂"
        },
        "answer": "A",
        "answer_text": "崩解剂"
    },
    "249": {
        "text": "药剂中TDS或TDDS的含义为",
        "options": {
            "A": "药物靶向系统",
            "B": "透皮给药系统",
            "C": "主动靶向给药系统",
            "D": "智能给药系统"
        },
        "answer": "B",
        "answer_text": "透皮给药系统"
    },
    "250": {
        "text": "适于制备成经皮吸收制剂的药物是",
        "options": {
            "A": "在水中及油中的溶解度接近的药物",
            "B": "离子型药物",
            "C": "熔点高的药物",
            "D": "每日剂量大于10mg的药物",
            "E": "相对分子质量大于600的药物"
        },
        "answer": "A",
        "answer_text": "在水中及油中的溶解度接近的药物"
    },
    "251": {
        "text": "下列物质中，不能作为经皮吸收促进剂的是",
        "options": {
            "A": "乙醇",
            "B": "山梨酸",
            "C": "表面活性剂",
            "D": "二甲基亚砜",
            "E": "月桂氮酮"
        },
        "answer": "B",
        "answer_text": "山梨酸"
    },
    "252": {
        "text": "药物透皮吸收是指",
        "options": {
            "A": "药物通过表皮到达深层组织",
            "B": "药物主要通过毛囊和皮脂腺到达体内",
            "C": "药物通过表皮在用药部位发挥作用",
            "D": "药物通过表皮，被毛细血管和淋巴吸收进入体循环",
            "E": "药物通过破损的皮肤，进入体内的过程"
        },
        "answer": "D",
        "answer_text": "药物通过表皮，被毛细血管和淋巴吸收进入体循环"
    },
    "1-1": {
        "text": "剂型",
        "options": {},
        "answer": "",
        "answer_text": "把药品以不同给药方式和不同给药部位等为目的制成的不同形态。"
    },
    "1-2": {
        "text": "药典",
        "options": {},
        "answer": "",
        "answer_text": "是一个国家记载药品标准，规格的法典，一般由国家药典委员会组织编撰，并由政府颁布，执行，具有法律约束力。"
    },
    "1-3": {
        "text": "药物制剂稳定性",
        "options": {},
        "answer": "",
        "answer_text": "是指药物制剂在生产，贮藏，使用的过程中，保持其物理，化学，生物学稳定性，从而保证疗效及用药安全。"
    },
    "1-4": {
        "text": "稳定性加速试验",
        "options": {},
        "answer": "",
        "answer_text": "是通过加速药物的物理，化学变化，预测药物在自然条件下的稳定性。"
    },
    "1-5": {
        "text": "表面活性剂",
        "options": {},
        "answer": "",
        "answer_text": "能显著降低溶液表面张力的物质，又称为表面活性物质，一端是亲水的极性基团，一端是亲油的非极性基团。为两亲分子。"
    },
    "1-6": {
        "text": "昙点",
        "options": {},
        "answer": "",
        "answer_text": "因温度升高而使含表面活性剂的溶液由澄明变为混浊的现象，此时的温度称为昙点。"
    },
    "1-7": {
        "text": "无菌",
        "options": {},
        "answer": "",
        "answer_text": "指在任一指定的物体，介质或环境中，不得存在任何活的微生物。"
    },
    "1-8": {
        "text": "消毒",
        "options": {},
        "answer": "",
        "answer_text": "指用物理或化学方法杀灭或除去病原微生物的手段。对病原微生物具有杀灭或除去作用的物质。"
    },
    "1-9": {
        "text": "空气净化技术",
        "options": {},
        "answer": "",
        "answer_text": "为达到某种净化要求所采用的净化方法，是一项综合性措施。"
    },
    "1-10": {
        "text": "助溶剂",
        "options": {},
        "answer": "",
        "answer_text": "指难溶怀药物与加入的第三种物南在溶剂中形成可溶性的络合物、复盐或缔合物等，以增加药物在溶剂中的溶解度，这第三种物质称为助溶剂。"
    },
    "1-11": {
        "text": "增溶剂",
        "options": {},
        "answer": "",
        "answer_text": "指具有增溶能力的表面活性剂，许多难溶性药物可通过加入增溶剂增加其溶解度，常用的增溶剂为山梨酯类和聚氧乙烯脂肪酸酯类。"
    },
    "1-12": {
        "text": "沉降体积比",
        "options": {},
        "answer": "",
        "answer_text": "系指沉降物的体积与沉降前混悬剂的体积之比。"
    },
    "1-13": {
        "text": "混悬剂",
        "options": {},
        "answer": "",
        "answer_text": "难溶剂固体药物以微粒状态分散于分散介质中形成的非均相液体制剂。"
    },
    "1-14": {
        "text": "乳剂",
        "options": {},
        "answer": "",
        "answer_text": "互不相溶的两种液体混合，其中一相液体以液滴状态分散于另一相液体中形成的非均相液体制剂。"
    },
    "1-15": {
        "text": "潜溶剂",
        "options": {},
        "answer": "",
        "answer_text": "指能提高难溶性药物的溶解度的混合溶剂。"
    },
    "1-16": {
        "text": "注射用无菌粉末",
        "options": {},
        "answer": "",
        "answer_text": "系供临用前用灭菌注射用水溶解后注射，是一种较常用的注射剂型。"
    },
    "1-17": {
        "text": "注射剂（injection）",
        "options": {},
        "answer": "",
        "answer_text": "系指药物制成的供注入体内的无菌溶液（包括乳浊液和混悬液）以及供临用前配成溶液或混悬液的无菌粉末或浓溶液。"
    },
    "1-18": {
        "text": "等渗与等张（溶液）",
        "options": {},
        "answer": "",
        "answer_text": "等渗：与血浆渗透压相等的溶液，属于物理化学概念。\n等张：渗透压与红细胞膜张力相等的溶液，属生物学概念。"
    },
    "1-19": {
        "text": "共熔现象",
        "options": {},
        "answer": "",
        "answer_text": "是指当两种或两种以上药物在一起研磨混合后，产生熔点降低而出现润湿或液化的现象。"
    },
    "1-20": {
        "text": "倍散",
        "options": {},
        "answer": "",
        "answer_text": "指在毒、麻、精神药品中添加一定比例量的赋形剂制成的稀释散。"
    },
    "1-21": {
        "text": "填充剂",
        "options": {},
        "answer": "",
        "answer_text": "又称为稀释剂，是指用以增加片剂的重量和体积，以利于片剂成型和分剂量的辅料。"
    },
    "1-22": {
        "text": "润湿剂",
        "options": {},
        "answer": "",
        "answer_text": "是指可使物料润湿以产生足够强度的粘性以利于制成颗粒的液体。"
    },
    "1-23": {
        "text": "崩解剂",
        "options": {},
        "answer": "",
        "answer_text": "是指能促使片剂在胃肠道内迅速崩解成小粒子的辅料。"
    },
    "1-24": {
        "text": "溶出度",
        "options": {},
        "answer": "",
        "answer_text": "是指片剂或胶囊剂等固体制剂的药物在规定溶剂中溶出的速率和程度。"
    },
    "1-25": {
        "text": "软膏剂",
        "options": {},
        "answer": "",
        "answer_text": "指药物与适宜基质均匀混合制成的具有一定稠度的半固体外用制剂。"
    },
    "1-26": {
        "text": "凝胶剂",
        "options": {},
        "answer": "",
        "answer_text": "凝胶剂指药物与适宜的辅料制成的均一、混悬或乳剂型的乳胶稠厚液体或半固体制剂。凝胶剂有单相分散系统和双相分散系统之分。"
    },
    "1-27": {
        "text": "栓剂",
        "options": {},
        "answer": "",
        "answer_text": "将药材提取物或药粉与适宜基质制成供腔道给药的固体剂型。"
    },
    "1-28": {
        "text": "置换价",
        "options": {},
        "answer": "",
        "answer_text": "置换价是用以计算栓剂基质用量的参数，一定体积：药物的重量与同体积基质重量之比值称为该药物对某基质的置换价。"
    },
    "1-29": {
        "text": "气雾剂",
        "options": {},
        "answer": "",
        "answer_text": "将药材提取物或药物细粉与适宜的抛射剂装在具有特制阀门系统的耐压严封容器中，使用时借助抛射剂的压力使内容物以细雾状或其他形态喷出的制剂。"
    },
    "1-30": {
        "text": "粉雾剂",
        "options": {},
        "answer": "",
        "answer_text": "一种以上的药物，经特殊的给药装置给药后以干粉形式进入呼吸道，发挥全身或局部作用的一种给药系统，具有靶向、高效、速效、毒副作用小等特点。"
    },
    "1-31": {
        "text": "喷雾剂",
        "options": {},
        "answer": "",
        "answer_text": "不含抛射剂，将内容物借助手动泵的压力以雾状等形态喷出的气雾制剂。"
    },
    "1-32": {
        "text": "滴眼剂",
        "options": {},
        "answer": "",
        "answer_text": "滴眼剂指药物制成供滴眼用的澄明溶液或混悬液，用以防治或诊断眼部疾病。以水溶液为主，有少量水性混悬液或油溶液。"
    },
    "1-33": {
        "text": "眼用冻干载体系统",
        "options": {},
        "answer": "",
        "answer_text": "是将单剂量的药物溶于或分散于亲水性聚合物的水溶液中，然后在带手柄的柔性疏水载体膜上冻干，给药时经下眼睑擦拭，冻干物从载体上剥落，粘附于结膜并溶于泪液。"
    },
    "1-34": {
        "text": "固体分散体技术",
        "options": {},
        "answer": "",
        "answer_text": "固体分散体技术是一种将固体药物以微粒形式分散于液体介质中的技术，通过适当的分散剂和搅拌等工艺，将固体药物细分成微小的颗粒，使其在溶液中均匀分散，从而改善药物的可溶性和生物利用度。"
    },
    "1-35": {
        "text": "包合技术",
        "options": {},
        "answer": "",
        "answer_text": "包合技术是一种利用化学或物理的方法，将药物分子包裹在适当的载体中形成包合物的技术。通过包合技术，药物的溶解度、稳定性、生物利用度等性质可以得到改善，还可以用于调控药物的释放速率和提高药物的靶向性。"
    },
    "1-36": {
        "text": "缓释制剂",
        "options": {},
        "answer": "",
        "answer_text": "在规定介质中，按要求缓慢地非恒速释放药物，其与相应的普通制剂比较，给药频率比普通制剂少一半或给药频率比普通制剂有所减少，且能显著增加患者顺应性的制剂。"
    },
    "1-37": {
        "text": "控释制剂",
        "options": {},
        "answer": "",
        "answer_text": "在规定介质中，按要求缓慢地恒速或接近恒速释放药物，其与相应的普通制剂比较，给药频率比普通制剂有所减少，血药浓度比缓释制剂更加平稳，且能显著增加患者顺应性的制剂。"
    },

    "2-1": {
        "text": "由医院药剂科与医师协商制定的适于本单位的处方",
        "options": {
            "A": "处方",
            "B": "医师处方",
            "C": "验方",
            "D": "法定处方",
            "E": "协定处方"
        },
        "answer": "E",
        "answer_text": "协定处方"
    },
    "2-2": {
        "text": "主要指药典．部颁标准收载的处方",
        "options": {
            "A": "处方",
            "B": "医师处方",
            "C": "验方",
            "D": "法定处方",
            "E": "协定处方"
        },
        "answer": "D",
        "answer_text": "法定处方"
    },
    "2-3": {
        "text": "民间积累的经验处方",
        "options": {
            "A": "处方",
            "B": "医师处方",
            "C": "验方",
            "D": "法定处方",
            "E": "协定处方"
        },
        "answer": "C",
        "answer_text": "验方"
    },
    "2-4": {
        "text": "医师对患者治病用药的书面文件",
        "options": {
            "A": "处方",
            "B": "医师处方",
            "C": "验方",
            "D": "法定处方",
            "E": "协定处方"
        },
        "answer": "B",
        "answer_text": "医师处方"
    },
    "2-5": {
        "text": "医疗实践中药剂配方和制剂生产的重要书面文件",
        "options": {
            "A": "处方",
            "B": "医师处方",
            "C": "验方",
            "D": "法定处方",
            "E": "协定处方"
        },
        "answer": "A",
        "answer_text": "处方"
    },
    "2-6": {
        "text": "冷库温度要求",
        "options": {
            "A": "60%-75%",
            "B": "60%-80%",
            "C": "2%-10%",
            "D": "0-300C",
            "E": "200C以下"
        },
        "answer": "C",
        "answer_text": "2%-10%"
    },
    "2-7": {
        "text": "阴凉库温度要求",
        "options": {
            "A": "60%-75%",
            "B": "60%-80%",
            "C": "2%-10%",
            "D": "0-300C",
            "E": "200C以下"
        },
        "answer": "E",
        "answer_text": "200C以下"
    },
    "2-8": {
        "text": "常温库温度要求",
        "options": {
            "A": "60%-75%",
            "B": "60%-80%",
            "C": "2%-10%",
            "D": "0-300C",
            "E": "200C以下"
        },
        "answer": "D",
        "answer_text": "0-300C"
    },
    "2-9": {
        "text": "冷库相对温度",
        "options": {
            "A": "60%-75%",
            "B": "60%-80%",
            "C": "2%-10%",
            "D": "0-300C",
            "E": "200C以下"
        },
        "answer": "A",
        "answer_text": "60%-75%"
    },
    "2-10": {
        "text": "常温库相对温度",
        "options": {
            "A": "60%-75%",
            "B": "60%-80%",
            "C": "2%-10%",
            "D": "0-300C",
            "E": "200C以下"
        },
        "answer": "B",
        "answer_text": "60%-80%"
    },
    "2-11": {
        "text": "应考察性状、澄明度、相对密度、检查分解产物、卫生学检查、含量",
        "options": {
            "A": "片剂",
            "B": "栓剂",
            "C": "滴眼剂",
            "D": "乳剂",
            "E": "糖浆剂"
        },
        "answer": "E",
        "answer_text": "糖浆剂"
    },
    "2-12": {
        "text": "应考察性状，如为包衣片应同时考察片心、检查分解产物、溶出度．含量",
        "options": {
            "A": "片剂",
            "B": "栓剂",
            "C": "滴眼剂",
            "D": "乳剂",
            "E": "糖浆剂"
        },
        "answer": "A",
        "answer_text": "片剂"
    },
    "2-13": {
        "text": "如为澄清液，应考察性状、澄明度、pH值、检查分解产物，无菌检查．含量；如为混悬液，不检查澄明度，检查再混悬性、颗粒细度",
        "options": {
            "A": "片剂",
            "B": "栓剂",
            "C": "滴眼剂",
            "D": "乳剂",
            "E": "糖浆剂"
        },
        "answer": "C",
        "answer_text": "滴眼剂"
    },
    "2-14": {
        "text": "应考察性状、软化、融变时限、检查分解产物、含量",
        "options": {
            "A": "片剂",
            "B": "栓剂",
            "C": "滴眼剂",
            "D": "乳剂",
            "E": "糖浆剂"
        },
        "answer": "B",
        "answer_text": "栓剂"
    },
    "2-15": {
        "text": "应考察性状、分层速度、检查分解产物、含量",
        "options": {
            "A": "片剂",
            "B": "栓剂",
            "C": "滴眼剂",
            "D": "乳剂",
            "E": "糖浆剂"
        },
        "answer": "D",
        "answer_text": "乳剂"
    },
    "2-16": {
        "text": "pH与H+的关系是",
        "options": {
            "A": "7",
            "B": "〈7",
            "C": ">7",
            "D": "14",
            "E": "pH=-lg[H+]"
        },
        "answer": "E",
        "answer_text": "pH=-lg[H+]"
    },
    "2-17": {
        "text": "在中性溶液中pH的值为",
        "options": {
            "A": "7",
            "B": "〈7",
            "C": ">7",
            "D": "14",
            "E": "pH=-lg[H+]"
        },
        "answer": "A",
        "answer_text": "7"
    },
    "2-18": {
        "text": "在酸性溶液中pH的值为",
        "options": {
            "A": "7",
            "B": "〈7",
            "C": ">7",
            "D": "14",
            "E": "pH=-lg[H+]"
        },
        "answer": "B",
        "answer_text": "〈7"
    },
    "2-19": {
        "text": "在碱性溶液中pH的值为",
        "options": {
            "A": "7",
            "B": "〈7",
            "C": ">7",
            "D": "14",
            "E": "pH=-lg[H+]"
        },
        "answer": "C",
        "answer_text": ">7"
    },
    "2-20": {
        "text": "常数下pH+pOH值为",
        "options": {
            "A": "7",
            "B": "〈7",
            "C": ">7",
            "D": "14",
            "E": "pH=-lg[H+]"
        },
        "answer": "D",
        "answer_text": "14"
    },
    "2-21": {
        "text": "分子中具烯醇基，可发生氧化反应",
        "options": {
            "A": "氯霉素",
            "B": "吗啡",
            "C": "维生素C",
            "D": "肾上腺素",
            "E": "氨苄青霉素"
        },
        "answer": "C",
        "answer_text": "维生素C"
    },
    "2-22": {
        "text": "既易氧化，又易发生异构化",
        "options": {
            "A": "氯霉素",
            "B": "吗啡",
            "C": "维生素C",
            "D": "肾上腺素",
            "E": "氨苄青霉素"
        },
        "answer": "D",
        "answer_text": "肾上腺素"
    },
    "2-23": {
        "text": "分子中具酚羟基，可发生氧化反应",
        "options": {
            "A": "氯霉素",
            "B": "吗啡",
            "C": "维生素C",
            "D": "肾上腺素",
            "E": "氨苄青霉素"
        },
        "answer": "B",
        "answer_text": "吗啡"
    },
    "2-24": {
        "text": "分子中具β—内酰胺环，又可发生聚合反应",
        "options": {
            "A": "氯霉素",
            "B": "吗啡",
            "C": "维生素C",
            "D": "肾上腺素",
            "E": "氨苄青霉素"
        },
        "answer": "E",
        "answer_text": "氨苄青霉素"
    },
    "2-25": {
        "text": "pH2以下或pH8以上时水解加速",
        "options": {
            "A": "氯霉素",
            "B": "吗啡",
            "C": "维生素C",
            "D": "肾上腺素",
            "E": "氨苄青霉素"
        },
        "answer": "A",
        "answer_text": "氯霉素"
    },
    "2-26": {
        "text": "非离子型表面活性剂",
        "options": {
            "A": "普朗尼克",
            "B": "季铵化物",
            "C": "蛋黄中的磷脂酰胆碱（卵磷脂）",
            "D": "肥皂类",
            "E": "乙醇"
        },
        "answer": "A",
        "answer_text": "普朗尼克"
    },
    "2-27": {
        "text": "阴离子型表面活性剂",
        "options": {
            "A": "普朗尼克",
            "B": "季铵化物",
            "C": "蛋黄中的磷脂酰胆碱（卵磷脂）",
            "D": "肥皂类",
            "E": "乙醇"
        },
        "answer": "D",
        "answer_text": "肥皂类"
    },
    "2-28": {
        "text": "阳离子型表面活性剂",
        "options": {
            "A": "普朗尼克",
            "B": "季铵化物",
            "C": "蛋黄中的磷脂酰胆碱（卵磷脂）",
            "D": "肥皂类",
            "E": "乙醇"
        },
        "answer": "B",
        "answer_text": "季铵化物"
    },
    "2-29": {
        "text": "两性离子型表面活性剂",
        "options": {
            "A": "普朗尼克",
            "B": "季铵化物",
            "C": "蛋黄中的磷脂酰胆碱（卵磷脂）",
            "D": "肥皂类",
            "E": "乙醇"
        },
        "answer": "C",
        "answer_text": "蛋黄中的磷脂酰胆碱（卵磷脂）"
    },
    "2-30": {
        "text": "极性溶剂",
        "options": {
            "A": "普朗尼克",
            "B": "季铵化物",
            "C": "蛋黄中的磷脂酰胆碱（卵磷脂）",
            "D": "肥皂类",
            "E": "乙醇"
        },
        "answer": "E",
        "answer_text": "乙醇"
    },
    # "2-31": {
    #     "text": "吐温类",
    #     "options": {
    #         "A": "增溶剂",
    #         "B": "乳化剂",
    #         "C": "两者均是",
    #         "D": "两者均不是"
    #     },
    #     "answer": "C",
    #     "answer_text": "两者均是"
    # },
    # "2-32": {
    #     "text": "司盘类",
    #     "options": {
    #         "A": "增溶剂",
    #         "B": "乳化剂",
    #         "C": "两者均是",
    #         "D": "两者均不是"
    #     },
    #     "answer": "C",
    #     "answer_text": "两者均是"
    # },
    # "2-33": {
    #     "text": "苯甲酸钠",
    #     "options": {
    #         "A": "增溶剂",
    #         "B": "乳化剂",
    #         "C": "两者均是",
    #         "D": "两者均不是"
    #     },
    #     "answer": "D",
    #     "answer_text": "两者均不是"
    # },
    # "2-34": {
    #     "text": "尿素",
    #     "options": {
    #         "A": "增溶剂",
    #         "B": "乳化剂",
    #         "C": "两者均是",
    #         "D": "两者均不是"
    #     },
    #     "answer": "D",
    #     "answer_text": "两者均不是"
    # },
    # "2-35": {
    #     "text": "聚氧乙烯蓖麻油",
    #     "options": {
    #         "A": "增溶剂",
    #         "B": "乳化剂",
    #         "C": "两者均是",
    #         "D": "两者均不是"
    #     },
    #     "answer": "B",
    #     "answer_text": "乳化剂"
    # },
    # "2-36": {
    #     "text": "阿拉伯胶",
    #     "options": {
    #         "A": "乳化剂",
    #         "B": "助悬剂",
    #         "C": "两者均是",
    #         "D": "两者均不是"
    #     },
    #     "answer": "C",
    #     "answer_text": "两者均是"
    # },
    # "2-37": {
    #     "text": "吐温-80",
    #     "options": {
    #         "A": "乳化剂",
    #         "B": "助悬剂",
    #         "C": "两者均是",
    #         "D": "两者均不是"
    #     },
    #     "answer": "A",
    #     "answer_text": "乳化剂"
    # },
    # "2-38": {
    #     "text": "磷脂",
    #     "options": {
    #         "A": "乳化剂",
    #         "B": "助悬剂",
    #         "C": "两者均是",
    #         "D": "两者均不是"
    #     },
    #     "answer": "A",
    #     "answer_text": "乳化剂"
    # },
    # "2-39": {
    #     "text": "单糖浆",
    #     "options": {
    #         "A": "乳化剂",
    #         "B": "助悬剂",
    #         "C": "两者均是",
    #         "D": "两者均不是"
    #     },
    #     "answer": "B",
    #     "answer_text": "助悬剂"
    # },
    # "2-40": {
    #     "text": "亚硫酸氢钠",
    #     "options": {
    #         "A": "乳化剂",
    #         "B": "助悬剂",
    #         "C": "两者均是",
    #         "D": "两者均不是"
    #     },
    #     "answer": "D",
    #     "answer_text": "两者均不是"
    # },
    # "2-41": {
    #     "text": "肥皂",
    #     "options": {
    #         "A": "阴离子",
    #         "B": "阳离子",
    #         "C": "两者均有",
    #         "D": "两者均无"
    #     },
    #     "answer": "C",
    #     "answer_text": "两者均有"
    # },
    # "2-42": {
    #     "text": "二辛基琥珀酸酯碘酸钠",
    #     "options": {
    #         "A": "阴离子",
    #         "B": "阳离子",
    #         "C": "两者均有",
    #         "D": "两者均无"
    #     },
    #     "answer": "C",
    #     "answer_text": "两者均有"
    # },
    # "2-43": {
    #     "text": "溴苄烷铵",
    #     "options": {
    #         "A": "阴离子",
    #         "B": "阳离子",
    #         "C": "两者均有",
    #         "D": "两者均无"
    #     },
    #     "answer": "C",
    #     "answer_text": "两者均有"
    # },
    # "2-44": {
    #     "text": "磷脂酰胆碱(卵磷脂)",
    #     "options": {
    #         "A": "阴离子",
    #         "B": "阳离子",
    #         "C": "两者均有",
    #         "D": "两者均无"
    #     },
    #     "answer": "D",
    #     "answer_text": "两者均无"
    # },
    # "2-45": {
    #     "text": "单硬脂酸甘油酯",
    #     "options": {
    #         "A": "阴离子",
    #         "B": "阳离子",
    #         "C": "两者均有",
    #         "D": "两者均无"
    #     },
    #     "answer": "C",
    #     "answer_text": "两者均有"
    # },
    "2-46": {
        "text": "氯化钠注射液",
        "options": {
            "A": "环氧乙烷灭菌法",
            "B": "药液灭菌法",
            "C": "热压灭菌法",
            "D": "滤过灭菌法",
            "E": "干热灭菌法"
        },
        "answer": "C",
        "answer_text": "热压灭菌法"
    },
    "2-47": {
        "text": "操作台表面",
        "options": {
            "A": "环氧乙烷灭菌法",
            "B": "药液灭菌法",
            "C": "热压灭菌法",
            "D": "滤过灭菌法",
            "E": "干热灭菌法"
        },
        "answer": "A",
        "answer_text": "环氧乙烷灭菌法"
    },
    "2-48": {
        "text": "胰岛素注射液",
        "options": {
            "A": "环氧乙烷灭菌法",
            "B": "药液灭菌法",
            "C": "热压灭菌法",
            "D": "滤过灭菌法",
            "E": "干热灭菌法"
        },
        "answer": "D",
        "answer_text": "滤过灭菌法"
    },
    "2-49": {
        "text": "青霉素粉针",
        "options": {
            "A": "环氧乙烷灭菌法",
            "B": "药液灭菌法",
            "C": "热压灭菌法",
            "D": "滤过灭菌法",
            "E": "干热灭菌法"
        },
        "answer": "D",
        "answer_text": "滤过灭菌法"
    },
    "2-50": {
        "text": "无菌操作室空气",
        "options": {
            "A": "环氧乙烷灭菌法",
            "B": "药液灭菌法",
            "C": "热压灭菌法",
            "D": "滤过灭菌法",
            "E": "干热灭菌法"
        },
        "answer": "A",
        "answer_text": "环氧乙烷灭菌法"
    },
    "2-51": {
        "text": "流能磨粉碎",
        "options": {
            "A": "易挥发、刺激性较强的药物的粉碎",
            "B": "比重较大、难溶于水而又要求特别细的药物的粉碎",
            "C": "对低熔点或热敏感药物的粉碎",
            "D": "混悬剂中药物粒子的粉碎",
            "E": "水分小于5%的一般药物的粉碎"
        },
        "answer": "C",
        "answer_text": "对低熔点或热敏感药物的粉碎"
    },
    "2-52": {
        "text": "水飞法粉碎",
        "options": {
            "A": "易挥发、刺激性较强的药物的粉碎",
            "B": "比重较大、难溶于水而又要求特别细的药物的粉碎",
            "C": "对低熔点或热敏感药物的粉碎",
            "D": "混悬剂中药物粒子的粉碎",
            "E": "水分小于5%的一般药物的粉碎"
        },
        "answer": "B",
        "answer_text": "比重较大、难溶于水而又要求特别细的药物的粉碎"
    },
    "2-53": {
        "text": "胶体磨研磨粉碎",
        "options": {
            "A": "易挥发、刺激性较强的药物的粉碎",
            "B": "比重较大、难溶于水而又要求特别细的药物的粉碎",
            "C": "对低熔点或热敏感药物的粉碎",
            "D": "混悬剂中药物粒子的粉碎",
            "E": "水分小于5%的一般药物的粉碎"
        },
        "answer": "D",
        "answer_text": "混悬剂中药物粒子的粉碎"
    },
    "2-54": {
        "text": "干法粉碎",
        "options": {
            "A": "易挥发、刺激性较强的药物的粉碎",
            "B": "比重较大、难溶于水而又要求特别细的药物的粉碎",
            "C": "对低熔点或热敏感药物的粉碎",
            "D": "混悬剂中药物粒子的粉碎",
            "E": "水分小于5%的一般药物的粉碎"
        },
        "answer": "E",
        "answer_text": "水分小于5%的一般药物的粉碎"
    },
    "2-55": {
        "text": "球磨机粉碎",
        "options": {
            "A": "易挥发、刺激性较强的药物的粉碎",
            "B": "比重较大、难溶于水而又要求特别细的药物的粉碎",
            "C": "对低熔点或热敏感药物的粉碎",
            "D": "混悬剂中药物粒子的粉碎",
            "E": "水分小于5%的一般药物的粉碎"
        },
        "answer": "A",
        "answer_text": "易挥发、刺激性较强的药物的粉碎"
    },
    "2-56": {
        "text": "处方中含有纤维丰富的药物",
        "options": {
            "A": "取煎汁",
            "B": "加水烊化",
            "C": "加水稀释",
            "D": "捣碎压榨取汁",
            "E": "加乙醇溶解"
        },
        "answer": "A",
        "answer_text": "取煎汁"
    },
    "2-57": {
        "text": "处方中含有较多质地坚硬的矿物类药物",
        "options": {
            "A": "取煎汁",
            "B": "加水烊化",
            "C": "加水稀释",
            "D": "捣碎压榨取汁",
            "E": "加乙醇溶解"
        },
        "answer": "A",
        "answer_text": "取煎汁"
    },
    "2-58": {
        "text": "处方中含有胶类药物",
        "options": {
            "A": "取煎汁",
            "B": "加水烊化",
            "C": "加水稀释",
            "D": "捣碎压榨取汁",
            "E": "加乙醇溶解"
        },
        "answer": "B",
        "answer_text": "加水烊化"
    },
    "2-59": {
        "text": "处方中含有乳汁、胆汁药物",
        "options": {
            "A": "取煎汁",
            "B": "加水烊化",
            "C": "加水稀释",
            "D": "捣碎压榨取汁",
            "E": "加乙醇溶解"
        },
        "answer": "C",
        "answer_text": "加水稀释"
    },
    "2-60": {
        "text": "处方中含有鲜品药物",
        "options": {
            "A": "取煎汁",
            "B": "加水烊化",
            "C": "加水稀释",
            "D": "捣碎压榨取汁",
            "E": "加乙醇溶解"
        },
        "answer": "D",
        "answer_text": "捣碎压榨取汁"
    },
    "2-61": {
        "text": "锉削作用",
        "options": {
            "A": "硬而脆",
            "B": "硬而韧",
            "C": "硬而坚",
            "D": "中等硬脆",
            "E": "中等坚韧而粘"
        },
        "answer": "C",
        "answer_text": "硬而坚"
    },
    "2-62": {
        "text": "撞击作用",
        "options": {
            "A": "硬而脆",
            "B": "硬而韧",
            "C": "硬而坚",
            "D": "中等硬脆",
            "E": "中等坚韧而粘"
        },
        "answer": "A",
        "answer_text": "硬而脆"
    },
    "2-63": {
        "text": "劈裂作用",
        "options": {
            "A": "硬而脆",
            "B": "硬而韧",
            "C": "硬而坚",
            "D": "中等硬脆",
            "E": "中等坚韧而粘"
        },
        "answer": "D",
        "answer_text": "中等硬脆"
    },
    "2-64": {
        "text": "研磨作用",
        "options": {
            "A": "硬而脆",
            "B": "硬而韧",
            "C": "硬而坚",
            "D": "中等硬脆",
            "E": "中等坚韧而粘"
        },
        "answer": "E",
        "answer_text": "中等坚韧而粘"
    },
    "2-65": {
        "text": "挤压作用",
        "options": {
            "A": "硬而脆",
            "B": "硬而韧",
            "C": "硬而坚",
            "D": "中等硬脆",
            "E": "中等坚韧而粘"
        },
        "answer": "B",
        "answer_text": "硬而韧"
    },

    "2-66": {
        "text": "乳剂受外界因素作用，使体系中油或乳化剂发生变质现象",
        "options": {
            "A": "分层",
            "B": "絮凝",
            "C": "转相",
            "D": "破裂",
            "E": "酸败"
        },
        "answer": "E",
        "answer_text": "酸败"
    },
    "2-67": {
        "text": "分散相乳滴合并且与连续相分离成不相混容的两层液体",
        "options": {
            "A": "分层",
            "B": "絮凝",
            "C": "转相",
            "D": "破裂",
            "E": "酸败"
        },
        "answer": "A",
        "answer_text": "分层"
    },
    "2-68": {
        "text": "O/W型乳剂转化成W/O型乳剂或者相反的变化",
        "options": {
            "A": "分层",
            "B": "絮凝",
            "C": "转相",
            "D": "破裂",
            "E": "酸败"
        },
        "answer": "C",
        "answer_text": "转相"
    },
    "2-69": {
        "text": "乳滴聚集成团但仍保持个乳滴的完整分散个体而不合并",
        "options": {
            "A": "分层",
            "B": "絮凝",
            "C": "转相",
            "D": "破裂",
            "E": "酸败"
        },
        "answer": "B",
        "answer_text": "絮凝"
    },
    "2-70": {
        "text": "乳剂放置时体系中分散相逐渐集中在顶部和底部",
        "options": {
            "A": "分层",
            "B": "絮凝",
            "C": "转相",
            "D": "破裂",
            "E": "酸败"
        },
        "answer": "D",
        "answer_text": "破裂"
    },
    "2-71": {
        "text": "溶液型药剂",
        "options": {
            "A": "胃蛋白酶合剂",
            "B": "单糖浆",
            "C": "磺酸嘧啶混悬剂",
            "D": "复合型乳剂",
            "E": "煎膏剂"
        },
        "answer": "B",
        "answer_text": "单糖浆"
    },
    "2-72": {
        "text": "胶体溶液型药剂",
        "options": {
            "A": "胃蛋白酶合剂",
            "B": "单糖浆",
            "C": "磺酸嘧啶混悬剂",
            "D": "复合型乳剂",
            "E": "煎膏剂"
        },
        "answer": "A",
        "answer_text": "胃蛋白酶合剂"
    },
    "2-73": {
        "text": "混悬液型药剂",
        "options": {
            "A": "胃蛋白酶合剂",
            "B": "单糖浆",
            "C": "磺酸嘧啶混悬剂",
            "D": "复合型乳剂",
            "E": "煎膏剂"
        },
        "answer": "C",
        "answer_text": "磺酸嘧啶混悬剂"
    },
    "2-74": {
        "text": "乳浊液型药剂",
        "options": {
            "A": "胃蛋白酶合剂",
            "B": "单糖浆",
            "C": "磺酸嘧啶混悬剂",
            "D": "复合型乳剂",
            "E": "煎膏剂"
        },
        "answer": "D",
        "answer_text": "复合型乳剂"
    },
    "2-75": {
        "text": "浸出药剂",
        "options": {
            "A": "胃蛋白酶合剂",
            "B": "单糖浆",
            "C": "磺酸嘧啶混悬剂",
            "D": "复合型乳剂",
            "E": "煎膏剂"
        },
        "answer": "E",
        "answer_text": "煎膏剂"
    },
    "2-76": {
        "text": "药物以分子状态分散于液体分散媒中",
        "options": {
            "A": "溶液型",
            "B": "胶体溶液型",
            "C": "乳浊型",
            "D": "混悬型",
            "E": "其他类型"
        },
        "answer": "A",
        "answer_text": "溶液型"
    },
    "2-77": {
        "text": "油滴分散于液体分散媒中",
        "options": {
            "A": "溶液型",
            "B": "胶体溶液型",
            "C": "乳浊型",
            "D": "混悬型",
            "E": "其他类型"
        },
        "answer": "C",
        "answer_text": "乳浊型"
    },
    "2-78": {
        "text": "难溶性固体药物分散于液体分散媒中",
        "options": {
            "A": "溶液型",
            "B": "胶体溶液型",
            "C": "乳浊型",
            "D": "混悬型",
            "E": "其他类型"
        },
        "answer": "D",
        "answer_text": "混悬型"
    },
    "2-79": {
        "text": "高分子化合物分散于液体分散媒中",
        "options": {
            "A": "溶液型",
            "B": "胶体溶液型",
            "C": "乳浊型",
            "D": "混悬型",
            "E": "其他类型"
        },
        "answer": "B",
        "answer_text": "胶体溶液型"
    },
    "2-80": {
        "text": "薄荷油与吐温-80分散于液体分散媒中",
        "options": {
            "A": "溶液型",
            "B": "胶体溶液型",
            "C": "乳浊型",
            "D": "混悬型",
            "E": "其他类型"
        },
        "answer": "E",
        "answer_text": "其他类型"
    },
    "2-81": {
        "text": "小分子或离子分散，溶液澄明、稳定的是",
        "options": {
            "A": "溶液型液体制剂",
            "B": "高分子溶液剂",
            "C": "溶胶剂",
            "D": "混悬剂",
            "E": "乳剂"
        },
        "answer": "A",
        "answer_text": "溶液型液体制剂"
    },
    "2-82": {
        "text": "高分子化合物以分子分散的是",
        "options": {
            "A": "溶液型液体制剂",
            "B": "高分子溶液剂",
            "C": "溶胶剂",
            "D": "混悬剂",
            "E": "乳剂"
        },
        "answer": "B",
        "answer_text": "高分子溶液剂"
    },
    "2-83": {
        "text": "以多分子聚集体形式分散，具有动力学稳定性的是",
        "options": {
            "A": "溶液型液体制剂",
            "B": "高分子溶液剂",
            "C": "溶胶剂",
            "D": "混悬剂",
            "E": "乳剂"
        },
        "answer": "C",
        "answer_text": "溶胶剂"
    },
    "2-84": {
        "text": "以液滴分散成多相体系的是",
        "options": {
            "A": "溶液型液体制剂",
            "B": "高分子溶液剂",
            "C": "溶胶剂",
            "D": "混悬剂",
            "E": "乳剂"
        },
        "answer": "E",
        "answer_text": "乳剂"
    },
    "2-85": {
        "text": "难溶性固体药物分散于液体分散介质中",
        "options": {
            "A": "溶液型液体制剂",
            "B": "高分子溶液剂",
            "C": "溶胶剂",
            "D": "混悬剂",
            "E": "乳剂"
        },
        "answer": "D",
        "answer_text": "混悬剂"
    },
    "2-86": {
        "text": "吐温类",
        "options": {
            "A": "增溶剂",
            "B": "乳化剂",
            "C": "助溶剂",
            "D": "A+B",
            "E": "防腐剂"
        },
        "answer": "D",
        "answer_text": "A+B"
    },
    "2-87": {
        "text": "胆固醇",
        "options": {
            "A": "增溶剂",
            "B": "乳化剂",
            "C": "助溶剂",
            "D": "A+B",
            "E": "防腐剂"
        },
        "answer": "C",
        "answer_text": "助溶剂"
    },
    "2-88": {
        "text": "山梨酸钾",
        "options": {
            "A": "增溶剂",
            "B": "乳化剂",
            "C": "助溶剂",
            "D": "A+B",
            "E": "防腐剂"
        },
        "answer": "E",
        "answer_text": "防腐剂"
    },
    "2-89": {
        "text": "碘化钾",
        "options": {
            "A": "增溶剂",
            "B": "乳化剂",
            "C": "助溶剂",
            "D": "A+B",
            "E": "防腐剂"
        },
        "answer": "C",
        "answer_text": "助溶剂"
    },
    "2-90": {
        "text": "阿拉伯胶",
        "options": {
            "A": "增溶剂",
            "B": "乳化剂",
            "C": "助溶剂",
            "D": "A+B",
            "E": "防腐剂"
        },
        "answer": "B",
        "answer_text": "乳化剂"
    },
    "2-91": {
        "text": "静脉注射用脂肪乳剂",
        "options": {
            "A": "干热灭菌",
            "B": "热压灭菌",
            "C": "煮沸灭菌",
            "D": "气体灭菌",
            "E": "过滤除菌"
        },
        "answer": "B",
        "answer_text": "热压灭菌"
    },
    "2-92": {
        "text": "空塑料滴眼瓶",
        "options": {
            "A": "干热灭菌",
            "B": "热压灭菌",
            "C": "煮沸灭菌",
            "D": "气体灭菌",
            "E": "过滤除菌"
        },
        "answer": "D",
        "answer_text": "气体灭菌"
    },
    "2-93": {
        "text": "醋酸可的松混悬型注射液",
        "options": {
            "A": "干热灭菌",
            "B": "热压灭菌",
            "C": "煮沸灭菌",
            "D": "气体灭菌",
            "E": "过滤除菌"
        },
        "answer": "E",
        "answer_text": "过滤除菌"
    },
    "2-94": {
        "text": "pH调节剂",
        "options": {
            "A": "维生素C",
            "B": "NaHCO3",
            "C": "NaHSO3",
            "D": "EDTA-2Na",
            "E": "注射用水加至1000ml"
        },
        "answer": "B",
        "answer_text": "NaHCO3"
    },
    "2-95": {
        "text": "抗氧剂",
        "options": {
            "A": "维生素C",
            "B": "NaHCO3",
            "C": "NaHSO3",
            "D": "EDTA-2Na",
            "E": "注射用水加至1000ml"
        },
        "answer": "C",
        "answer_text": "NaHSO3"
    },
    "2-96": {
        "text": "金属螯合剂",
        "options": {
            "A": "维生素C",
            "B": "NaHCO3",
            "C": "NaHSO3",
            "D": "EDTA-2Na",
            "E": "注射用水加至1000ml"
        },
        "answer": "D",
        "answer_text": "EDTA-2Na"
    },
    "2-97": {
        "text": "主用于皮试，剂量在0.2ml以下",
        "options": {
            "A": "静脉注射",
            "B": "脊椎腔注射",
            "C": "肌内注射",
            "D": "皮下注射",
            "E": "皮内注射"
        },
        "answer": "E",
        "answer_text": "皮内注射"
    },
    "2-98": {
        "text": "可为水溶液、油溶液、混悬液及中药注射液，剂量在5ml以下",
        "options": {
            "A": "静脉注射",
            "B": "脊椎腔注射",
            "C": "肌内注射",
            "D": "皮下注射",
            "E": "皮内注射"
        },
        "answer": "C",
        "answer_text": "肌内注射"
    },
    "2-99": {
        "text": "多为水溶液，急救首选，剂量5ml至几千毫升",
        "options": {
            "A": "静脉注射",
            "B": "脊椎腔注射",
            "C": "肌内注射",
            "D": "皮下注射",
            "E": "皮内注射"
        },
        "answer": "A",
        "answer_text": "静脉注射"
    },
    "2-100": {
        "text": "注射于表皮和肌肉之间，剂量一般为1—2ml",
        "options": {
            "A": "静脉注射",
            "B": "脊椎腔注射",
            "C": "肌内注射",
            "D": "皮下注射",
            "E": "皮内注射"
        },
        "answer": "D",
        "answer_text": "皮下注射"
    },
    "2-101": {
        "text": "干热灭菌",
        "options": {
            "A": "安瓿",
            "B": "氯霉素滴眼剂",
            "C": "静脉注射用脂肪乳剂",
            "D": "无菌操作室的地面及墙面",
            "E": "无菌操作室"
        },
        "answer": "A",
        "answer_text": "安瓿"
    },
    "2-102": {
        "text": "甲醛蒸气灭菌",
        "options": {
            "A": "安瓿",
            "B": "氯霉素滴眼剂",
            "C": "静脉注射用脂肪乳剂",
            "D": "无菌操作室的地面及墙面",
            "E": "无菌操作室"
        },
        "answer": "C",
        "answer_text": "静脉注射用脂肪乳剂"
    },
    "2-103": {
        "text": "2%煤酚皂灭菌",
        "options": {
            "A": "安瓿",
            "B": "氯霉素滴眼剂",
            "C": "静脉注射用脂肪乳剂",
            "D": "无菌操作室的地面及墙面",
            "E": "无菌操作室"
        },
        "answer": "D",
        "answer_text": "无菌操作室的地面及墙面"
    },
    "2-104": {
        "text": "热压灭菌",
        "options": {
            "A": "安瓿",
            "B": "氯霉素滴眼剂",
            "C": "静脉注射用脂肪乳剂",
            "D": "无菌操作室的地面及墙面",
            "E": "无菌操作室"
        },
        "answer": "A",
        "answer_text": "安瓿"
    },
    "2-105": {
        "text": "电渗析法",
        "options": {
            "A": "电渗析法",
            "B": "反渗透法",
            "C": "蒸馏法",
            "D": "离子交换法",
            "E": "过滤法"
        },
        "answer": "D",
        "answer_text": "离子交换法"
    },
    "2-106": {
        "text": "反渗透法",
        "options": {
            "A": "电渗析法",
            "B": "反渗透法",
            "C": "蒸馏法",
            "D": "离子交换法",
            "E": "过滤法"
        },
        "answer": "B",
        "answer_text": "反渗透法"
    },
    "2-107": {
        "text": "微孔滤膜",
        "options": {
            "A": "多用于粘度高浓度大的溶液滤过",
            "B": "用于低粘度液体的滤过",
            "C": "多用于常压滤过",
            "D": "可用于减压或加压滤过",
            "E": "高分子材料制成的薄膜滤过介质"
        },
        "answer": "A",
        "answer_text": "多用于粘度高浓度大的溶液滤过"
    },
    "2-108": {
        "text": "G3垂熔玻璃滤器",
        "options": {
            "A": "多用于粘度高浓度大的溶液滤过",
            "B": "用于低粘度液体的滤过",
            "C": "多用于常压滤过",
            "D": "可用于减压或加压滤过",
            "E": "高分子材料制成的薄膜滤过介质"
        },
        "answer": "C",
        "answer_text": "多用于常压滤过"
    },
    "2-109": {
        "text": "硅藻土滤棒",
        "options": {
            "A": "多用于粘度高浓度大的溶液滤过",
            "B": "用于低粘度液体的滤过",
            "C": "多用于常压滤过",
            "D": "可用于减压或加压滤过",
            "E": "高分子材料制成的薄膜滤过介质"
        },
        "answer": "E",
        "answer_text": "高分子材料制成的薄膜滤过介质"
    },
    "2-110": {
        "text": "多孔素瓷棒",
        "options": {
            "A": "多用于粘度高浓度大的溶液滤过",
            "B": "用于低粘度液体的滤过",
            "C": "多用于常压滤过",
            "D": "可用于减压或加压滤过",
            "E": "高分子材料制成的薄膜滤过介质"
        },
        "answer": "B",
        "answer_text": "用于低粘度液体的滤过"
    },
    "2-111": {
        "text": "G4垂熔玻璃滤器",
        "options": {
            "A": "多用于粘度高浓度大的溶液滤过",
            "B": "用于低粘度液体的滤过",
            "C": "多用于常压滤过",
            "D": "可用于减压或加压滤过",
            "E": "高分子材料制成的薄膜滤过介质"
        },
        "answer": "D",
        "answer_text": "可用于减压或加压滤过"
    },
    "2-112": {
        "text": "现有阿司匹林粉欲装胶囊，如何按其装量，恰当选用胶囊号码:0.55g",
        "options": {
            "A": "0号",
            "B": "1号",
            "C": "2号",
            "D": "3号",
            "E": "4号"
        },
        "answer": "A",
        "answer_text": "0号"
    },
    "2-113": {
        "text": "现有阿司匹林粉欲装胶囊，如何按其装量，恰当选用胶囊号码: 0.15g",
        "options": {
            "A": "0号",
            "B": "1号",
            "C": "2号",
            "D": "3号",
            "E": "4号"
        },
        "answer": "E",
        "answer_text": "4号"
    },
    "2-114": {
        "text": "现有阿司匹林粉欲装胶囊，如何按其装量，恰当选用胶囊号码:0.25g",
        "options": {
            "A": "0号",
            "B": "1号",
            "C": "2号",
            "D": "3号",
            "E": "4号"
        },
        "answer": "C",
        "answer_text": "2号"
    },
    "2-115": {
        "text": "现有阿司匹林粉欲装胶囊，如何按其装量，恰当选用胶囊号码:0.33g",
        "options": {
            "A": "0号",
            "B": "1号",
            "C": "2号",
            "D": "3号",
            "E": "4号"
        },
        "answer": "B",
        "answer_text": "1号"
    },
    "2-116": {
        "text": "现有阿司匹林粉欲装胶囊，如何按其装量，恰当选用胶囊号码: 0.2g",
        "options": {
            "A": "0号",
            "B": "1号",
            "C": "2号",
            "D": "3号",
            "E": "4号"
        },
        "answer": "D",
        "answer_text": "3号"
    },
    "2-117": {
        "text": "山梨醇",
        "options": {
            "A": "成型材料",
            "B": "增塑剂",
            "C": "遮光剂",
            "D": "防腐剂",
            "E": "增稠剂"
        },
        "answer": "B",
        "answer_text": "增塑剂"
    },
    "2-118": {
        "text": "二氧化钛",
        "options": {
            "A": "成型材料",
            "B": "增塑剂",
            "C": "遮光剂",
            "D": "防腐剂",
            "E": "增稠剂"
        },
        "answer": "C",
        "answer_text": "遮光剂"
    },
    "2-119": {
        "text": "琼脂",
        "options": {
            "A": "成型材料",
            "B": "增塑剂",
            "C": "遮光剂",
            "D": "防腐剂",
            "E": "增稠剂"
        },
        "answer": "E",
        "answer_text": "增稠剂"
    },
    "2-120": {
        "text": "明胶",
        "options": {
            "A": "成型材料",
            "B": "增塑剂",
            "C": "遮光剂",
            "D": "防腐剂",
            "E": "增稠剂"
        },
        "answer": "A",
        "answer_text": "成型材料"
    },
    "2-121": {
        "text": "羟苯乙酯",
        "options": {
            "A": "增塑剂",
            "B": "成型材料",
            "C": "遮光剂",
            "D": "防腐剂",
            "E": "增稠剂"
        },
        "answer": "D",
        "answer_text": "防腐剂"
    },
    "2-122": {
        "text": "片剂的润滑剂",
        "options": {
            "A": "聚维酮",
            "B": "乳糖",
            "C": "交联聚维酮",
            "D": "水",
            "E": "硬脂酸镁"
        },
        "answer": "E",
        "answer_text": "硬脂酸镁"
    },
    "2-123": {
        "text": "片剂的填充剂",
        "options": {
            "A": "聚维酮",
            "B": "乳糖",
            "C": "交联聚维酮",
            "D": "水",
            "E": "硬脂酸镁"
        },
        "answer": "A",
        "answer_text": "聚维酮"
    },
    "2-124": {
        "text": "片剂的湿润剂",
        "options": {
            "A": "聚维酮",
            "B": "乳糖",
            "C": "交联聚维酮",
            "D": "水",
            "E": "硬脂酸镁"
        },
        "answer": "D",
        "answer_text": "水"
    },
    "2-125": {
        "text": "片剂的崩解剂",
        "options": {
            "A": "聚维酮",
            "B": "乳糖",
            "C": "交联聚维酮",
            "D": "水",
            "E": "硬脂酸镁"
        },
        "answer": "C",
        "answer_text": "交联聚维酮"
    },
    "2-126": {
        "text": "片剂的粘合剂",
        "options": {
            "A": "聚维酮",
            "B": "乳糖",
            "C": "交联聚维酮",
            "D": "水",
            "E": "硬脂酸镁"
        },
        "answer": "B",
        "answer_text": "乳糖"
    },
    "2-127": {
        "text": "片剂的泡腾崩解剂",
        "options": {
            "A": "聚乙二醇",
            "B": "蔗糖",
            "C": "碳酸氢钠",
            "D": "甘露醇",
            "E": "羟丙基甲基纤维素"
        },
        "answer": "C",
        "answer_text": "碳酸氢钠"
    },
    "2-128": {
        "text": "薄膜衣片剂的成膜材料",
        "options": {
            "A": "聚乙二醇",
            "B": "蔗糖",
            "C": "碳酸氢钠",
            "D": "甘露醇",
            "E": "羟丙基甲基纤维素"
        },
        "answer": "E",
        "answer_text": "羟丙基甲基纤维素"
    },
    "2-129": {
        "text": "润滑剂",
        "options": {
            "A": "聚乙二醇",
            "B": "蔗糖",
            "C": "碳酸氢钠",
            "D": "甘露醇",
            "E": "羟丙基甲基纤维素"
        },
        "answer": "A",
        "answer_text": "聚乙二醇"
    },
    "2-130": {
        "text": "可用于制备咀嚼片",
        "options": {
            "A": "聚乙二醇",
            "B": "蔗糖",
            "C": "碳酸氢钠",
            "D": "甘露醇",
            "E": "羟丙基甲基纤维素"
        },
        "answer": "D",
        "answer_text": "甘露醇"
    },
    "2-131": {
        "text": "包糖衣材料",
        "options": {
            "A": "聚乙二醇",
            "B": "蔗糖",
            "C": "碳酸氢钠",
            "D": "甘露醇",
            "E": "羟丙基甲基纤维素"
        },
        "answer": "B",
        "answer_text": "蔗糖"
    },
    "2-132": {
        "text": "可避免药物的首过效应",
        "options": {
            "A": "口含片",
            "B": "舌下片",
            "C": "多层片",
            "D": "肠溶衣片",
            "E": "控释片"
        },
        "answer": "B",
        "answer_text": "舌下片"
    },
    "2-133": {
        "text": "在口腔内缓慢溶解而发挥局部治疗作用",
        "options": {
            "A": "口含片",
            "B": "舌下片",
            "C": "多层片",
            "D": "肠溶衣片",
            "E": "控释片"
        },
        "answer": "A",
        "answer_text": "口含片"
    },
    "2-134": {
        "text": "可避免复方制剂中不同药物之间的配伍变化",
        "options": {
            "A": "口含片",
            "B": "舌下片",
            "C": "多层片",
            "D": "肠溶衣片",
            "E": "控释片"
        },
        "answer": "C",
        "answer_text": "多层片"
    },
    "2-135": {
        "text": "用胃中不溶而在肠中溶解的物质为包衣材料制成的片剂",
        "options": {
            "A": "口含片",
            "B": "舌下片",
            "C": "多层片",
            "D": "肠溶衣片",
            "E": "控释片"
        },
        "answer": "D",
        "answer_text": "肠溶衣片"
    },
    "2-136": {
        "text": "可使药物缓慢释放或近似缓慢释放的片剂",
        "options": {
            "A": "口含片",
            "B": "舌下片",
            "C": "多层片",
            "D": "肠溶衣片",
            "E": "控释片"
        },
        "answer": "E",
        "answer_text": "控释片"
    },
    "2-137": {
        "text": "药物的可压性不好，在湿热条件下不稳定者",
        "options": {
            "A": "结晶压片法",
            "B": "干法制粒压片",
            "C": "粉末直接压片",
            "D": "湿法制粒压片",
            "E": "空白棵粒法"
        },
        "answer": "B",
        "answer_text": "干法制粒压片"
    },
    "2-138": {
        "text": "药物呈结晶型，流动性和可压性均较好",
        "options": {
            "A": "结晶压片法",
            "B": "干法制粒压片",
            "C": "粉末直接压片",
            "D": "湿法制粒压片",
            "E": "空白棵粒法"
        },
        "answer": "A",
        "answer_text": "结晶压片法"
    },
    "2-139": {
        "text": "敷料具有相当好的流动性和可压性，与一定量药物混合后仍能保持上述特性",
        "options": {
            "A": "结晶压片法",
            "B": "干法制粒压片",
            "C": "粉末直接压片",
            "D": "湿法制粒压片",
            "E": "空白棵粒法"
        },
        "answer": "C",
        "answer_text": "粉末直接压片"
    },
    "2-140": {
        "text": "性质稳定，受湿遇热不起变化的药物",
        "options": {
            "A": "结晶压片法",
            "B": "干法制粒压片",
            "C": "粉末直接压片",
            "D": "湿法制粒压片",
            "E": "空白棵粒法"
        },
        "answer": "D",
        "answer_text": "湿法制粒压片"
    },
    "2-141": {
        "text": "处方中主要药物的剂量很小",
        "options": {
            "A": "结晶压片法",
            "B": "干法制粒压片",
            "C": "粉末直接压片",
            "D": "湿法制粒压片",
            "E": "空白棵粒法"
        },
        "answer": "E",
        "answer_text": "空白棵粒法"
    },
    "2-142": {
        "text": "分散片",
        "options": {
            "A": "分散均匀性",
            "B": "崩解时限检查",
            "C": "释放度检查",
            "D": "溶变时限检查",
            "E": "发泡量检查"
        },
        "answer": "A",
        "answer_text": "分散均匀性"
    },
    "2-143": {
        "text": "泡腾片",
        "options": {
            "A": "分散均匀性",
            "B": "崩解时限检查",
            "C": "释放度检查",
            "D": "溶变时限检查",
            "E": "发泡量检查"
        },
        "answer": "E",
        "answer_text": "发泡量检查"
    },
    "2-144": {
        "text": "口腔贴片",
        "options": {
            "A": "分散均匀性",
            "B": "崩解时限检查",
            "C": "释放度检查",
            "D": "溶变时限检查",
            "E": "发泡量检查"
        },
        "answer": "C",
        "answer_text": "释放度检查"
    },
    "2-145": {
        "text": "舌下片",
        "options": {
            "A": "分散均匀性",
            "B": "崩解时限检查",
            "C": "释放度检查",
            "D": "溶变时限检查",
            "E": "发泡量检查"
        },
        "answer": "B",
        "answer_text": "崩解时限检查"
    },
    "2-146": {
        "text": "阴道片",
        "options": {
            "A": "分散均匀性",
            "B": "崩解时限检查",
            "C": "释放度检查",
            "D": "溶变时限检查",
            "E": "发泡量检查"
        },
        "answer": "D",
        "answer_text": "溶变时限检查"
    },
    "2-147": {
        "text": "磺胺甲基异噁唑（SMZ）500g",
        "options": {
            "A": "润滑剂",
            "B": "粘合剂",
            "C": "崩解剂",
            "D": "填充剂",
            "E": "主药"
        },
        "answer": "E",
        "answer_text": "主药"
    },
    "2-148": {
        "text": "乳糖40g",
        "options": {
            "A": "润滑剂",
            "B": "粘合剂",
            "C": "崩解剂",
            "D": "填充剂",
            "E": "主药"
        },
        "answer": "D",
        "answer_text": "填充剂"
    },
    "2-149": {
        "text": "淀粉浆2.4g",
        "options": {
            "A": "润滑剂",
            "B": "粘合剂",
            "C": "崩解剂",
            "D": "填充剂",
            "E": "主药"
        },
        "answer": "B",
        "answer_text": "粘合剂"
    },
    "2-150": {
        "text": "羧甲基淀粉钠30g",
        "options": {
            "A": "润滑剂",
            "B": "粘合剂",
            "C": "崩解剂",
            "D": "填充剂",
            "E": "主药"
        },
        "answer": "C",
        "answer_text": "崩解剂"
    },
    "2-151": {
        "text": "硬脂酸镁3g",
        "options": {
            "A": "润滑剂",
            "B": "粘合剂",
            "C": "崩解剂",
            "D": "填充剂",
            "E": "主药"
        },
        "answer": "A",
        "answer_text": "润滑剂"
    },
    "2-152": {
        "text": "普通片剂",
        "options": {
            "A": "30分钟",
            "B": "15分钟",
            "C": "60分钟",
            "D": "5分钟",
            "E": "20分钟"
        },
        "answer": "B",
        "answer_text": "15分钟"
    },
    "2-153": {
        "text": "泡腾片",
        "options": {
            "A": "30分钟",
            "B": "15分钟",
            "C": "60分钟",
            "D": "5分钟",
            "E": "20分钟"
        },
        "answer": "D",
        "answer_text": "5分钟"
    },
    "2-154": {
        "text": "肠溶衣片",
        "options": {
            "A": "30分钟",
            "B": "15分钟",
            "C": "60分钟",
            "D": "5分钟",
            "E": "20分钟"
        },
        "answer": "C",
        "answer_text": "60分钟"
    },
    "2-155": {
        "text": "糖衣片",
        "options": {
            "A": "30分钟",
            "B": "15分钟",
            "C": "60分钟",
            "D": "5分钟",
            "E": "20分钟"
        },
        "answer": "C",
        "answer_text": "60分钟"
    },
    "2-156": {
        "text": "舌下片",
        "options": {
            "A": "30分钟",
            "B": "15分钟",
            "C": "60分钟",
            "D": "5分钟",
            "E": "20分钟"
        },
        "answer": "A",
        "answer_text": "30分钟"
    },
    "2-157": {
        "text": "可可豆脂",
        "options": {
            "A": "油质性基质",
            "B": "水溶性基质",
            "C": "栓剂基质",
            "D": "乳化剂",
            "E": "气雾剂的抛射剂"
        },
        "answer": "A",
        "answer_text": "油质性基质"
    },
    "2-158": {
        "text": "二甲基硅油",
        "options": {
            "A": "油质性基质",
            "B": "水溶性基质",
            "C": "栓剂基质",
            "D": "乳化剂",
            "E": "气雾剂的抛射剂"
        },
        "answer": "D",
        "answer_text": "乳化剂"
    },
    "2-159": {
        "text": "氟氯烷烃",
        "options": {
            "A": "油质性基质",
            "B": "水溶性基质",
            "C": "栓剂基质",
            "D": "乳化剂",
            "E": "气雾剂的抛射剂"
        },
        "answer": "E",
        "answer_text": "气雾剂的抛射剂"
    },
    "2-160": {
        "text": "蜂蜡",
        "options": {
            "A": "油质性基质",
            "B": "水溶性基质",
            "C": "栓剂基质",
            "D": "乳化剂",
            "E": "气雾剂的抛射剂"
        },
        "answer": "C",
        "answer_text": "栓剂基质"
    },
    "2-161": {
        "text": "凡士林",
        "options": {
            "A": "油质性基质",
            "B": "水溶性基质",
            "C": "栓剂基质",
            "D": "乳化剂",
            "E": "气雾剂的抛射剂"
        },
        "answer": "A",
        "answer_text": "油质性基质"
    },
    "2-162": {
        "text": "氟里昂",
        "options": {
            "A": "潜溶剂",
            "B": "湿润剂",
            "C": "抛射剂",
            "D": "稳定剂",
            "E": "乳化剂"
        },
        "answer": "C",
        "answer_text": "抛射剂"
    },
    "2-163": {
        "text": "丙二醇",
        "options": {
            "A": "潜溶剂",
            "B": "湿润剂",
            "C": "抛射剂",
            "D": "稳定剂",
            "E": "乳化剂"
        },
        "answer": "A",
        "answer_text": "潜溶剂"
    },
    "2-164": {
        "text": "滑石粉",
        "options": {
            "A": "潜溶剂",
            "B": "湿润剂",
            "C": "抛射剂",
            "D": "稳定剂",
            "E": "乳化剂"
        },
        "answer": "B",
        "answer_text": "湿润剂"
    },
    "2-165": {
        "text": "乙醇",
        "options": {
            "A": "潜溶剂",
            "B": "湿润剂",
            "C": "抛射剂",
            "D": "稳定剂",
            "E": "乳化剂"
        },
        "answer": "A",
        "answer_text": "潜溶剂"
    },
    "2-166": {
        "text": "月桂醇",
        "options": {
            "A": "潜溶剂",
            "B": "湿润剂",
            "C": "抛射剂",
            "D": "稳定剂",
            "E": "乳化剂"
        },
        "answer": "E",
        "answer_text": "乳化剂"
    },
    "2-167": {
        "text": "气雾剂中的抛射剂",
        "options": {
            "A": "氟里昂",
            "B": "月桂氮卓酮",
            "C": "可可豆脂",
            "D": "硬脂酸镁",
            "E": "司盘-85"
        },
        "answer": "A",
        "answer_text": "氟里昂"
    },
    "2-168": {
        "text": "气雾剂中的稳定剂",
        "options": {
            "A": "氟里昂",
            "B": "月桂氮卓酮",
            "C": "可可豆脂",
            "D": "硬脂酸镁",
            "E": "司盘-85"
        },
        "answer": "E",
        "answer_text": "司盘-85"
    },
    "2-169": {
        "text": "软膏剂中的透皮吸收剂",
        "options": {
            "A": "氟里昂",
            "B": "月桂氮卓酮",
            "C": "可可豆脂",
            "D": "硬脂酸镁",
            "E": "司盘-85"
        },
        "answer": "B",
        "answer_text": "月桂氮卓酮"
    },
    "2-170": {
        "text": "压片时的润滑剂",
        "options": {
            "A": "氟里昂",
            "B": "月桂氮卓酮",
            "C": "可可豆脂",
            "D": "硬脂酸镁",
            "E": "司盘-85"
        },
        "answer": "D",
        "answer_text": "硬脂酸镁"
    },
    "2-171": {
        "text": "栓剂基质",
        "options": {
            "A": "氟里昂",
            "B": "月桂氮卓酮",
            "C": "可可豆脂",
            "D": "硬脂酸镁",
            "E": "司盘-85"
        },
        "answer": "C",
        "answer_text": "可可豆脂"
    },
    "2-172": {
        "text": "为提高脂质体的靶向性而加以修饰的脂质体",
        "options": {
            "A": "微球",
            "B": "pH敏感脂质体",
            "C": "磷脂和胆固醇",
            "D": "毫微粒",
            "E": "单室脂质体"
        },
        "answer": "B",
        "answer_text": "pH敏感脂质体"
    },
    "2-173": {
        "text": "脂质体的膜材",
        "options": {
            "A": "微球",
            "B": "pH敏感脂质体",
            "C": "磷脂和胆固醇",
            "D": "毫微粒",
            "E": "单室脂质体"
        },
        "answer": "C",
        "answer_text": "磷脂和胆固醇"
    },
    "2-174": {
        "text": "超声波分散法制备的脂质体",
        "options": {
            "A": "微球",
            "B": "pH敏感脂质体",
            "C": "磷脂和胆固醇",
            "D": "毫微粒",
            "E": "单室脂质体"
        },
        "answer": "B",
        "answer_text": "pH敏感脂质体"
    },
    "2-175": {
        "text": "以天然或高分子物质为载体制成的载药微细粒子",
        "options": {
            "A": "微球",
            "B": "pH敏感脂质体",
            "C": "磷脂和胆固醇",
            "D": "毫微粒",
            "E": "单室脂质体"
        },
        "answer": "D",
        "answer_text": "毫微粒"
    },
    "2-176": {
        "text": "用适宜高分子材料制成的含药球状实体",
        "options": {
            "A": "微球",
            "B": "pH敏感脂质体",
            "C": "磷脂和胆固醇",
            "D": "毫微粒",
            "E": "单室脂质体"
        },
        "answer": "A",
        "answer_text": "微球"
    },
    "2-177": {
        "text": "脂质体",
        "options": {
            "A": "共沉淀法",
            "B": "交联剂固化法",
            "C": "胶束聚合法",
            "D": "注入法",
            "E": "重结晶法"
        },
        "answer": "D",
        "answer_text": "注入法"
    },
    "2-178": {
        "text": "毫微粒",
        "options": {
            "A": "共沉淀法",
            "B": "交联剂固化法",
            "C": "胶束聚合法",
            "D": "注入法",
            "E": "重结晶法"
        },
        "answer": "C",
        "answer_text": "胶束聚合法"
    },
    "2-179": {
        "text": "微球",
        "options": {
            "A": "共沉淀法",
            "B": "交联剂固化法",
            "C": "胶束聚合法",
            "D": "注入法",
            "E": "重结晶法"
        },
        "answer": "B",
        "answer_text": "交联剂固化法"
    },
    "2-180": {
        "text": "β-环糊精包合物",
        "options": {
            "A": "共沉淀法",
            "B": "交联剂固化法",
            "C": "胶束聚合法",
            "D": "注入法",
            "E": "重结晶法"
        },
        "answer": "A",
        "answer_text": "共沉淀法"
    },
    "2-181": {
        "text": "固体分散体",
        "options": {
            "A": "共沉淀法",
            "B": "交联剂固化法",
            "C": "胶束聚合法",
            "D": "注入法",
            "E": "重结晶法"
        },
        "answer": "E",
        "answer_text": "重结晶法"
    },
    "2-182": {
        "text": "可用于制备脂质体",
        "options": {
            "A": "羟丙基甲基纤维素",
            "B": "单硬脂酸甘油脂",
            "C": "大豆磷脂",
            "D": "无毒聚氯乙烯",
            "E": "乙基纤维素"
        },
        "answer": "C",
        "answer_text": "大豆磷脂"
    },
    "2-183": {
        "text": "可用于制备溶蚀性骨架片",
        "options": {
            "A": "羟丙基甲基纤维素",
            "B": "单硬脂酸甘油脂",
            "C": "大豆磷脂",
            "D": "无毒聚氯乙烯",
            "E": "乙基纤维素"
        },
        "answer": "B",
        "answer_text": "单硬脂酸甘油脂"
    },
    "2-184": {
        "text": "可用于制备不溶性骨架片",
        "options": {
            "A": "羟丙基甲基纤维素",
            "B": "单硬脂酸甘油脂",
            "C": "大豆磷脂",
            "D": "无毒聚氯乙烯",
            "E": "乙基纤维素"
        },
        "answer": "E",
        "answer_text": "乙基纤维素"
    },
    "2-185": {
        "text": "可用于制备亲水凝胶型骨架片",
        "options": {
            "A": "羟丙基甲基纤维素",
            "B": "单硬脂酸甘油脂",
            "C": "大豆磷脂",
            "D": "无毒聚氯乙烯",
            "E": "乙基纤维素"
        },
        "answer": "A",
        "answer_text": "羟丙基甲基纤维素"
    },
    "2-186": {
        "text": "可用于制备膜控释片",
        "options": {
            "A": "羟丙基甲基纤维素",
            "B": "单硬脂酸甘油脂",
            "C": "大豆磷脂",
            "D": "无毒聚氯乙烯",
            "E": "乙基纤维素"
        },
        "answer": "E",
        "answer_text": "乙基纤维素"
    },
    "2-187": {
        "text": "氯霉素-β环糊精包合物",
        "options": {
            "A": "增加药物的溶解度",
            "B": "提高药物的稳定性",
            "C": "液体药物的粉末化",
            "D": "遮盖药物的不良嗅味",
            "E": "防止挥发性成份的挥发"
        },
        "answer": "B",
        "answer_text": "提高药物的稳定性"
    },
    "2-188": {
        "text": "辅酶Q10-β环糊精包合物",
        "options": {
            "A": "增加药物的溶解度",
            "B": "提高药物的稳定性",
            "C": "液体药物的粉末化",
            "D": "遮盖药物的不良嗅味",
            "E": "防止挥发性成份的挥发"
        },
        "answer": "B",
        "answer_text": "提高药物的稳定性"
    },
    "2-189": {
        "text": "维生素A-β环糊精包合物",
        "options": {
            "A": "增加药物的溶解度",
            "B": "提高药物的稳定性",
            "C": "液体药物的粉末化",
            "D": "遮盖药物的不良嗅味",
            "E": "防止挥发性成份的挥发"
        },
        "answer": "A",
        "answer_text": "增加药物的溶解度"
    },
    "2-190": {
        "text": "维生素E-β环糊精包合物",
        "options": {
            "A": "增加药物的溶解度",
            "B": "提高药物的稳定性",
            "C": "液体药物的粉末化",
            "D": "遮盖药物的不良嗅味",
            "E": "防止挥发性成份的挥发"
        },
        "answer": "C",
        "answer_text": "液体药物的粉末化"
    },
    "2-191": {
        "text": "硝酸甘油-β环糊精包合物",
        "options": {
            "A": "增加药物的溶解度",
            "B": "提高药物的稳定性",
            "C": "液体药物的粉末化",
            "D": "遮盖药物的不良嗅味",
            "E": "防止挥发性成份的挥发"
        },
        "answer": "B",
        "answer_text": "提高药物的稳定性"
    },
    "2-192": {
        "text": "控释膜",
        "options": {
            "A": "乙烯-醋酸乙烯共聚物",
            "B": "药物及透皮吸收促进剂等",
            "C": "复合铝箔膜",
            "D": "压敏胶",
            "E": "塑料薄膜"
        },
        "answer": "A",
        "answer_text": "乙烯-醋酸乙烯共聚物"
    },
    "2-193": {
        "text": "黏胶层",
        "options": {
            "A": "乙烯-醋酸乙烯共聚物",
            "B": "药物及透皮吸收促进剂等",
            "C": "复合铝箔膜",
            "D": "压敏胶",
            "E": "塑料薄膜"
        },
        "answer": "D",
        "answer_text": "压敏胶"
    },
    "2-194": {
        "text": "背衬层",
        "options": {
            "A": "乙烯-醋酸乙烯共聚物",
            "B": "药物及透皮吸收促进剂等",
            "C": "复合铝箔膜",
            "D": "压敏胶",
            "E": "塑料薄膜"
        },
        "answer": "E",
        "answer_text": "塑料薄膜"
    },
    "2-195": {
        "text": "药物库",
        "options": {
            "A": "乙烯-醋酸乙烯共聚物",
            "B": "药物及透皮吸收促进剂等",
            "C": "复合铝箔膜",
            "D": "压敏胶",
            "E": "塑料薄膜"
        },
        "answer": "B",
        "answer_text": "药物及透皮吸收促进剂等"
    },
    "2-196": {
        "text": "防粘层",
        "options": {
            "A": "乙烯-醋酸乙烯共聚物",
            "B": "药物及透皮吸收促进剂等",
            "C": "复合铝箔膜",
            "D": "压敏胶",
            "E": "塑料薄膜"
        },
        "answer": "C",
        "answer_text": "复合铝箔膜"
    },
    "2-197": {
        "text": "可用于制备脂质体的是",
        "options": {
            "A": "羟丙基甲基纤维素",
            "B": "单硬脂酸甘油酯",
            "C": "大豆磷脂",
            "D": "无毒聚氯乙烯",
            "E": "乙基纤维素"
        },
        "answer": "C",
        "answer_text": "大豆磷脂"
    },
    "2-198": {
        "text": "可用于制备溶蚀性骨架片的是",
        "options": {
            "A": "羟丙基甲基纤维素",
            "B": "单硬脂酸甘油酯",
            "C": "大豆磷脂",
            "D": "无毒聚氯乙烯",
            "E": "乙基纤维素"
        },
        "answer": "A",
        "answer_text": "羟丙基甲基纤维素"
    },
    "2-199": {
        "text": "可用于制备不溶性骨架片的是",
        "options": {
            "A": "羟丙基甲基纤维素",
            "B": "单硬脂酸甘油酯",
            "C": "大豆磷脂",
            "D": "无毒聚氯乙烯",
            "E": "乙基纤维素"
        },
        "answer": "B",
        "answer_text": "单硬脂酸甘油酯"
    },
    "2-200": {
        "text": "可用于制备亲水凝胶型骨架片的是",
        "options": {
            "A": "羟丙基甲基纤维素",
            "B": "单硬脂酸甘油酯",
            "C": "大豆磷脂",
            "D": "无毒聚氯乙烯",
            "E": "乙基纤维素"
        },
        "answer": "D",
        "answer_text": "无毒聚氯乙烯"
    },
    "2-201": {
        "text": "可用于制备膜控释片的是",
        "options": {
            "A": "羟丙基甲基纤维素",
            "B": "单硬脂酸甘油酯",
            "C": "大豆磷脂",
            "D": "无毒聚氯乙烯",
            "E": "乙基纤维素"
        },
        "answer": "A",
        "answer_text": "羟丙基甲基纤维素"
    },
    "2-202": {
        "text": "可作为渗透泵片的渗透压促进剂的是",
        "options": {
            "A": "甘露醇",
            "B": "大豆磷脂",
            "C": "羟丙甲基纤维素",
            "D": "离子交换树脂",
            "E": "硅橡胶"
        },
        "answer": "D",
        "answer_text": "离子交换树脂"
    },
    "2-203": {
        "text": "可在缓控释制剂中作为水溶性致孔剂的是",
        "options": {
            "A": "甘露醇",
            "B": "大豆磷脂",
            "C": "羟丙甲基纤维素",
            "D": "离子交换树脂",
            "E": "硅橡胶"
        },
        "answer": "E",
        "answer_text": "硅橡胶"
    },
    "2-204": {
        "text": "可作为片剂薄膜包衣材料的是",
        "options": {
            "A": "甘露醇",
            "B": "大豆磷脂",
            "C": "羟丙甲基纤维素",
            "D": "离子交换树脂",
            "E": "硅橡胶"
        },
        "answer": "B",
        "answer_text": "大豆磷脂"
    },
    "2-205": {
        "text": "可作为制备脂质体的材料的是",
        "options": {
            "A": "甘露醇",
            "B": "大豆磷脂",
            "C": "羟丙甲基纤维素",
            "D": "离子交换树脂",
            "E": "硅橡胶"
        },
        "answer": "C",
        "answer_text": "羟丙甲基纤维素"
    },
    "2-206": {
        "text": "可作为制备药物树脂的材料的是",
        "options": {
            "A": "甘露醇",
            "B": "大豆磷脂",
            "C": "羟丙甲基纤维素",
            "D": "离子交换树脂",
            "E": "硅橡胶"
        },
        "answer": "E",
        "answer_text": "硅橡胶"
    },
    "3-1": {
        "text": "药物剂型的重要性是",
        "options": {
            "A": "可以改变药物的作用性质",
            "B": "可以调节药物的作用速度",
            "C": "可使药物产生靶向作用",
            "D": "可降低药物的毒副作用",
            "E": "方便患者使用"
        },
        "answer": "ABCDE",
        "answer_text": "A: 可以改变药物的作用性质,\nB: 可以调节药物的作用速度,\nC: 可使药物产生靶向作用,\nD: 可降低药物的毒副作用,\nE: 方便患者使用"
    },
    "3-2": {
        "text": "冷冻干燥的特点是",
        "options": {
            "A": "可避免药品因高温而分解变质",
            "B": "可随意选择溶剂以制备某种特殊的晶型",
            "C": "含水低",
            "D": "产品剂量不易准确",
            "E": "所得产品质地疏松"
        },
        "answer": "ACE",
        "answer_text": "A: 可避免药品因高温而分解变质,\nC: 含水低,\nE: 所得产品质地疏松"
    },
    "3-3": {
        "text": "下列哪些药物可发生水解反应",
        "options": {
            "A": "青霉素",
            "B": "氯霉素",
            "C": "核黄素",
            "D": "抗坏血酸",
            "E": "肾上腺素"
        },
        "answer": "ABE",
        "answer_text": "A: 青霉素,\nB: 氯霉素,\nE: 肾上腺素"
    },
    "3-4": {
        "text": "下列哪些药物可发生氧化反应",
        "options": {
            "A": "丁卡因",
            "B": "后马托品",
            "C": "水杨酸钠",
            "D": "溴化钙",
            "E": "肾上腺素"
        },
        "answer": "CE",
        "answer_text": "C: 水杨酸钠,\nE: 肾上腺素"
    },
    "3-5": {
        "text": "药品稳定性加速试验是",
        "options": {
            "A": "温度加速试验法",
            "B": "湿度加速试验法",
            "C": "空气干热试验法",
            "D": "光加速试验法",
            "E": "隔热空气试验法"
        },
        "answer": "ABD",
        "answer_text": "A: 温度加速试验法,\nB: 湿度加速试验法,\nD: 光加速试验法"
    },
    "3-6": {
        "text": "下列制剂加等量蒸馏水稀释，哪些能生成沉淀或混浊？",
        "options": {
            "A": "10%水杨酸酒精",
            "B": "50%苯甲酸钠咖啡因注射液",
            "C": "5%薄荷脑醑",
            "D": "20%磺胺嘧啶钠溶液",
            "E": "10%硼酸甘油"
        },
        "answer": "AC",
        "answer_text": "A: 10%水杨酸酒精\nC: 5%薄荷脑醑"
    },
    "3-7": {
        "text": "下列叙述中，哪些是错误的？",
        "options": {
            "A": "临界相对湿度低的药品容易吸湿",
            "B": "药物在固体状态时，一般比在溶液中为稳定",
            "C": "易变质的固体药物随粒度的减少而趋向于不稳定",
            "D": "固体药物与水溶液不同，不会因温度变化而发生稳定性的变化",
            "E": "制剂的吸湿、液化等均系物理变化，与其化学稳定性无关"
        },
        "answer": "DE",
        "answer_text": "D: 固体药物与水溶液不同，不会因温度变化而发生稳定性的变化\nE: 制剂的吸湿、液化等均系物理变化，与其化学稳定性无关"
    },
    "3-8": {
        "text": "吐温类表面活性剂具有",
        "options": {
            "A": "增溶作用",
            "B": "助溶作用",
            "C": "润湿作用",
            "D": "乳化作用",
            "E": "润滑作用"
        },
        "answer": "ACD",
        "answer_text": "A: 增溶作用\nC: 润湿作用\nD: 乳化作用"
    },
    "3-9": {
        "text": "有关增加药物溶解度方法的叙述中，错误的是",
        "options": {
            "A": "同系物药物分子量越大，增溶量越大",
            "B": "助溶机制包括形成有机分子复合物",
            "C": "同系物增溶剂碳链愈长，增溶量越小",
            "D": "有些增溶剂可防止药物水解",
            "E": "增溶剂加入顺序可影响增溶量"
        },
        "answer": "AD",
        "answer_text": "A: 同系物药物分子量越大，增溶量越大\nD: 有些增溶剂可防止药物水解"
    },
    "3-10": {
        "text": "表面活性剂在药剂方面常用作",
        "options": {
            "A": "增溶",
            "B": "乳化",
            "C": "润湿",
            "D": "润滑",
            "E": "去污"
        },
        "answer": "ABCDE",
        "answer_text": "A: 增溶\nB: 乳化\nC: 润湿\nD: 润滑\nE: 去污"
    },
    "3-11": {
        "text": "有关吐温-80的叙述中，正确的是？",
        "options": {
            "A": "系聚氧乙烯去水山梨醇单油酸酯",
            "B": "系亲水性非离子型表面活性剂",
            "C": "在临界浓度以上，增溶作用变强",
            "D": "本品HLB值在5以下",
            "E": "系聚氧乙烯去水山犁醇单硬脂酸脂"
        },
        "answer": "ABC",
        "answer_text": "A: 系聚氧乙烯去水山梨醇单油酸酯\nB: 系亲水性非离子型表面活性剂\nC: 在临界浓度以上，增溶作用变强"
    },
    "3-12": {
        "text": "有关灭菌法的叙述，正确的是？",
        "options": {
            "A": "辐射灭菌法特别适用于一些不耐热药物的灭菌",
            "B": "滤过灭菌法主要用于含有热稳定性物质的培养基、试液或液体药物的灭菌",
            "C": "流通蒸气灭菌法一般是100℃，30-60min，此法能保证杀死芽孢",
            "D": "热压灭菌121℃，20min，能杀灭所有的细菌繁殖体和芽孢",
            "E": "紫外线灭菌活力最强的波长是254nm"
        },
        "answer": "ADE",
        "answer_text": "A: 辐射灭菌法特别适用于一些不耐热药物的灭菌\nD: 热压灭菌121℃，20min，能杀灭所有的细菌繁殖体和芽孢"
    },
    "3-13": {
        "text": "常用的化学杀菌剂有",
        "options": {
            "A": "苯扎溴铵",
            "B": "乙醇",
            "C": "盐酸",
            "D": "煤酚皂",
            "E": "乙酸乙酯"
        },
        "answer": "ABD",
        "answer_text": "A: 苯扎溴铵\nB: 乙醇\nD: 煤酚皂"
    },
    "3-14": {
        "text": "洁净区由哪几部分组成？",
        "options": {
            "A": "洁净室",
            "B": "风淋",
            "C": "缓冲室",
            "D": "更衣室",
            "E": "浴室"
        },
        "answer": "ABCD",
        "answer_text": "A: 洁净室\nB: 风淋\nC: 缓冲室\nD: 更衣室"
    },
    "3-15": {
        "text": "下列适合采用干热空气灭菌的物品是哪些？",
        "options": {
            "A": "油类",
            "B": "活性炭",
            "C": "塑料制品",
            "D": "玻璃器皿",
            "E": "凡士林"
        },
        "answer": "ABDE",
        "answer_text": "A: 油类\nB: 活性炭\nD: 玻璃器皿\nE: 凡士林"
    },
    "3-16": {
        "text": "紫外线灭菌可用于哪些情况？",
        "options": {
            "A": "1～2ml安瓿灭菌",
            "B": "操作室空气灭菌",
            "C": "蜜丸灭菌",
            "D": "物体表面灭菌",
            "E": "片剂灭菌"
        },
        "answer": "BD",
        "answer_text": "B: 操作室空气灭菌\nD: 物体表面灭菌"
    },
    "3-17": {
        "text": "下列关于药物粉碎目的的叙述，哪些是正确的？",
        "options": {
            "A": "增加药物的表面积，促进药物的溶解与吸收，提高药物的生物利用度",
            "B": "便于适用多种给药途径的应用",
            "C": "加速药材中有效成分的浸出",
            "D": "有利于制备多种剂型，如混悬剂、片剂、胶囊剂等",
            "E": "适应某些剂型制备的要求，以解决流动性、混合均匀性与物理稳定性等问题"
        },
        "answer": "ABCDE",
        "answer_text": "A: 增加药物的表面积，促进药物的溶解与吸收，提高药物的生物利用度\nB: 便于适用多种给药途径的应用\nC: 加速药材中有效成分的浸出\nD: 有利于制备多种剂型，如混悬剂、片剂、胶囊剂等\nE: 适应某些剂型制备的要求，以解决流动性、混合均匀性与物理稳定性等问题"
    },
    "3-18": {
        "text": "采用串料法粉碎的药物有哪些？",
        "options": {
            "A": "杏仁",
            "B": "熟地",
            "C": "玄参",
            "D": "枸杞子",
            "E": "山萸肉"
        },
        "answer": "BE",
        "answer_text": "B: 熟地\nE: 山萸肉"
    },
    "3-19": {
        "text": "在粉碎物料时，节约机械能的措施有哪些？",
        "options": {
            "A": "采用混合粉碎法",
            "B": "采用湿法粉碎法",
            "C": "将物料干燥至含水5%以下",
            "D": "降低药物的温度，增加药物的脆性",
            "E": "及时地移出细粉"
        },
        "answer": "ACDE",
        "answer_text": "A: 采用混合粉碎法\nC: 将物料干燥至含水5%以下\nD: 降低药物的温度，增加药物的脆性\nE: 及时地移出细粉"
    },
    "3-20": {
        "text": "有关水飞法的叙述中，错误的是哪个？",
        "options": {
            "A": "属于混合粉碎法的一种",
            "B": "用以粉碎矿物类药物",
            "C": "粉碎用力较加液研磨小",
            "D": "水飞法粉碎时加入水",
            "E": "水飞法粉碎结果为取用漂浮的细粉"
        },
        "answer": "AC",
        "answer_text": "A: 属于混合粉碎法的一种\nC: 粉碎用力较加液研磨小"
    },
    "3-21": {
        "text": "有关加液研磨法的叙述中，错误的是哪个？",
        "options": {
            "A": "属于湿法粉碎的一种",
            "B": "用于粉碎矿物类药物",
            "C": "粉碎用力较水飞法大",
            "D": "加液研磨法粉碎时，宜加入少量挥发性液体",
            "E": "加液研磨法粉碎结果为取用沉降细粉"
        },
        "answer": "BC",
        "answer_text": "B: 用于粉碎矿物类药物\nC: 粉碎用力较水飞法大"
    },
    "3-22": {
        "text": "过筛时应遵循下列原则，哪些是正确的？",
        "options": {
            "A": "在振动中使药粉通过筛网",
            "B": "粉末宜干燥",
            "C": "粉末不宜过多",
            "D": "粉末不宜过少",
            "E": "过筛后应再进一步搅拌混合"
        },
        "answer": "ABC",
        "answer_text": "A: 在振动中使药粉通过筛网\nB: 粉末宜干燥\nC: 粉末不宜过多"
    },
    "3-23": {
        "text": "在散剂制备过程中目前常用的混合方法有哪些？",
        "options": {
            "A": "搅拌混合",
            "B": "对流混合",
            "C": "过筛混合",
            "D": "扩散混合",
            "E": "研磨混合"
        },
        "answer": "ABC",
        "answer_text": "A: 搅拌混合\nB: 对流混合\nC: 过筛混合"
    },
    "3-24": {
        "text": "影响干燥的因素有哪些？",
        "options": {
            "A": "物料的性质",
            "B": "干燥介质的温度",
            "C": "干燥介质的湿度与流速",
            "D": "干燥速度",
            "E": "压力"
        },
        "answer": "ABCE",
        "answer_text": "A: 物料的性质\nB: 干燥介质的温度\nC: 干燥介质的湿度与流速\nE: 压力"
    },
    "3-25": {
        "text": "疏水胶体的性质包括哪些？",
        "options": {
            "A": "存在强烈布朗运动",
            "B": "具有双分子层",
            "C": "具有聚沉现象",
            "D": "可以形成凝胶",
            "E": "具有Tyndall现象"
        },
        "answer": "ABE",
        "answer_text": "A: 存在强烈布朗运动\nB: 具有双分子层\nE: 具有Tyndall现象"
    },
    "3-26": {
        "text": "糖浆剂的制备方法有哪些？",
        "options": {
            "A": "热溶法",
            "B": "稀释法",
            "C": "冷溶法",
            "D": "混合法",
            "E": "分散法"
        },
        "answer": "AC",
        "answer_text": "A: 热溶法\nC: 冷溶法"
    },
    "3-27": {
        "text": "以下哪些属于非均相分散体系？",
        "options": {
            "A": "溶液剂",
            "B": "溶胶剂",
            "C": "高分子溶液剂",
            "D": "混悬剂",
            "E": "乳剂"
        },
        "answer": "BCDE",
        "answer_text": "B: 溶胶剂\nC: 高分子溶液剂\nD: 混悬剂\nE: 乳剂"
    },
    "3-28": {
        "text": "提高混悬剂稳定性的措施包括哪些？",
        "options": {
            "A": "减少微粒的半径",
            "B": "增加分散介质的黏度",
            "C": "更换分散介质",
            "D": "加入絮凝剂",
            "E": "减少微粒与分散介质的密度差"
        },
        "answer": "ABCE",
        "answer_text": "A: 减少微粒的半径\nB: 增加分散介质的黏度\nC: 更换分散介质\nE: 减少微粒与分散介质的密度差"
    },
    "3-29": {
        "text": "增加混悬剂稳定性的方法是",
        "options": {
            "A": "加入助悬剂",
            "B": "加入润湿剂",
            "C": "加入絮凝剂",
            "D": "减小混悬微粒半径",
            "E": "加入触变胶"
        },
        "answer": "ABCDE",
        "answer_text": "A: 加入助悬剂\nB: 加入润湿剂\nC: 加入絮凝剂\nD: 减小混悬微粒半径\nE: 加入触变胶"
    },
    "3-30": {
        "text": "属于天然乳化剂的是",
        "options": {
            "A": "海藻酸钠",
            "B": "西黄蓍胶",
            "C": "月桂醇硫酸钠",
            "D": "阿拉伯胶",
            "E": "卵磷脂"
        },
        "answer": "BDE",
        "answer_text": "B: 西黄蓍胶\nD: 阿拉伯胶\nE: 卵磷脂"
    },
    "3-31": {
        "text": "聚山梨酯类表面活性剂在液体制剂中主要用作",
        "options": {
            "A": "助溶作用",
            "B": "乳化作用",
            "C": "润滑作用",
            "D": "增溶作用",
            "E": "润湿作用"
        },
        "answer": "BDE",
        "answer_text": "B: 乳化作用\nD: 增溶作用\nE: 润湿作用"
    },
    "3-32": {
        "text": "关于液体制剂的溶剂叙述正确的是",
        "options": {
            "A": "乙醇能与水、甘油、丙二醇等溶剂任意比例混合",
            "B": "5％以上的稀乙醇即有防腐作用",
            "C": "无水甘油对皮肤和黏膜无刺激性",
            "D": "液体制剂中可用聚乙二醇300600",
            "E": "聚乙二醇对一些易水解药物有一定的稳定作用"
        },
        "answer": "ADE",
        "answer_text": "A: 乙醇能与水、甘油、丙二醇等溶剂任意比例混合\nD: 液体制剂中可用聚乙二醇300600\nE:聚乙二醇对一些易水解药物有一定的稳定作用"
    },
    "3-33": {
        "text": "关于溶液剂的制法叙述正确的有",
        "options": {
            "A": "溶液剂可采用将药物制成高浓度溶液，使用时再用溶剂稀释至需要浓度的方法制备",
            "B": "处方中如有附加剂或溶解度较小的药物，应最后加入",
            "C": "药物在溶解过程中应采用粉碎、加热、搅拌等措施",
            "D": "易氧化的药物溶解时宜将溶剂加热放冷后再溶解药物",
            "E": "对易挥发性药物应在先加入"
        },
        "answer": "ACD",
        "answer_text": "A: 溶液剂可采用将药物制成高浓度溶液，使用时再用溶剂稀释至需要浓度的方法制备\nC: 药物在溶解过程中应采用粉碎、加热、搅拌等措施\nD: 易氧化的药物溶解时宜将溶剂加热放冷后再溶解药物"
    },
    "3-34": {
        "text": "溶胶剂制备中属于分散法的是",
        "options": {
            "A": "机械分散法",
            "B": "化学分散",
            "C": "胶溶法",
            "D": "超声分散法",
            "E": "稀释法"
        },
        "answer": "AD",
        "answer_text": "A: 机械分散法\nD: 超声分散法"
    },
    "3-35": {
        "text": "溶液型的液体制剂种类可以分为",
        "options": {
            "A": "芳香水剂",
            "B": "溶液剂",
            "C": "糖浆剂",
            "D": "醑剂",
            "E": "高分子溶液"
        },
        "answer": "ABCD",
        "answer_text": "A: 芳香水剂\nB: 溶液剂\nC: 糖浆剂\nD: 醑剂"
    },
    "3-36": {
        "text": "O/W型与W/O乳剂的鉴别方法有",
        "options": {
            "A": "外观法",
            "B": "稀释法",
            "C": "搅拌法",
            "D": "导电法",
            "E": "染色法"
        },
        "answer": "BDE",
        "answer_text": "B: 稀释法\nD:导电法\nE:: 染色法"
    },
    "3-37": {
        "text": "关于注射剂的特点叙述正确的是",
        "options": {
            "A": "无吸收过程或吸收过程很短",
            "B": "无首过效应",
            "C": "安全性及机体适应性好",
            "D": "可以发挥局部定位作用",
            "E": "与固体制剂相比稳定性好"
        },
        "answer": "ABD",
        "answer_text": "A: 无吸收过程或吸收过程很短\nB: 无首过效应\nD: 可以发挥局部定位作用"
    },
    "3-38": {
        "text": "注射剂的质量检查项目有",
        "options": {
            "A": "热原",
            "B": "澄明度",
            "C": "氨",
            "D": "氯化物",
            "E": "渗透压"
        },
        "answer": "ABE",
        "answer_text": "A: 热原\nB: 澄明度\nE: 渗透压"
    },
    "3-39": {
        "text": "A级洁净厂房用于",
        "options": {
            "A": "粉针剂原料药的精制、烘干、分装",
            "B": "复方氨基酸输液的配液",
            "C": "棕色合剂(复方甘草合剂)的制备",
            "D": "注射用胰蛋白酶的分装、压塞",
            "E": "0.9%氯化钠注射剂(2ml)的配液"
        },
        "answer": "ABDE",
        "answer_text": "A: 粉针剂原料药的精制、烘干、分装\nB: 复方氨基酸输液的配液\nD: 注射用胰蛋白酶的分装、压塞\nE: 0.9%氯化钠注射剂(2ml)的配液"
    },
    "3-40": {
        "text": "关于注射用水的叙述正确的是",
        "options": {
            "A": "多采用综合法制备",
            "B": "不需检查pH",
            "C": "必须通过热原检查",
            "D": "注射用水不同于一般的药用纯化水，主要在于无菌",
            "E": "注射用无菌粉末临用前用药用纯化水溶解即可"
        },
        "answer": "AC",
        "answer_text": "A: 多采用综合法制备\nC: 必须通过热原检查"
    },
    "3-41": {
        "text": "关于热原检查法的叙述正确的是",
        "options": {
            "A": "中国药典规定热原用家兔法检查",
            "B": "鲎试剂法对革兰阴性菌以外的内毒素更灵敏",
            "C": "鲎试剂法可以代替家兔法",
            "D": "放射性药物、肿瘤抑制剂应用家兔法检查",
            "E": "注射用水可用鲎试剂法检查"
        },
        "answer": "AE",
        "answer_text": "A: 中国药典规定热原用家兔法检查\nE: 注射用水可用鲎试剂法检查"
    },
    "3-42": {
        "text": "热原的组成包括",
        "options": {
            "A": "磷脂",
            "B": "胆固醇",
            "C": "脂多糖",
            "D": "核酸",
            "E": "蛋白质"
        },
        "answer": "ACE",
        "answer_text": "A: 磷脂\nC: 脂多糖\nE: 蛋白质"
    },
    "3-43": {
        "text": "污染热原的途径有",
        "options": {
            "A": "溶剂",
            "B": "原料",
            "C": "容器及用具",
            "D": "制备过程",
            "E": "灭菌过程"
        },
        "answer": "ABCDE",
        "answer_text": "A: 溶剂\nB: 原料\nC: 容器及用具\nD: 制备过程\nE: 灭菌过程"
    },
    "3-46": {
        "text": "关于电渗析法处理原水，下列正确的说法有",
        "options": {
            "A": "电渗析法可以彻底除去热原",
            "B": "电渗析法多在离子交换树脂前使用，以减轻离子交换树脂的负担",
            "C": "电渗析法与离子交换法相比可以节约酸碱",
            "D": "电渗析法处理原水是利用纯水与盐溶液间的渗透压差实现的",
            "E": "电渗析法制备注射用水已被美国药典收载"
        },
        "answer": "BC",
        "answer_text": "B: 电渗析法多在离子交换树脂前使用，以减轻离子交换树脂的负担\nC: 电渗析法与离子交换法相比可以节约酸碱"
    },
    "3-47": {
        "text": "注射用水的生产方法有",
        "options": {
            "A": "离子交换法",
            "B": "电渗析法",
            "C": "蒸馏法",
            "D": "反渗透法",
            "E": "滤过法"
        },
        "answer": "ABCDE",
        "answer_text": "A: 离子交换法\nB: 电渗析法\nC: 蒸馏法\nD: 反渗透法\nE: 滤过法"
    },
    "3-48": {
        "text": "关于蒸馏法制备注射用水的说法正确的有",
        "options": {
            "A": "是我国药典法定的制备注射用水的方法",
            "B": "塔式或亭式蒸馏水器主要包括蒸发锅、隔沫装置和冷凝器",
            "C": "隔沫装置的主要作用是除去细菌",
            "D": "蒸馏法制备注射用水是利用热原的水溶性",
            "E": "多效蒸馏水器耗能低、产量高"
        },
        "answer": "ABE",
        "answer_text": "A: 是我国药典法定的制备注射用水的方法\nB: 塔式或亭式蒸馏水器主要包括蒸发锅、隔沫装置和冷凝器\nE: 多效蒸馏水器耗能低、产量高"
    },
    "3-49": {
        "text": "关于反渗透法制备注射用水的说法正确的有",
        "options": {
            "A": "美国药典已收载此法为制备注射用水的法定方法",
            "B": "反渗透法可除去微生物．病毒",
            "C": "一级反渗透装置除去氯离子的能力可达到药典的要求",
            "D": "目前我国药典已收载反渗透法为法定方法",
            "E": "与蒸馏法相比反渗透法的优点是设备简单．节省能源和冷却水"
        },
        "answer": "ABE",
        "answer_text": "A: 美国药典已收载此法为制备注射用水的法定方法\nB: 反渗透法可除去微生物．病毒\nE: 与蒸馏法相比反渗透法的优点是设备简单．节省能源和冷却水"
    },
    "3-50": {
        "text": "可用于静脉注射用的表面活性剂为",
        "options": {
            "A": "油酸钠",
            "B": "泊洛沙姆188",
            "C": "豆磷脂",
            "D": "十二烷基硫酸钠",
            "E": "脂肪酸山梨坦80"
        },
        "answer": "BC",
        "answer_text": "B: 泊洛沙姆188\nC: 豆磷脂"
    },
    "3-51": {
        "text": "关于安瓿的叙述正确的是",
        "options": {
            "A": "应具有低的膨胀系数和耐热性",
            "B": "对光敏性药物，可选用各种颜色的安瓿",
            "C": "应具有高度的化学稳定性",
            "D": "要有足够的物理强度",
            "E": "应具有较高的熔点"
        },
        "answer": "ACD",
        "answer_text": "A: 应具有低的膨胀系数和耐热性\nC: 应具有高度的化学稳定性\nD: 要有足够的物理强度"
    },
    "3-52": {
        "text": "关于注射剂容器的处理正确的说法有",
        "options": {
            "A": "经100℃蒸煮可使附着的灰尘和细小的砂粒落人水中",
            "B": "经100℃蒸煮可使玻璃表面的硅酸盐水解，微量的游离碱和金属离子溶解，提高安瓿的化学稳定性",
            "C": "已灭菌的安瓿应在48h内使用",
            "D": "回收的旧输液瓶或长期未严密封存的新瓶应用碱液洗涤",
            "E": "新瓶及洁净度较好的输液瓶应用重铬酸钾清洁液洗涤"
        },
        "answer": "AB",
        "answer_text": "A: 经100℃蒸煮可使附着的灰尘和细小的砂粒落人水中\nB: 经100℃蒸煮可使玻璃表面的硅酸盐水解，微量的游离碱和金属离子溶解，提高安瓿的化学稳定性"
    },
    "3-53": {
        "text": "关于注射液配制的叙述错误的是",
        "options": {
            "A": "需选择注射用规格的原辅料",
            "B": "注射剂在灭菌后含量有下降时应酌情增加投料量",
            "C": "配制容器多为夹层配液锅、不锈钢配液缸、搪瓷筒等，不能用塑料容器",
            "D": "配液后玻璃容器可加入少量洗液或75％乙醇放置，以免滋长细菌",
            "E": "称量时应至少3人以上核对"
        },
        "answer": "DE",
        "answer_text": "D: 配液后玻璃容器可加入少量洗液或75％乙醇放置，以免滋长细菌\nE: 称量时应至少3人以上核对"
    },
    "3-54": {
        "text": "输液中微粒的污染途径有",
        "options": {
            "A": "工艺操作中的问题",
            "B": "橡胶塞与输液瓶质量不好",
            "C": "原辅料质量存在问题",
            "D": "医院输液操作不当",
            "E": "精滤选择了0.22μm的微孔滤膜"
        },
        "answer": "ABCDE",
        "answer_text": "A: 工艺操作中的问题\nB: 橡胶塞与输液瓶质量不好\nC: 原辅料质量存在问题\nD: 医院输液操作不当\nE: 精滤选择了0.22μm的微孔滤膜"
    },
    "3-55": {
        "text": "生产注射剂时常加入适量活性炭，其作用为",
        "options": {
            "A": "吸附热原",
            "B": "能增加主药稳定性",
            "C": "脱色",
            "D": "脱盐",
            "E": "提高澄明度"
        },
        "answer": "ACE",
        "answer_text": "A: 吸附热原\nC: 脱色\nE: 提高澄明度"
    },
    "3-56": {
        "text": "注射液除菌过滤可采用",
        "options": {
            "A": "细号砂滤棒",
            "B": "6号垂熔玻璃滤器",
            "C": "0.22μm微孔滤膜",
            "D": "硝酸纤维素微孔滤膜",
            "E": "钛滤器"
        },
        "answer": "BC",
        "answer_text": "B: 6号垂熔玻璃滤器\nC: 0.22μm微孔滤膜"
    },
    "3-57": {
        "text": "热原是微生物的代谢产物，其具有下列哪些性质",
        "options": {
            "A": "易挥发",
            "B": "100℃,30min即可被100％破坏",
            "C": "易溶于水",
            "D": "不耐强酸强碱",
            "E": "不易被吸附"
        },
        "answer": "CD",
        "answer_text": "C: 易溶于水\nD: 不耐强酸强碱"
    },
    "3-58": {
        "text": "冷冻干燥法制备注射剂的优点是",
        "options": {
            "A": "可避免药品因高热而分解变质",
            "B": "所得产品质地疏松，加水后迅速溶解，恢复药液原有的特性",
            "C": "可以选择多种溶剂来制备需要的不同晶型",
            "D": "含水量低，有利于产品长期贮存",
            "E": "无需特殊设备，成本较低"
        },
        "answer": "ABD",
        "answer_text": "A: 可避免药品因高热而分解变质\nB: 所得产品质地疏松，加水后迅速溶解，恢复药液原有的特性\nD: 含水量低，有利于产品长期贮存"
    },
    "3-59": {
        "text": "散剂混合时，产生湿润与液化现象的相关条件是",
        "options": {
            "A": "药物结构性质",
            "B": "低共熔点的大小",
            "C": "药物组成比例",
            "D": "药物粉碎度",
            "E": "制备环境的温度"
        },
        "answer": "ACE",
        "answer_text": "A: 药物结构性质\nC: 药物组成比例\nE: 制备环境的温度"
    },
    "3-60": {
        "text": "在散剂制备过程中，目前常用的混合方法有",
        "options": {
            "A": "搅拌混合",
            "B": "对流混合",
            "C": "过筛混合",
            "D": "扩散混合",
            "E": "研磨混合"
        },
        "answer": "ACE",
        "answer_text": "A: 搅拌混合\nC: 过筛混合\nE: 研磨混合"
    },
    "3-61": {
        "text": "关于滴丸冷凝液选择叙述中正确的为",
        "options": {
            "A": "不与主药相混合",
            "B": "不与基质发生作用",
            "C": "不影响主药疗效",
            "D": "有适当的密度",
            "E": "有适当的粘度"
        },
        "answer": "ABCDE",
        "answer_text": "A: 不与主药相混合\nB: 不与基质发生作用\nC: 不影响主药疗效\nD: 有适当的密度\nE: 有适当的粘度"
    },
    "3-62": {
        "text": "滴丸基质应具备的条件是",
        "options": {
            "A": "不与主药发生作用，不影响主药的疗效",
            "B": "对人体无害",
            "C": "要有适当的比重",
            "D": "在常温下保持固态",
            "E": "熔点较低，在一定的温度（60-100℃）下能熔化成液体，而遇骤冷又能凝固成固体"
        },
        "answer": "ABDE",
        "answer_text": "A: 不与主药发生作用，不影响主药的疗效\nB: 对人体无害\nD: 在常温下保持固态\nE: 熔点较低，在一定的温度（60-100℃）下能熔化成液体，而遇骤冷又能凝固成固体"
    },
    "3-63": {
        "text": "下列关于硬胶囊壳的错误叙述是",
        "options": {
            "A": "胶囊壳主要由明胶组成",
            "B": "制囊壳时加入山梨醇作抑菌剂",
            "C": "加入二氧化钛使囊壳易于识别",
            "D": "囊壳含水量高于1.5%时囊壳太软",
            "E": "囊壳编号数值越大，其容量越大"
        },
        "answer": "BCDE",
        "answer_text": "B: 制囊壳时加入山梨醇作抑菌剂\nC: 加入二氧化钛使囊壳易于识别\nD: 囊壳含水量高于1.5%时囊壳太软\nE: 囊壳编号数值越大，其容量越大"
    },
    "3-64": {
        "text": "含易共熔成分的散剂适宜采用的包装是",
        "options": {
            "A": "普通有光纸",
            "B": "蜡纸",
            "C": "玻璃纸",
            "D": "塑料薄膜纸",
            "E": "玻璃瓶"
        },
        "answer": "ACDE",
        "answer_text": "A: 普通有光纸\nC: 玻璃纸\nD: 塑料薄膜纸\nE: 玻璃瓶"
    },
    "3-65": {
        "text": "生产滴制胶丸时，理想的操作条件应包括",
        "options": {
            "A": "车间温度20℃以下",
            "B": "车间温度25℃以下",
            "C": "车间相对湿度75%以下",
            "D": "滴头温度40℃-50℃",
            "E": "滴头温度60℃-70℃"
        },
        "answer": "ACD",
        "answer_text": "A: 车间温度20℃以下\nC: 车间相对湿度75%以下\nD: 滴头温度40℃-50℃"
    },
    "3-66": {
        "text": "胶囊剂操作环境中，理想的操作条件应包括",
        "options": {
            "A": "温度20℃-30℃",
            "B": "温度20℃以下",
            "C": "温度30℃-40℃",
            "D": "相对湿度30%-45%",
            "E": "相对湿度40%-60%"
        },
        "answer": "AD",
        "answer_text": "A: 温度20℃-30℃\nD: 相对湿度30%-45%"
    },
    "3-67": {
        "text": "制备肠溶胶囊的方法可以用",
        "options": {
            "A": "普通明胶囊用甲醛处理",
            "B": "普通明胶囊用含适量水的甘油处理",
            "C": "普通明胶囊包括肠溶衣料",
            "D": "普通明胶囊喷洒甲醛-丙酮（1：60）溶液",
            "E": "普通明胶囊用丙烯酸2．号树脂乙醇CPA溶液胞衣"
        },
        "answer": "ACDE",
        "answer_text": "A: 普通明胶囊用甲醛处理\nC: 普通明胶囊包括肠溶衣料\nD: 普通明胶囊喷洒甲醛-丙酮（1：60）溶液\nE: 普通明胶囊用丙烯酸2．号树脂乙醇CPA溶液胞衣"
    },
    "3-68": {
        "text": "下列关于软胶囊剂的叙述，正确的是",
        "options": {
            "A": "软胶囊又称为胶丸",
            "B": "滴制法制备的是无缝胶囊，压制法制备的是有缝胶囊",
            "C": "被包封的液态药物含水量不得超过10%",
            "D": "囊型组成：干明胶：干增塑剂=1.0:0.4-0.6;干明胶:水=1:1",
            "E": "圆形或卵形软胶囊可包制液态介质8-1.0ml"
        },
        "answer": "ABD",
        "answer_text": "A: 软胶囊又称为胶丸\nB: 滴制法制备的是无缝胶囊，压制法制备的是有缝胶囊\nD: 囊型组成：干明胶：干增塑剂=1.0:0.4-0.6;干明胶:水=1:1"
    },
    "3-69": {
        "text": "散剂必须进行哪些质量检查",
        "options": {
            "A": "外观均匀度",
            "B": "粒度",
            "C": "干燥失重",
            "D": "装量差异",
            "E": "溶化性"
        },
        "answer": "ABCDE",
        "answer_text": "A: 外观均匀度\nB: 粒度\nC: 干燥失重\nD: 装量差异\nE: 溶化性"
    },
    "3-70": {
        "text": "颗粒剂必须进行哪些质量检查",
        "options": {
            "A": "外观均匀度",
            "B": "粒度",
            "C": "干燥失重",
            "D": "装量差异",
            "E": "溶化性"
        },
        "answer": "ABCE",
        "answer_text": "A: 外观均匀度\nB: 粒度\nC: 干燥失重\nE: 溶化性"
    },
    "3-71": {
        "text": "硬胶囊的囊心物有",
        "options": {
            "A": "粉末",
            "B": "颗粒",
            "C": "微丸",
            "D": "O／W型乳剂",
            "E": "水溶液"
        },
        "answer": "ABC",
        "answer_text": "A: 粉末\nB: 颗粒\nC: 微丸"
    },
    "3-72": {
        "text": "软胶囊的胶皮处方由哪些成分组成",
        "options": {
            "A": "明胶",
            "B": "甘油",
            "C": "水",
            "D": "乙醇",
            "E": "PEG"
        },
        "answer": "ABC",
        "answer_text": "A: 明胶\nB: 甘油\nC: 水"
    },
    "3-73": {
        "text": "软胶囊的囊心物可以是",
        "options": {
            "A": "油溶液",
            "B": "水溶液",
            "C": "水混悬液",
            "D": "油混悬液",
            "E": "O／W型乳剂"
        },
        "answer": "AD",
        "answer_text": "A: 油溶液\nD: 油混悬液"
    },
    "3-74": {
        "text": "对片剂崩解度的叙述中，错误的是",
        "options": {
            "A": "所有的片剂都应在胃肠道中崩解",
            "B": "药典对普通口服片剂．包衣片剂以及肠溶衣片规定了不同的崩解时限",
            "C": "水分的透入是片剂崩解的首要条件",
            "D": "辅料中粘合剂的粘合力越大，片剂的崩解时间越长",
            "E": "片剂经过长时间储存后，崩解时间往往减少"
        },
        "answer": "AE",
        "answer_text": "A: 所有的片剂都应在胃肠道中崩解\nE: 片剂经过长时间储存后，崩解时间往往减少"
    },
    "3-75": {
        "text": "影响片剂成型的主要因素有",
        "options": {
            "A": "药物的可压性与药物的熔点",
            "B": "粘合剂用量的大小",
            "C": "颗粒的流动性是否好",
            "D": "压片时压力的大小与加压的时间",
            "E": "压力分布均匀与否"
        },
        "answer": "AC",
        "answer_text": "A: 药物的可压性与药物的熔点\nC: 颗粒的流动性是否好"
    },
    "3-76": {
        "text": "关于片剂包衣的目的，正确的叙述是",
        "options": {
            "A": "增加药物的稳定性",
            "B": "减轻药物对胃肠道的刺激",
            "C": "提高片剂的生物利用度",
            "D": "避免药物的首过效应",
            "E": "掩盖药物的不良味道"
        },
        "answer": "ABE",
        "answer_text": "A: 增加药物的稳定性\nB: 减轻药物对胃肠道的刺激\nE: 掩盖药物的不良味道"
    },
    "3-77": {
        "text": "口含片应符合以下要求",
        "options": {
            "A": "所含药物与辅料应是可溶的",
            "B": "应在30分钟内全部崩解",
            "C": "所含药物应是可溶性的",
            "D": "口含片的硬度可大于普通片",
            "E": "药物在口腔内缓慢溶解吸收而发挥全身作用"
        },
        "answer": "ABCD",
        "answer_text": "A: 所含药物与辅料应是可溶的\nB: 应在30分钟内全部崩解\nC: 所含药物应是可溶性的\nD: 口含片的硬度可大于普通片"
    },

    "3-78": {
        "text": "关于肠溶衣的叙述，正确的是",
        "options": {
            "A": "用肠溶材料的片剂",
            "B": "按崩解时限检查法检查，应在1小时内全部崩解",
            "C": "可控制药物在肠道内定位释放",
            "D": "可检查释放度来控制片剂质量",
            "E": "必须检查含量均匀"
        },
        "answer": "ACDE",
        "answer_text": "A: 用肠溶材料的片剂\nC: 可控制药物在肠道内定位释放\nD: 可检查释放度来控制片剂质量\nE: 必须检查含量均匀"
    },

    "3-79": {
        "text": "分散片的特点和质量控制是",
        "options": {
            "A": "能为迅速崩解，均匀分散的片剂",
            "B": "进行崩解时限检查",
            "C": "所含药物应是易溶的",
            "D": "应进行溶出度检查",
            "E": "应检查分散均匀度"
        },
        "answer": "AD",
        "answer_text": "A: 能为迅速崩解，均匀分散的片剂\nD: 应进行溶出度检查"
    },
    "3-80": {
        "text": "下列片剂应进行含量均匀度检查",
        "options": {
            "A": "主药含量小于10mg",
            "B": "主药含量小于5mg",
            "C": "主药含量小于2.5mg",
            "D": "主药含量小于每片片重的5%",
            "E": "主药含量小于每片片重的10%"
        },
        "answer": "ABE",
        "answer_text": "A: 主药含量小于10mg\nB: 主药含量小于5mg\nE: 主药含量小于每片片重的10%"
    },

    "3-81": {
        "text": "有关口服控释片的解释，正确的是",
        "options": {
            "A": "口服后，应缓慢释放或接近恒速释放药物",
            "B": "每24小时用药次数应不大于1-2次",
            "C": "应控制释放度",
            "D": "必须进行崩解时限检查",
            "E": "应进行溶出度检查"
        },
        "answer": "ABE",
        "answer_text": "A: 口服后，应缓慢释放或接近恒速释放药物\nB: 每24小时用药次数应不大于1-2次\nE: 应进行溶出度检查"
    },

    "3-82": {
        "text": "可不做崩解时限检查的片剂剂型",
        "options": {
            "A": "控释片",
            "B": "含片",
            "C": "咀嚼片",
            "D": "肠溶衣片",
            "E": "舌下片"
        },
        "answer": "AD",
        "answer_text": "A: 控释片\nD: 肠溶衣片"
    },
    "3-83": {
        "text": "软膏的类脂类基质有",
        "options": {
            "A": "凡士林",
            "B": "羊毛脂",
            "C": "石蜡",
            "D": "蜂蜡",
            "E": "硅酮"
        },
        "answer": "BD",
        "answer_text": "B: 羊毛脂\nD: 蜂蜡"
    },

    "3-84": {
        "text": "下列关于软膏基质的叙述中错误的是",
        "options": {
            "A": "凡士林中加入羊毛脂可增加吸水性",
            "B": "液体石蜡主要用于调节软膏稠度",
            "C": "乳剂型基质中因含有表面活性剂，对药物的释放和穿透均较油质性基质差",
            "D": "基质主要作为药物载体，对药物释放影响不大",
            "E": "水溶性基质能吸收组织渗出液，释放药物较快，无刺激"
        },
        "answer": "CD",
        "answer_text": "C: 乳剂型基质中因含有表面活性剂，对药物的释放和穿透均较油质性基质差\nD: 基质主要作为药物载体，对药物释放影响不大"
    },

    "3-85": {
        "text": "肛门栓具有以下特点",
        "options": {
            "A": "可通过直肠给药并吸收进入血液而起到全身作用",
            "B": "药物可不受胃肠酸碱度和酶的影响",
            "C": "栓剂塞入直肠的深处（6cm），药物可避免首过效应",
            "D": "在体温下可软化或融化",
            "E": "粪便的存在有利于药物吸收"
        },
        "answer": "ABD",
        "answer_text": "A: 可通过直肠给药并吸收进入血液而起到全身作用\nB: 药物可不受胃肠酸碱度和酶的影响\nD: 在体温下可软化或融化"
    },
    "3-86": {
        "text": "下列软膏剂哪些可以用微生物限度法来控制染菌量",
        "options": {
            "A": "用于大面积烧伤的软膏",
            "B": "用于皮肤严重损伤的软膏",
            "C": "鼻用软膏",
            "D": "一般眼膏",
            "E": "用于眼部手术及伤口的眼膏"
        },
        "answer": "ABE",
        "answer_text": "A: 用于大面积烧伤的软膏\nB: 用于皮肤严重损伤的软膏\nE: 用于眼部手术及伤口的眼膏"
    },
    "3-87": {
        "text": "有关软膏中药物经皮吸收的叙述，哪些是正确的",
        "options": {
            "A": "水溶性药物的穿透力>脂溶性药物",
            "B": "溶解态药物的穿透力>微粉混悬态药物",
            "C": "药物的分子量越小，越易吸收",
            "D": "皮肤破损可增加药物的吸收",
            "E": "药物的油水分配系数是影响吸收的内在因素"
        },
        "answer": "BCDE",
        "answer_text": "B: 溶解态药物的穿透力>微粉混悬态药物\nC: 药物的分子量越小，越易吸收\nD: 皮肤破损可增加药物的吸收\nE: 药物的油水分配系数是影响吸收的内在因素"
    },

    "3-88": {
        "text": "需用无菌检查法检查染菌量的制剂",
        "options": {
            "A": "用于大面积烧伤及皮肤严重损伤的软膏",
            "B": "一般软膏",
            "C": "一般眼膏",
            "D": "用于创伤的眼膏",
            "E": "滴眼剂"
        },
        "answer": "AD",
        "answer_text": "A: 用于大面积烧伤及皮肤严重损伤的软膏\nD: 用于创伤的眼膏"
    },

    "3-89": {
        "text": "有关制备软膏剂的叙述，错误的是",
        "options": {
            "A": "用于鼻粘膜的基质不需灭菌",
            "B": "溶液型眼膏不必进行粒度检测",
            "C": "眼膏剂基质滤过后，140℃灭菌1小时",
            "D": "鼻用混悬型软膏剂中的不溶性固体药物，应灭菌处理",
            "E": "用于眼部手术的眼膏，不得加抑菌剂"
        },
        "answer": "AC",
        "answer_text": "A: 用于鼻粘膜的基质不需灭菌\nC: 眼膏剂基质滤过后，140℃灭菌1小时"
    },
    "3-90": {
        "text": "软膏基质对药物透皮吸收的影响如下",
        "options": {
            "A": "基质中加入适量的二甲基哑砜可增加药物吸收",
            "B": "油脂性基质中的药物吸收最快",
            "C": "能使药物分子型增多的适宜酸碱度有利于药物吸收",
            "D": "能增加皮肤角质层含水量的基质可促进药物吸收",
            "E": "加入5%尿素可降低药物的吸收"
        },
        "answer": "ACD",
        "answer_text": "A: 基质中加入适量的二甲基哑砜可增加药物吸收\nC: 能使药物分子型增多的适宜酸碱度有利于药物吸收\nD: 能增加皮肤角质层含水量的基质可促进药物吸收"
    },
    "3-91": {
        "text": "软膏剂的质量评定项目包括",
        "options": {
            "A": "稠度的测定",
            "B": "熔点的测定",
            "C": "刺激性的检测",
            "D": "稳定性的检测",
            "E": "药物释放、穿透及吸收的评定"
        },
        "answer": "ABCDE",
        "answer_text": "A: 稠度的测定\nB: 熔点的测定\nC: 刺激性的检测\nD: 稳定性的检测\nE: 药物释放、穿透及吸收的评定"
    },
    "3-92": {
        "text": "下列有关一般软膏剂应具备的质量要求的叙述，正确的是",
        "options": {
            "A": "均匀、细腻，涂于皮肤上无刺激性，有涂展性",
            "B": "无酸败、异臭、变硬和油水分离等变质现象",
            "C": "无刺激性、过敏性及其他不良反应",
            "D": "当用于大面烧伤时，应预先予以灭菌",
            "E": "眼用软膏的配制无需在无菌条件下进行"
        },
        "answer": "ABC",
        "answer_text": "A: 均匀、细腻，涂于皮肤上无刺激性，有涂展性\nB: 无酸败"
    },
    "3-93": {
        "text": "O／W型软膏基质中须加入的附加剂有",
        "options": {
            "A": "润滑剂",
            "B": "保湿剂",
            "C": "填充剂",
            "D": "防腐剂",
            "E": "氧化剂"
        },
        "answer": "BD",
        "answer_text": "B: 保湿剂\nD: 防腐剂"
    },
    "3-94": {
        "text": "属于O／W型乳化剂的有",
        "options": {
            "A": "平平加O",
            "B": "乳化剂OP",
            "C": "聚山梨酯类",
            "D": "PEG类",
            "E": "钙皂"
        },
        "answer": "ABC",
        "answer_text": "A: 平平加O\nB: 乳化剂OP\nC: 聚山梨酯类"
    },
    "3-95": {
        "text": "对气雾剂应做哪些项目检查",
        "options": {
            "A": "泄露和爆破检查",
            "B": "每瓶总揿次",
            "C": "泄露率",
            "D": "二相气雾剂的粒度",
            "E": "每揿主药含量"
        },
        "answer": "ABCDE",
        "answer_text": "A: 泄露和爆破检查\nB: 每瓶总揿次\nC: 泄露率\nD: 二相气雾剂的粒度\nE: 每揿主药含量"
    },
    "3-96": {
        "text": "单剂量大于0.5g的药物一般不宜制备",
        "options": {
            "A": "气雾剂",
            "B": "注射剂",
            "C": "胶囊剂",
            "D": "透皮给药系统",
            "E": "片剂"
        },
        "answer": "AD",
        "answer_text": "A: 气雾剂\nD: 透皮给药系统"
    },
    "3-97": {
        "text": "下列哪种剂型不含抛射剂",
        "options": {
            "A": "吸入气雾剂",
            "B": "吸入粉雾剂",
            "C": "外用气雾剂",
            "D": "喷雾剂",
            "E": "非吸入气雾剂"
        },
        "answer": "BD",
        "answer_text": "B: 吸入粉雾剂\nD: 喷雾剂"
    },
    "3-98": {
        "text": "按2015版药典规定，成品需进行药物粒度测定的剂型",
        "options": {
            "A": "二相气雾剂",
            "B": "吸入的三相气雾剂",
            "C": "吸入粉雾剂",
            "D": "非吸入粉雾剂",
            "E": "外用气雾剂"
        },
        "answer": "BC",
        "answer_text": "B: 吸入的三相气雾剂\nC: 吸入粉雾剂"
    },
    "3-99": {
        "text": "眼膏基质由什么组成",
        "options": {
            "A": "8份黄凡士林",
            "B": "8份白凡士林",
            "C": "1份液体石蜡",
            "D": "1份羊毛脂",
            "E": "1份固体石蜡"
        },
        "answer": "ACD",
        "answer_text": "A: 8份黄凡士林\nC: 1份液体石蜡\nD: 1份羊毛脂"
    },
    "3-100": {
        "text": "滴眼剂的附加剂有",
        "options": {
            "A": "pH调节剂",
            "B": "抑菌剂",
            "C": "黏度调节剂",
            "D": "减轻疼痛的附加剂",
            "E": "增溶剂"
        },
        "answer": "ABCDE",
        "answer_text": "A: pH调节剂\nB: 抑菌剂\nC: 黏度调节剂\nD: 减轻疼痛的附加剂\nE: 增溶剂"
    },
    "3-101": {
        "text": "单剂量大于0.5g的药物不宜制备哪些剂型",
        "options": {
            "A": "注射剂",
            "B": "薄膜衣片",
            "C": "气雾剂",
            "D": "透皮给药系统",
            "E": "胶囊剂"
        },
        "answer": "CD",
        "answer_text": "C: 气雾剂\nD: 透皮给药系统"
    },
    "3-102": {
        "text": "以下有关靶向给药系统的叙述中，哪些是错误的",
        "options": {
            "A": "药物制成毫微粒后，难以透过角膜，降低眼用药物的疗效",
            "B": "常用超声波分散法制备微球",
            "C": "药物包封于脂质体后，可在体内延缓释放，延长作用时间",
            "D": "清蛋白是制备脂质体的主要材料之一",
            "E": "药物包封于脂质体中，可增加稳定性"
        },
        "answer": "BCE",
        "answer_text": "B: 常用超声波分散法制备微球\nC: 药物包封于脂质体后，可在体内延缓释放，延长作用时间\nE: 药物包封于脂质体中，可增加稳定性"
    },
    "3-103": {
        "text": "以下哪些物质可以增加透皮吸收性",
        "options": {
            "A": "月桂氮卓酮",
            "B": "聚乙二醇",
            "C": "二甲基亚砜",
            "D": "薄荷醇",
            "E": "尿素"
        },
        "answer": "ABCDE",
        "answer_text": "A: 月桂氮卓酮\nB: 聚乙二醇\nC: 二甲基亚砜\nD: 薄荷醇\nE: 尿素"
    },
    "3-104": {
        "text": "环糊精包合物在药剂学中常用于",
        "options": {
            "A": "提高药物溶解度",
            "B": "液体药物粉末化",
            "C": "提高药物稳定性",
            "D": "制备靶向制剂",
            "E": "避免药物的首过效应"
        },
        "answer": "ABCD",
        "answer_text": "A: 提高药物溶解度\nB: 液体药物粉末化\nC: 提高药物稳定性\nD: 制备靶向制剂"
    },
    "3-105": {
        "text": "影响透皮吸收的因素是",
        "options": {
            "A": "药物的分子量",
            "B": "药物的低共熔点",
            "C": "皮肤的水合作用",
            "D": "药物晶体",
            "E": "透皮吸收促进剂"
        },
        "answer": "ACDE",
        "answer_text": "A: 药物的分子量\nC: 皮肤的水合作用\nD: 药物晶体\nE: 透皮吸收促进剂"
    },
    "3-106": {
        "text": "以减少溶出速度为主要原理的缓释制剂的制备工艺有",
        "options": {
            "A": "制成溶解度小的酯和盐",
            "B": "控制粒子大小",
            "C": "溶剂化",
            "D": "将药物包藏于溶蚀性骨架中",
            "E": "将药物包藏于亲水胶体物质中"
        },
        "answer": "ABDE",
        "answer_text": "A: 制成溶解度小的酯和盐\nB: 控制粒子大小\nD: 将药物包藏于溶蚀性骨架中\nE: 将药物包藏于亲水胶体物质中"
    },
    "3-107": {
        "text": "以下有关脂质体的叙述中，哪些是正确的",
        "options": {
            "A": "脂质体本身无药理作用，可作为药物的载体制成注射剂应用",
            "B": "油溶性药物可进入双分子层，水溶药物则进入脂质体内部",
            "C": "脂质体是一种脂质双分子的球形结构",
            "D": "脂质体可因双分子层的多少而分为单室脂质体和多室脂质体",
            "E": "脂质体的膜材特点为在水中不易形成胶团，分子不具有两亲性"
        },
        "answer": "ACD",
        "answer_text": "A: 脂质体本身无药理作用，可作为药物的载体制成注射剂应用\nC: 脂质体是一种脂质双分子的球形结构\nD: 脂质体可因双分子层的多少而分为单室脂质体和多室脂质体"
    },
    "3-108": {
        "text": "48．下列一些剂型中，哪些属于固体分散物",
        "options": {
            "A": "低共溶混合物",
            "B": "复方散剂",
            "C": "共沉淀物",
            "D": "气雾剂",
            "E": "固体溶液"
        },
        "answer": "ACE",
        "answer_text": "A: 低共溶混合物\nC: 共沉淀物\nE: 固体溶液"
    },
    "3-109": {
        "text": "49．β-环糊精在包合物后,在药剂学上的应用有",
        "options": {
            "A": "可增加药物的稳定性",
            "B": "可促进挥发性药物挥发",
            "C": "可以遮盖药物的苦臭味",
            "D": "减少液体药物的粉末化",
            "E": "可以增加药物的溶解度"
        },
        "answer": "ABCE",
        "answer_text": "A: 可增加药物的稳定性\nB: 可促进挥发性药物挥发\nC: 可以遮盖药物的苦臭味\nE: 可以增加药物的溶解度"
    },
    "3-110": {
        "text": "50．哪些药物不宜制成长效制剂",
        "options": {
            "A": "生物半衰期很短的药物",
            "B": "生物半衰期很长的药物",
            "C": "溶解度很小，吸收无规律的药物",
            "D": "一次剂量很大的药物",
            "E": "药效强烈的药物"
        },
        "answer": "ACDE",
        "answer_text": "A: 生物半衰期很短的药物\nC: 溶解度很小，吸收无规律的药物\nD: 一次剂量很大的药物\nE: 药效强烈的药物"
    },
    "3-111": {
        "text": "控释制剂由组成。",
        "options": {
            "A": "药物的贮库",
            "B": "控释部分",
            "C": "能源部分",
            "D": "传递孔道",
            "E": "速释部分"
        },
        "answer": "ABE",
        "answer_text": "A: 药物的贮库\nB: 控释部分\nE: 速释部分"
    },
    "3-112": {
        "text": "延长药物作用时间的方法主要有。",
        "options": {
            "A": "减小药物的溶出速率",
            "B": "减小药物的扩散速度",
            "C": "减小药物的释放速度",
            "D": "减小药物的崩解速度",
            "E": "减小药物的吸收速度"
        },
        "answer": "BCE",
        "answer_text": "B: 减小药物的扩散速度\nC: 减小药物的释放速度\nE: 减小药物的吸收速度"
    },
    "3-113": {
        "text": "减少药物溶出可通过。",
        "options": {
            "A": "控制难溶性药物粒径",
            "B": "将药物混悬于植物油中制成油溶液型注射剂",
            "C": "将药物包裹于疏水性溶蚀性骨架中，制成适宜剂型",
            "D": "将药物包裹于亲水性胶体骨架中，制成适宜剂型",
            "E": "固体分散"
        },
        "answer": "BCD",
        "answer_text": "B: 将药物混悬于植物油中制成油溶液型注射剂\nC: 将药物包裹于疏水性溶蚀性骨架中，制成适宜剂型\nD: 将药物包裹于亲水性胶体骨架中，制成适宜剂型"
    },
    "3-114": {
        "text": "常见的膜控释制剂有。",
        "options": {
            "A": "胃内漂浮片",
            "B": "眼用控释膜",
            "C": "微孔膜包衣",
            "D": "皮肤用控释制剂",
            "E": "骨架片"
        },
        "answer": "ABD",
        "answer_text": "A: 胃内漂浮片\nB: 眼用控释膜\nD: 皮肤用控释制剂"
    },
    "3-115": {
        "text": "以减少扩散速率为主要原理的缓(控)释制剂的制备工艺有：",
        "options": {
            "A": "制成包衣小丸或包衣片剂",
            "B": "控制粒子的大小",
            "C": "将药物与高分子化合物制成难溶性盐",
            "D": "增加制剂的黏度以减少扩散速率",
            "E": "制成乳剂"
        },
        "answer": "CDE",
        "answer_text": "C: 将药物与高分子化合物制成难溶性盐\nD: 增加制剂的黏度以减少扩散速率\nE: 制成乳剂"
    },
    "3-116": {
        "text": "不适于制备缓．控释制剂的药物有。",
        "options": {
            "A": "口服后吸收不完全或吸收无规律的药物",
            "B": "生物半衰期过短（t1/2 < 1小时）且剂量大的药物",
            "C": "生物半衰期很长的药物（t1/2 > 2.4小时）",
            "D": "剂量需要精密调节的药物",
            "E": "药效剧烈的药物"
        },
        "answer": "ABCE",
        "answer_text": "A: 口服后吸收不完全或吸收无规律的药物\nB: 生物半衰期过短（t1/2 < 1小时）且剂量大的药物\nC: 生物半衰期很长的药物（t1/2 > 2.4小时）\nE: 药效剧烈的药物"
    },
    "3-117": {
        "text": "是微囊化的优点。",
        "options": {
            "A": "延长药效",
            "B": "降低毒副作用",
            "C": "增加药物稳定性",
            "D": "掩盖不良嗅味",
            "E": "改善药物的流动性和可压性"
        },
        "answer": "ABCD",
        "answer_text": "A: 延长药效\nB: 降低毒副作用\nC: 增加药物稳定性\nD: 掩盖不良嗅味"
    },
    "3-118": {
        "text": "微囊中药物通过机理释放。",
        "options": {
            "A": "扩散",
            "B": "溶解",
            "C": "降解",
            "D": "崩解",
            "E": "均不是"
        },
        "answer": "ABC",
        "answer_text": "A: 扩散\nB: 溶解\nC: 降解"
    },
    "3-119": {
        "text": "以下属于缓释制剂的是。",
        "options": {
            "A": "膜控释小片",
            "B": "渗透泵片",
            "C": "微球",
            "D": "骨架型缓控释片",
            "E": "脂质体"
        },
        "answer": "BC",
        "answer_text": "B: 渗透泵片\nC: 微球"
    },
    "3-120": {
        "text": "脂质体的靶向性有。",
        "options": {
            "A": "被动靶向性",
            "B": "物理靶向性",
            "C": "化学靶向性",
            "D": "主动靶向性",
            "E": "天然靶向性"
        },
        "answer": "AD",
        "answer_text": "A: 被动靶向性\nD: 主动靶向性"
    },
    "3-121": {
        "text": "以下属于物理化学靶向的制剂为：",
        "options": {
            "A": "栓塞靶向制剂",
            "B": "热敏靶向制剂",
            "C": "pH敏感靶向制剂",
            "D": "磁性靶向制剂",
            "E": "前体药"
        },
        "answer": "ABCD",
        "answer_text": "A: 栓塞靶向制剂\nB: 热敏靶向制剂\nC: pH敏感靶向制剂\nD: 磁性靶向制剂"
    },
    "3-122": {
        "text": "测定脂质体的形态、粒径和粒度分布情况的方法有：",
        "options": {
            "A": "光学显微镜法",
            "B": "电子显微镜法",
            "C": "CoultEr计算法",
            "D": "激光散射法",
            "E": "离心沉淀法"
        },
        "answer": "AB",
        "answer_text": "A: 光学显微镜法\nB: 电子显微镜法"
    },
    "3-123": {
        "text": "可用液中干燥法制备的制剂是：",
        "options": {
            "A": "脂质体",
            "B": "固体分散体",
            "C": "微型胶囊",
            "D": "微球",
            "E": "纳米囊"
        },
        "answer": "CD",
        "answer_text": "C: 微型胶囊\nD: 微球"
    },
    "3-124": {
        "text": "单相脂质体的制法有：",
        "options": {
            "A": "冷冻干燥法",
            "B": "熔融法",
            "C": "薄膜分散法",
            "D": "注入法",
            "E": "超声分散法"
        },
        "answer": "CE",
        "answer_text": "C: 薄膜分散法\nE: 超声分散法"
    },
    "3-125": {
        "text": "靶向给药乳剂中，O/W乳剂静脉给药后指向的靶点主要是",
        "options": {
            "A": "心脏",
            "B": "炎症部位",
            "C": "肾",
            "D": "肝",
            "E": "脾"
        },
        "answer": "AC",
        "answer_text": "A: 心脏\nC: 肾"
    },
    "3-126": {
        "text": "不是靶向制剂的是",
        "options": {
            "A": "静脉乳剂",
            "B": "毫微粒注射剂",
            "C": "混悬型注射剂",
            "D": "脂质体注射剂",
            "E": "口服乳剂"
        },
        "answer": "BCE",
        "answer_text": "B: 毫微粒注射剂\nC: 混悬型注射剂\nE: 口服乳剂"
    },
    "3-127": {
        "text": "透皮给药系统常由组成。",
        "options": {
            "A": "裱背层",
            "B": "药物贮库",
            "C": "控释膜",
            "D": "粘附层",
            "E": "保护膜"
        },
        "answer": "ACDE",
        "answer_text": "A: 裱背层\nC: 控释膜\nD: 粘附层\nE: 保护膜"
    },
    "3-128": {
        "text": "用作透皮吸收促进剂的有",
        "options": {
            "A": "液体石蜡",
            "B": "二甲基亚砜",
            "C": "硬脂酸",
            "D": "山梨酸",
            "E": "月桂氮卓酮"
        },
        "answer": "BE",
        "answer_text": "B: 二甲基亚砜\nE: 月桂氮卓酮"
    },
    "3-129": {
        "text": "影响透皮吸收的因素是：",
        "options": {
            "A": "药物的分子量",
            "B": "药物的低共熔点",
            "C": "皮肤的水合作用",
            "D": "药物晶型",
            "E": "透皮吸收促进剂"
        },
        "answer": "ACE",
        "answer_text": "A: 药物的分子量\nC: 皮肤的水合作用\nE: 透皮吸收促进剂"
    },
    "3-130": {
        "text": "TDDS的制备方法有",
        "options": {
            "A": "骨架黏合工艺",
            "B": "超声分散工艺",
            "C": "逆相蒸发工艺",
            "D": "涂膜复合工艺",
            "E": "充填热合工艺"
        },
        "answer": "ADE",
        "answer_text": "A: 骨架黏合工艺\nD: 涂膜复合工艺\nE: 充填热合工艺"
    },
    "3-131": {
        "text": "可以在经皮给药系统中作为渗透促进剂的是",
        "options": {
            "A": "月桂氮酮",
            "B": "聚乙二醇200",
            "C": "二甲基亚砜",
            "D": "薄荷醇",
            "E": "尿素"
        },
        "answer": "ACDE",
        "answer_text": "A: 月桂氮酮\nC: 二甲基亚砜\nD: 薄荷醇\nE: 尿素"
    },
    "3-132": {
        "text": "经皮吸收制剂中常用的压敏胶有",
        "options": {
            "A": "乙烯酸类",
            "B": "聚硅氧烷类",
            "C": "水凝胶类",
            "D": "聚异丁烯类",
            "E": "聚丙烯酸类"
        },
        "answer": "BDE",
        "answer_text": "B: 聚硅氧烷类\nD: 聚异丁烯类\nE: 聚丙烯酸类"
    },
    "3-133": {
        "text": "关于经皮给药系统的质量控制，正确的为",
        "options": {
            "A": "经皮吸收制剂的生物利用度应与口服制剂接近",
            "B": "经皮吸收制剂可不进行药物含量检查",
            "C": "经皮吸收制剂需进行体外释放度测定",
            "D": "一般情况下，经皮吸收制剂中药物的释放速率应小于药物的透皮速率",
            "E": "经皮吸收制剂应进行黏合性能的检查"
        },
        "answer": "CDE",
        "answer_text": "C: 经皮吸收制剂需进行体外释放度测定\nD: 一般情况下，经皮吸收制剂中药物的释放速率应小于药物的透皮速率\nE:经皮吸收制剂应进行黏合性能的检查"
    },
    "4-1": {
        "text": "为什么原料药物都要制备成适宜的制剂才能应用于临床？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "原料药物需要制备成适宜的制剂才能应用于临床，主要是为了提高药物的生物利用度、稳定性，适应不同的给药途径，并方便患者使用。这样可以确保药物在临床中的效果和安全性。"
    },
    "4-2": {
        "text": "研究药物制剂稳定性有何重要意义？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "1.保障药物疗效，2.延长药物有效期，3.提高制剂质量和一致性，4.保证患者安全性，5.优化药物给药途径"
    },
    "4-3": {
        "text": "药物制剂稳定性加速实验方法包括哪几方面？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "药物制剂稳定性加速实验方法包括温度、湿度、光照、氧化和pH应力法。"
    },
    "4-4": {
        "text": "问欲配制100gHLB为6.8的乳化剂,需聚山梨酯80(HLB值15.0)和司盘65(HLB值2．1)各多少?",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "聚山梨酯80的重量 = （6.8 - 2.1）/ （15.0 - 2.1） × 100g ≈ 52.98g\n 司盘65的重量 = 100g - 52.98g ≈ 47.02g\n 因此，配制100gHLB为6.8的乳化剂，需要约52.98g聚山梨酯80和约47.02g司盘65。"
    },
    "4-5": {
        "text": "试举例说明表面活性剂在药剂中的应用。",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "表面活性剂在药剂中的应用包括：1.胶囊和片剂涂层,2.乳剂和悬浮剂,3.眼药水和眼药膏,4.皮肤药物传递系统,5.注射剂和静脉输液,6.鼻腔喷雾剂. 这些应用涵盖了表面活性剂在药剂中的常见使用领域。"
    },
    "4-6": {
        "text": "常用的物理灭菌法有哪几种？分别简述其特点与适用范围。",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "常用的物理灭菌法有热灭菌、干热灭菌、紫外线灭菌和过滤灭菌。1.热灭菌：使用高温高压蒸汽进行灭菌，适用范围广，但不适用于热敏感物质。2.干热灭菌：利用高温热空气或火焰进行灭菌，适用于热敏感物质，但需要较长时间和高温。3.紫外线灭菌：利用紫外线照射进行表面灭菌，适用于小区域的表面灭菌。4.过滤灭菌：通过过滤器将微生物过滤掉，适用于液体制剂和热敏感物质的灭菌。选择合适的物理灭菌法取决于具体的药物制剂和灭菌要求。"
    },
    "4-7": {
        "text": "影响湿热灭菌的因素有哪些？热压灭菌法适用何种蒸汽效果最好？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "影响湿热灭菌的因素包括以下几个方面：\
        1.温度：灭菌温度越高，杀菌效果越好。\
        2.湿度：足够的湿度有助于蒸汽渗透和热传导，提高灭菌效果。\
        3.时间：灭菌时间越长，足够的热量可以传递到微生物的各个部位，增加灭菌效果。4.压力：增加压力可以提高水的沸点，使得灭菌温度升高，进而提高灭菌效果。\
        对于热压灭菌法，适用于湿热灭菌，使用饱和蒸汽进行灭菌。在热压灭菌法中，当蒸汽饱和度达到100%时，蒸汽的温度最高，热传导能力最好，因此蒸汽饱和度为100%的情况下，蒸汽效果最好。"
    },
    "4-8": {
        "text": "测定空气中浮沉浓度和粒子大小的常用方法有哪些？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "常用的测定空气中浮沉浓度和粒子大小的方法有：\n 1.空气采样与显微镜观察\n 2.气溶胶质量浓度测定\n 3.气溶胶计数器\n 4.颗粒物沉积采样\n5.粒径分析仪\n 这些方法可用于测定空气中的颗粒物浓度和粒子大小。"
    },
    "4-9": {
        "text": "防止药物混合不均的措施有哪些？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "防止药物混合不均的措施包括：1.充分搅拌或搅拌时间延长 2.使用适当的溶剂或介质 3.使用合适的混合设备和工艺条件4.采用预混合方法 5.调整pH值或温度以促进混合 6.使用表面活性剂或分散剂帮助混合 7.采用适当的容器和包装材料 8.进行质量控制和检测，如颗粒大小分析等. 这些措施有助于确保药物混合均匀，并提高制剂的质量和稳定性。"
    },
    "4-10": {
        "text": "1．处方分析与工艺设计 \n处方 \n鱼肝油           500ml \n阿拉伯胶(细粉)    125g \n西黄耆胶(细粉)    1．7g \n 杏仁油  lml \n糖精钠    0．1g \n 尼泊金乙酯        0．05g \n 纯化水加          1000ml \n 回答下列问题：(1)写出本制剂的名称及按分散系统分类应属于哪一类型液体制剂? \n(2)分析处方中主要成分的作用。 \n (3)请写出用干胶法制备本品的制备工艺。",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "(1) 名称：鱼肝油乳剂，属于油包水型液体制剂。\n (2) 主要成分作用：鱼肝油为活性成分，滋养和保护皮肤；阿拉伯胶和西黄耆胶为分散剂，稳定和分散鱼肝油颗粒；杏仁油为溶剂，提供流动性和稳定性；糖精钠为甜味剂，改善口感；尼泊金乙酯为防腐剂，延长保质期。\n (3) 干胶法制备工艺：混合阿拉伯胶和西黄耆胶细粉，加入部分杏仁油制成胶体溶液，逐渐加入鱼肝油并搅拌均匀，加入糖精钠和尼泊金乙酯溶于杏仁油后加入制剂中，继续搅拌并逐渐加入纯化水，控制温度和搅拌速度形成稳定的乳状液，过滤或离心得到最终的鱼肝油乳剂。"
    },
    "4-11": {
        "text": "简述颗粒剂的质量要求和检查项目。",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "颗粒剂的质量要求涉及外观、粒度、药物含量、含水量和稳定性，而检查项目包括外观观察、粒度分布分析、药物含量测定、含水量测定和稳定性测试。"
    },
    "4-12": {
        "text": "简述硬胶囊剂的质量要求和检查项目。",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "硬胶囊剂的质量要求包括外观、胶囊壳的密闭性、药物含量一致性、胶囊壳的溶解性和包装完整性。而检查项目包括外观观察、胶囊壳密闭性测试、药物含量一致性检测、胶囊壳溶解性评估和包装完整性检查。"
    },
    "4-13": {
        "text": "哪些性质的药物不能制成胶囊剂？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "不能制成胶囊剂的药物包括溶解性差、挥发性、湿敏性、刺激性和高热不稳定性的药物。"
    },
    "4-14": {
        "text": "复方乙酰水杨酸片 处方： 乙酰水杨酸          268g; 对乙酰氨基酚       136g; 咖啡因             33.4g; 淀粉               266g; 淀粉浆              适量(17%); 滑石粉             15g; 轻质液状石蜡        0.25g; 共制                 1000片; 试分析 三种主药为何采用分别制粒的方法 本处方中何种辅料为润滑剂,能否用硬脂酸镁为润滑剂,为什么? 本处方中淀粉,淀粉浆分别起何作用.",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "1. 三种主药采用分别制粒的方法是为了保证均匀分布和稳定性。2.本处方中滑石粉为润滑剂，不可用硬脂酸镁。硬脂酸镁吸湿，影响制剂质量。3.淀粉起粘合剂作用，淀粉浆作为湿法制粒的粘合剂。"
    },
    "4-15": {
        "text": "分析下列软膏基质的处方并写出制备方法。处方： 硬脂醇           250g; 白凡士林         250g; 十二烷基硫酸钠   10g; 丙二醇           120g; 尼泊金甲酯        0.25g; 尼泊金丙酯        0.15g; 蒸馏水    加至     1000g",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "软膏基质处方分析：1.硬脂醇和白凡士林：基础油脂，提供基础结构和稳定性。2.十二烷基硫酸钠：离子型表面活性剂，增强渗透性和吸收性。3.丙二醇：增稠剂，增加黏稠度。4.尼泊金甲酯和尼泊金丙酯：防腐剂，防止微生物污染。制备方法：熔融硬脂醇和白凡士林，加入十二烷基硫酸钠，搅拌均匀。加入丙二醇，溶解后加入尼泊金甲酯和尼泊金丙酯。最后慢慢加入蒸馏水，搅拌均匀，冷却并灌装。"
    },
    "4-16": {
        "text": "气雾剂的制备工艺流程如何？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "1.准备药物成分。2.溶解或悬浮药物成分。3.添加推进剂。4.添加稳定剂。5.充填压力罐。6.封闭压力罐。7.注入推进剂。8.充填嘴口盖。9.检查和包装。"
    },
    "4-17": {
        "text": "分析处方中各成分的作用: 处方盐酸异丙肾上腺素       2.5g; 维生素C                1.0g; 乙醇                    296.5g; 二氯二氟甲烷             适量; 共制                      1000g",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "盐酸异丙肾上腺素：收缩血管、提高心肌收缩力，治疗心血管疾病。 维生素C：抗氧化、促进免疫系统功能，补充维生素C缺乏。 乙醇：溶剂，溶解和稀释药物成分。 二氯二氟甲烷：推进剂或溶剂，增加喷射能力或改变药物的物理性质。 整体处方用于制备药物溶液，含有药物成分和辅助溶剂和推进剂。"
    },
    "4-18": {
        "text": "眼用制剂有哪些种类？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "眼用制剂的种类包括眼药水（眼滴）、眼膏（眼药膏）、眼膜（眼药膜）、眼乳（眼液乳剂）和眼胶（眼药胶）。"
    },
    "4-19": {
        "text": "滴眼液中药物吸收进入眼睛的主要途径有哪些？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "药物进入眼睛的主要途径包括角膜透过、结膜透过、巩膜下注射、眼附属器穿透和泪液排泄。"
    },
    "4-20": {
        "text": "眼用新制剂有哪些？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "眼用制剂的种类包括眼药水（眼滴）、眼膏（眼药膏）、眼膜（眼药膜）、眼乳（眼液乳剂）和眼胶（眼药胶）。"
    },
    "4-21": {
        "text": "眼用新制剂有哪些？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "眼用新制剂包括纳米眼药物载体、渗透增强眼药物、水凝胶眼药物、眼用纳米乳剂、角膜贴片和眼用微针阵列。"
    },
    "4-22": {
        "text": "什么是缓释制剂、控释制剂？有何异同？与普通制剂相比有何特点？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "缓释制剂和控释制剂是延长药物作用时间和维持稳定血药浓度的药物制剂。它们的主要区别在于对药物释放速率的控制程度。缓释制剂通过延缓药物释放速度实现长效疗效，而控释制剂能够精确控制药物的释放速率，符合特定的释放规律。与普通制剂相比，缓释制剂和控释制剂能延长疗效时间、维持稳定血药浓度、减少药物浪费，并支持个体化治疗。"
    },
    "4-23": {
        "text": "制备缓控释制剂的药物应符合什么条件？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "制备缓控释制剂的药物应符合以下条件：1.疗效持久性。2.稳定性。3.可控释放。4.生物相容性。5.药物释放机制。6.适宜的给药途径。7.可制备性。"
    },
    "4-24": {
        "text": "缓、控释制剂的组成？设计原理是什么？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "缓控释制剂的组成包括药物成分、缓释基质/载体和辅助成分。设计原理是通过控制药物的释放速率来实现长效疗效，常见的设计原理包括扩散控制、溶解控制、反应控制和组合控制。选择合适的载体和制剂技术，调节药物与载体的相互作用，以实现药物在体内持久稳定地释放。"
    },
    "4-25": {
        "text": "什么是经皮吸收制剂？应用特点？由哪几部分组成？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "经皮吸收制剂是通过皮肤吸收药物的制剂。应用特点包括非侵入性、持续性和避免首过效应。由药物成分、渗透增强剂和透皮给药系统组成。"
    },
    "4-26": {
        "text": "经皮吸收过程怎样？影响吸收的因素有哪些？常用的透皮吸收促进剂有哪些？",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "经皮吸收是药物通过皮肤进入体内的过程，包括渗透、吸收和分布。影响吸收的因素有皮肤特性、药物特性和透皮给药系统。常用的透皮吸收促进剂包括合成渗透增强剂、天然渗透增强剂、离子型渗透增强剂和载体系统。"
    },
    "4-27": {
        "text": "试述膜控释型TDDS的基本结构",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": "",
            "E": ""
        },
        "answer": "请看",
        "answer_text": "膜控释型TDDS的基本结构包括药物层、膜控释层、支撑层和粘合剂。药物层含有药物成分，膜控释层控制药物的释放速率，支撑层提供结构支持，粘合剂固定系统在皮肤上。"
    },
    "5-1": {
        "text": "吐温类",
        "options": {
            "A": "增溶剂",
            "B": "乳化剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "C",
        "answer_text": "C: 两者均是"
    },
    "5-2": {
        "text": "司盘类",
        "options": {
            "A": "增溶剂",
            "B": "乳化剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "C",
        "answer_text": "C: 两者均是"
    },
    "5-3": {
        "text": "苯甲酸钠",
        "options": {
            "A": "增溶剂",
            "B": "乳化剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "D",
        "answer_text": "D: 两者均不是"
    },
    "5-4": {
        "text": "尿素",
        "options": {
            "A": "增溶剂",
            "B": "乳化剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "D",
        "answer_text": "D: 两者均不是"
    },
    "5-5": {
        "text": "聚氧乙烯蓖麻油",
        "options": {
            "A": "增溶剂",
            "B": "乳化剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "B",
        "answer_text": "B: 乳化剂"
    },
    "5-6": {
        "text": "阿拉伯胶",
        "options": {
            "A": "乳化剂",
            "B": "助悬剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "C",
        "answer_text": "C: 两者均是"
    },
    "5-7": {
        "text": "吐温-80",
        "options": {
            "A": "乳化剂",
            "B": "助悬剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "A",
        "answer_text": "A: 乳化剂"
    },
    "5-8": {
        "text": "磷脂",
        "options": {
            "A": "乳化剂",
            "B": "助悬剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "A",
        "answer_text": "A: 乳化剂"
    },
    "5-9": {
        "text": "单糖浆",
        "options": {
            "A": "乳化剂",
            "B": "助悬剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "B",
        "answer_text": "B: 助悬剂"
    },
    "5-10": {
        "text": "亚硫酸氢钠",
        "options": {
            "A": "乳化剂",
            "B": "助悬剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "D",
        "answer_text": "D: 两者均不是"
    },
    "5-11": {
        "text": "肥皂",
        "options": {
            "A": "阴离子",
            "B": "阳离子",
            "C": "两者均有",
            "D": "两者均无"
        },
        "answer": "C",
        "answer_text": "C: 两者均有"
    },
    "5-12": {
        "text": "二辛基琥珀酸酯碘酸钠",
        "options": {
            "A": "阴离子",
            "B": "阳离子",
            "C": "两者均有",
            "D": "两者均无"
        },
        "answer": "C",
        "answer_text": "C: 两者均有"
    },
    "5-13": {
        "text": "溴苄烷铵",
        "options": {
            "A": "阴离子",
            "B": "阳离子",
            "C": "两者均有",
            "D": "两者均无"
        },
        "answer": "C",
        "answer_text": "C: 两者均有"
    },
    "5-14": {
        "text": "磷脂酰胆碱(卵磷脂)",
        "options": {
            "A": "阴离子",
            "B": "阳离子",
            "C": "两者均有",
            "D": "两者均无"
        },
        "answer": "D",
        "answer_text": "D: 两者均无"
    },
    "5-15": {
        "text": "单硬脂酸甘油酯",
        "options": {
            "A": "阴离子",
            "B": "阳离子",
            "C": "两者均有",
            "D": "两者均无"
        },
        "answer": "C",
        "answer_text": "C: 两者均有"
    },
    "5-16": {
        "text": "糖浆剂",
        "options": {
            "A": "混悬液",
            "B": "乳浊液",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "D",
        "answer_text": "D: 两者均不是"
    },
    "5-17": {
        "text": "大黄流浸膏",
        "options": {
            "A": "混悬液",
            "B": "乳浊液",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "D",
        "answer_text": "D: 两者均不是"
    },
    "5-18": {
        "text": "炉甘石乳",
        "options": {
            "A": "混悬液",
            "B": "乳浊液",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "B",
        "answer_text": "B: 乳浊液"
    },
    "5-19": {
        "text": "氢醌乳膏",
        "options": {
            "A": "混悬液",
            "B": "乳浊液",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "D",
        "answer_text": "D: 两者均不是"
    },
    "5-20": {
        "text": "炉甘石洗剂",
        "options": {
            "A": "混悬液",
            "B": "乳浊液",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "A",
        "answer_text": "A: 混悬液"
    },
    "5-21": {
        "text": "必须经胃肠道才能吸收",
        "options": {
            "A": "片剂",
            "B": "胶囊剂",
            "C": "以上均属于",
            "D": "以上均不属于"
        },
        "answer": "D",
        "answer_text": "D: 以上均不属于"
    },
    "5-22": {
        "text": "无须蹦解成颗粒，吸收快",
        "options": {
            "A": "片剂",
            "B": "胶囊剂",
            "C": "以上均属于",
            "D": "以上均不属于"
        },
        "answer": "B",
        "answer_text": "B: 胶囊剂"
    },
    "5-23": {
        "text": "在制备过程中需加粘合剂",
        "options": {
            "A": "片剂",
            "B": "胶囊剂",
            "C": "以上均属于",
            "D": "以上均不属于"
        },
        "answer": "A",
        "answer_text": "A: 片剂"
    },
    "5-24": {
        "text": "质检中需检查溶出度",
        "options": {
            "A": "片剂",
            "B": "胶囊剂",
            "C": "以上均属于",
            "D": "以上均不属于"
        },
        "answer": "C",
        "answer_text": "C: 以上均属于"
    },
    "5-25": {
        "text": "制作肠溶制剂时，需采用甲醛浸渍法处理",
        "options": {
            "A": "片剂",
            "B": "胶囊剂",
            "C": "以上均属于",
            "D": "以上均不属于"
        },
        "answer": "B",
        "answer_text": "B: 胶囊剂"
    },
    "5-26": {
        "text": "健胃散",
        "options": {
            "A": "撒布剂",
            "B": "局部用散剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "D",
        "answer_text": "D: 两者均不是"
    },
    "5-27": {
        "text": "复方十一烯酸锌撒布剂",
        "options": {
            "A": "撒布剂",
            "B": "局部用散剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "C",
        "answer_text": "C: 两者均是"
    },
    "5-28": {
        "text": "痱子粉",
        "options": {
            "A": "撒布剂",
            "B": "局部用散剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "C",
        "answer_text": "C: 两者均是"
    },
    "5-29": {
        "text": "冰硼散",
        "options": {
            "A": "撒布剂",
            "B": "局部用散剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "B",
        "answer_text": "B: 局部用散剂"
    },
    "5-30": {
        "text": "紫雪散",
        "options": {
            "A": "撒布剂",
            "B": "局部用散剂",
            "C": "两者均是",
            "D": "两者均不是"
        },
        "answer": "D",
        "answer_text": "D: 两者均不是"
    },
    "5-38": {
        "text": "淀粉",
        "options": {
            "A": "崩解剂",
            "B": "填充剂",
            "C": "以上两者均可",
            "D": "以上两者均不可"
        },
        "answer": "C",
        "answer_text": "C: 以上两者均可"
    },
    "5-39": {
        "text": "糊精",
        "options": {
            "A": "崩解剂",
            "B": "填充剂",
            "C": "以上两者均可",
            "D": "以上两者均不可"
        },
        "answer": "B",
        "answer_text": "B: 填充剂"
    },
    "5-40": {
        "text": "微粉硅胶",
        "options": {
            "A": "崩解剂",
            "B": "填充剂",
            "C": "以上两者均可",
            "D": "以上两者均不可"
        },
        "answer": "D",
        "answer_text": "D: 以上两者均不可"
    },
    "5-41": {
        "text": "微晶纤维素",
        "options": {
            "A": "崩解剂",
            "B": "填充剂",
            "C": "以上两者均可",
            "D": "以上两者均不可"
        },
        "answer": "C",
        "answer_text": "C: 以上两者均可"
    },
    "5-42": {
        "text": "羧甲基淀粉",
        "options": {
            "A": "崩解剂",
            "B": "填充剂",
            "C": "以上两者均可",
            "D": "以上两者均不可"
        },
        "answer": "A",
        "answer_text": "A: 崩解剂"
    },
    "5-43": {
        "text": "混合脂肪酸甘油酯",
        "options": {
            "A": "软膏基质",
            "B": "栓剂基质",
            "C": "以上两者均可",
            "D": "以上两者均不可"
        },
        "answer": "C",
        "answer_text": "C: 以上两者均可"
    },
    "5-44": {
        "text": "甘油明胶",
        "options": {
            "A": "软膏基质",
            "B": "栓剂基质",
            "C": "以上两者均可",
            "D": "以上两者均不可"
        },
        "answer": "C",
        "answer_text": "C: 以上两者均可"
    },
    "5-45": {
        "text": "羊毛脂",
        "options": {
            "A": "软膏基质",
            "B": "栓剂基质",
            "C": "以上两者均可",
            "D": "以上两者均不可"
        },
        "answer": "C",
        "answer_text": "C: 以上两者均可"
    },
    "5-46": {
        "text": "聚乙二醇",
        "options": {
            "A": "软膏基质",
            "B": "栓剂基质",
            "C": "以上两者均可",
            "D": "以上两者均不可"
        },
        "answer": "C",
        "answer_text": "C: 以上两者均可"
    },
    "5-47": {
        "text": "醋酸纤维素",
        "options": {
            "A": "软膏基质",
            "B": "栓剂基质",
            "C": "以上两者均可",
            "D": "以上两者均不可"
        },
        "answer": "D",
        "answer_text": "D: 以上两者均不可"
    },
    "5-48": {
        "text": "混悬型软膏",
        "options": {
            "A": "粒度测定",
            "B": "微生物限度检查",
            "C": "以上两项均做",
            "D": "以上两项均不做"
        },
        "answer": "C",
        "answer_text": "C: 以上两项均做"
    },
    "5-49": {
        "text": "严重创伤的凝胶剂",
        "options": {
            "A": "粒度测定",
            "B": "微生物限度检查",
            "C": "以上两项均做",
            "D": "以上两项均不做"
        },
        "answer": "B",
        "answer_text": "B: 微生物限度检查"
    },
    "5-50": {
        "text": "溶液型软膏",
        "options": {
            "A": "粒度测定",
            "B": "微生物限度检查",
            "C": "以上两项均做",
            "D": "以上两项均不做"
        },
        "answer": "B",
        "answer_text": "B: 微生物限度检查"
    },
    "5-51": {
        "text": "阴道栓",
        "options": {
            "A": "粒度测定",
            "B": "微生物限度检查",
            "C": "以上两项均做",
            "D": "以上两项均不做"
        },
        "answer": "B",
        "answer_text": "B: 微生物限度检查"
    },
    "5-52": {
        "text": "鼻用混悬型软膏",
        "options": {
            "A": "粒度测定",
            "B": "微生物限度检查",
            "C": "以上两项均做",
            "D": "以上两项均不做"
        },
        "answer": "C",
        "answer_text": "C: 以上两项均做"
    }
}

def display_questions(start, end):
    st.title('药剂学试卷展示')
    st.header('选择题')
    st.subheader('[A型题]')

    for question_id, question in questions.items():
        if start <= int(question_id) <= end:
            st.write(f'{question_id}. {question["text"]}')
            for option_key, option_value in question['options'].items():
                st.write(f'{option_key}. {option_value}')
            st.write('---')

def display_question(question_number, question_data):
    st.subheader(f"题目 {question_number}:")
    st.write(question_data['text'])

def search_question(keyword):
    results = []
    for question_number, question_data in questions.items():
        if keyword in question_data['text']:
            results.append(question_number)
    return results

def main():
    st.title("药剂学试卷展示应用")
    # display_questions(1,7)
    # 搜索框
    search_keyword = st.text_input('输入关键字搜索题目：')

    # 搜索按钮
    search_button = st.button('搜索')

    if search_button:
        # 执行搜索
        search_results = search_question(search_keyword)

        # 显示搜索结果
        if search_results:
            st.markdown('### 搜索结果：')
            for question_num in search_results:
                # Retrieve question data based on the question number
                question_data = questions.get(str(question_num))
                # Display the question and options
                if question_data:
                    st.markdown(f"**{question_num}.{question_data['text']}**")
                    for option, text in question_data['options'].items():
                        st.markdown(f'- {option}. {text}')
                    st.markdown(f'答案：{question_data["answer"]}  <span style="background-color: yellow;">{question_data["answer_text"]}</span>', unsafe_allow_html=True)
                    st.markdown('---')
                else:
                    st.error("Question not found!")
        else:
            st.markdown('### 搜索结果：无匹配题目')

    # 显示所有题目
    # st.markdown('### 所有题目：')
    # for question_num, question_data in questions.items():
    #     st.markdown(f'**题目 {question_num}:** {question_data["text"]}')
    #     for option, text in question_data['options'].items():
    #         st.markdown(f'- {option}. {text}')
    #     st.markdown('---')


if __name__ == '__main__':
    main()
