# -*- UTF-8-*- 
# Author : David Vane
# -*- coding: utf-8 -*-
import streamlit as st

questions = {
    "1-1": {
        "text": "药物代谢动力学",
        "options": {},
        "answer": "",
        "answer_text": "药物动力学：应用动力学原理与数学处理方法，定量地描述通过各种给药途径进入体内的药物的吸收、分布、代谢、排泄过程，揭示药物的“量时”变化或“血药浓度经时”变化动态规律的一门科学。"
    },

    "1-2": {
        "text": "隔室模型",
        "options": {},
        "answer": "",
        "answer_text": "隔室模型：将机体视为一个系统，系统内部按动力学特点分为若干室，只要体内某些部位接受药物及消除药物的速率常数相似，不管这些部位的解剖位置与生理功能如何，都可归纳为一个隔室。隔室模型中的隔室不是解剖学上分隔体液的隔室，而是按药物分布速度以数学方法划分的。"
    },
    "1-3": {
        "text": "单室模型",
        "options": {},
        "answer": "",
        "answer_text": "单室模型：给药后药物迅速分布，瞬间达到分布平衡，此时整个机体可视为一个隔室，并且药物在体内以线性速度进行消除，这种药动学模型称为单室模型。"
    },
    "1-4": {
        "text": "外周室",
        "options": {},
        "answer": "",
        "answer_text": "外周室：在经典药动学研究中，根据药物分布达到平衡的快慢和器官、组织血流量大小，将血流不丰富、药物达到分布平衡需要一定时间的器官、组织归为虚拟的隔室，即外周室。外周室与中央室的划分具有相对性和模糊性。"
    },
    "1-5": {
        "text": "吸收",
        "options": {},
        "answer": "",
        "answer_text": "吸收：药物从给药部位进入血液循环的过程。"
    },
    "1-6": {
        "text": "肠肝循环",
        "options": {},
        "answer": "",
        "answer_text": "肠肝循环：药物及其代谢产物经胆汁排泄入肠道，在肠腔内又被重吸收入血，形成肝肠循环，使药物作用时间延长。"
    },
    "1-7": {
        "text": "肝首过效应",
        "options": {},
        "answer": "",
        "answer_text": "肝首过效应：（首关消除）一些药物在经过肠黏膜或肝脏时，被该处酶代谢灭活，使进入体循环的药量减少，药效降低。"
    },
    "1-8": {
        "text": "主动转运",
        "options": {},
        "answer": "",
        "answer_text": "主动转运：借助载体或酶促系统的作用，药物从膜低浓度侧向高浓度侧的转运过程。"
    },
    "1-9": {
        "text": "被动转运",
        "options": {},
        "answer": "",
        "answer_text": "被动转运：指药物的生物膜转运服从浓度梯度扩散原理，即从高浓度一侧向低浓度一侧扩散的过程，分为单纯扩散与膜孔转运。"
    },
    "1-10": {
        "text": "膜孔转运",
        "options": {},
        "answer": "",
        "answer_text": "膜孔转运：指水溶性小分子药物通过胃肠道上皮细胞膜上约0.4 -0.8nm大小的微孔而被吸收的转运过程。"
    },
    "1-11": {
        "text": "药物排泄",
        "options": {},
        "answer": "",
        "answer_text": "药物排泄：指吸收进入体内的药物或经代谢后的产物排出体外的过程。"
    },
    "1-12": {
        "text": "肾小球滤过率",
        "options": {},
        "answer": "",
        "answer_text": "肾小球滤过率：单位时间内（每分钟）两肾生成的超滤液量称为肾小球滤过率。"
    },
    "1-13": {
        "text": "双峰现象",
        "options": {},
        "answer": "",
        "answer_text": "双峰现象：某些药物因肠肝循环可出现第二个血药浓度高峰，该现象称为双峰现象。"
    },
    "1-14": {
        "text": "肾小管分泌",
        "options": {},
        "answer": "",
        "answer_text": "肾小管分泌：指将药物转运至尿中排泄的过程，此过程为主动转运过程。"
    },
    "1-15": {
        "text": "二室模型",
        "options": {},
        "answer": "",
        "answer_text": "二室模型：二室模型由中央室和周边室组成，中央室一般由血流丰富的组织、器官与血流组成，如心、肝、脾、肺、肾和血浆，药物在这些组织、器官和体液中的分布较快，能够迅速达到分布平衡；而周边室一般由血流贫乏、不易进行物质交换的组织、器官和体液等构成，如肌肉、骨骼、皮下脂肪等，药物在这些组织、器官和体液中的分布较慢，需要较长的时间才能达到分布平衡。由于药物的消除主要发生往中央室，药物在中央室与周边室之间进行可逆的转运。"
    },
    "1-16": {
        "text": "三室模型",
        "options": {},
        "answer": "",
        "answer_text": "三室模型：三室模型由中央室与两个周边室组成。中央室一般为血流高灌注隔室，药物以很快的速度分布到中央室（第1室）；以较慢的速度进入浅外室（第2室），浅外室为血流灌注较差的组织或器官，又称组织隔室；以更慢的速度进入深外室（第3室），深外室为血流灌注更差的组织或器官，如骨髓、脂肪等，又称深部组织隔室，也包括那些与药物结合牢固的组织。药物消除一般也发生在中央室。"
    },
    "1-17": {
        "text": "混杂参数",
        "options": {},
        "answer": "",
        "answer_text": "混杂参数：通常将分布相混合一级速度常数α和消除相混合一级速度常数β又称为混杂参数，分别代表两个指数项即分布相和消除相的特征，由模型参数（k12, k21, k10）构成。"
    },
    "1-18": {
        "text": "稳态血药浓度",
        "options": {},
        "answer": "",
        "answer_text": "稳态血药浓度：多次重复给药，随着给药次数n的增加，血药浓度不断增加，当n充分大时，血药浓度不再升高，达到稳态水平，这时的血药浓度称为稳态血药浓度。"
    },
    "1-19": {
        "text": "平均稳态血药浓度",
        "options": {},
        "answer": "",
        "answer_text": "平均稳态血药浓度：当血药浓度达到稳态后，在一个剂量间隔时间内，血药浓度一时间曲线下面积除以给药间隔时间所得的商称为平均稳态血药浓度。"
    },
    "1-20": {
        "text": "坪幅",
        "options": {},
        "answer": "",
        "answer_text": "坪幅：重复给药达稳态时，在一个给药周期内，稳态血药浓度的波动幅度称为坪幅。"
    },
    "1-21": {
        "text": "达坪分数",
        "options": {},
        "answer": "",
        "answer_text": "达坪分数：指n次给药后的血药浓度Cn与坪浓度Css的比值。"
    },
    "1-22": {
        "text": "蓄积系数",
        "options": {},
        "answer": "",
        "answer_text": "蓄积系数：指稳态血药浓度与第一次给药后的血药浓度的比值。"
    },
    "1-23": {
        "text": "波动度",
        "options": {},
        "answer": "",
        "answer_text": "波动度：稳态最大血药浓度与稳态最小血药浓度之差与平均稳态血药浓度的比值。"
    },
    "1-24": {
        "text": "平均滞留时间（写出数学表达式）",
        "options": {},
        "answer": "latex:",
        "answer_text": "MRT = \\int_{ 0}^{+\infty}t \\times \\frac{C}{AUC}dt"
    },
    "1-25": {
        "text": "平均滞留时间的方差（写出数学表达式）",
        "options": {},
        "answer": "latex:",
        "answer_text": "\\sigma^{2} = \\int_{0}^{+\\infty}(t-\\mu)^2 \\times \\frac{C}{AUC}dt"
    },
    "1-26": {
        "text": "负荷剂量",
        "options": {},
        "answer": "",
        "answer_text": "负荷剂量：为尽快达到有效治疗的目的，通常第1次给予一个较大的剂量，使血药浓度达到有效治疗浓度，这个首次给予的较大剂量，称为负荷剂量。"
    },
    "1-27": {
        "text": "药物治疗指数",
        "options": {},
        "answer": "",
        "answer_text": "药物治疗指数：系指药物中毒或致死剂量与有效剂量的比值。"
    },
    "1-28": {
        "text": "抗菌药后效应",
        "options": {},
        "answer": "",
        "answer_text": "抗菌药后效应：系指细菌与抗菌药短暂接触，当抗菌药被清除后，细菌生长受到待续抑制的效应。"
    },
    "1-29": {
        "text": "治疗药物监测",
        "options": {},
        "answer": "",
        "answer_text": "治疗药物监测：是借助现代先进分析技术与电子计算机手段，通过对患者血液或其他体液中药物浓度检测，探讨临床用药过程中药物的吸收、分布、代谢和排泄。其目的是实现给药方案个体化，提高药物疗效，避免或减少不良反应，达到最佳治疗效果。"
    },
    "1-30": {
        "text": "生物等效性",
        "options": {},
        "answer": "",
        "answer_text": "生物等效性：是指药学等效制剂或可替换药物在相同试验条件下，给予相同剂量，其活性成分吸收程度和速度的差异无统计学意义。"
    },
    "1-31": {
        "text": "生物利用度",
        "options": {},
        "answer": "",
        "answer_text": "生物利用度：是指药物活性成分从制剂释放吸收进入全身循环的程度和速度。"
    },
    "1-32": {
        "text": "绝对生物利用度",
        "options": {},
        "answer": "",
        "answer_text": "绝对生物利用度：是药物吸收进入体循环的量与给药剂量的比值，是以静脉给药制剂（通常认为静脉给药制剂生物利用度为100%）为参比制剂获得的药物活性成分吸收进入体内循环的相对量。"
    },
    "1-33": {
        "text": "相对生物利用度",
        "options": {},
        "answer": "",
        "answer_text": "相对生物利用度：又称比较生物利用度，是以其他非静脉途径给药的制剂（如片剂和口服溶液）为参比制剂获得的药物活性成分吸收进入体循环的相对量，是同一种药物不同制剂之间比较吸收程度与速度而得到的生物利用度。"
    },
    "2-1": {
        "text": "试列举两个可以用于描述药物体内消除速度的动力学参数，并加以说明。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解：\\newline"
                       "描述药物体内消除速度的动力学参数有消除速率常数和生物半衰期。"
                       "\\newline 消除速率常数，是描述速度过程的动力学参数。药物消除速率可表示为："
                       "\\newline -\\frac{dx}{dt}=-kX^n，其中k表示消除速率常数。"
                       "\\newline 消除速率常数的大小可以定量地描述药物消除速度的快慢，"
                       "\\newline 消除速率常数越大，消除过程进行得越快。"
                       "\\newline 生物半衰期，是指药物在体内的药物量或血药浓度通过各种途径消除一半所需要的时间，"
                       "\\newline 以t1/2表示。生物半衰期是衡量一种药物从体内消除快慢的指标。"
                       "\\newline 一般来说，代谢快、排泄快的药物，其t1/2短；代谢慢，排泄慢的药物，其t1/2长。"
    },
    "2-2": {
        "text": "比较药物被动转运与主动转运的异同。",
        "options": {},
        "answer": "",
        "answer_text": "被动转运：高浓度向低浓度转运；不耗能；不需要载体\n主动转运：低浓度向高浓度转运；耗能；需要载体。"
    },
    "2-3": {
        "text": "简述生物药剂学中讨论的生理因素对口服药物吸收的影响。",
        "options": {},
        "answer": "",
        "answer_text": "口服药物的吸收在胃肠道上皮细胞进行，胃肠道生理环境的变化对吸收产生较大的影响。\n\n(1) 消化系统因素：\n- 胃肠液的成分与性质：胃液的pH呈酸性，有利于弱酸性药物的吸收；小肠较高的pH环境是弱碱性药物最佳的吸收部位。\n- 胃排空和胃排空速率：胃排空速率慢，药物在胃中停留时间延长，弱酸性药物吸收会增加，但胃排空加快，到达小肠部位所需的时间缩短，有利于药物在小肠部位吸收。\n- 肠道蠕动：可促进固体制剂进一步崩解、分散，使之与肠分泌液充分混合，增加了药物与肠表面上皮的接触面积，有利于难溶性药物的吸收。\n- 食物的影响：食物不仅能改变胃排空速率而影响吸收，还可能促进或减少药物吸收。\n- 胃肠道代谢作用的影响：药物在胃肠道发生代谢是一种首过效应，对某些药物疗效有较大影响。\n\n(2) 循环系统因素：\n- 胃肠血流速度：血流量可明显影响胃的吸收速度，但在小肠吸收中不显著。\n- 肝首过作用：肝首过效应越大，药物被代谢越多，药效会受到明显影响。\n- 淋巴循环：对大分子药物的吸收起着重要作用。\n\n(3) 疾病因素：胃酸缺乏、腹泻、甲状腺功能不足、部分或全部胃切除、肝脏疾病等均可影响药物在胃肠道的吸收。"
    },
    "2-4": {
        "text": "可采用什么给药途径避免肝首过效应？试结合各给药途径的生理特点说明其避免首过效应的原理。",
        "options": {},
        "answer": "",
        "answer_text": "通过改变给药途径可以尽量避免肝首过效应，以下是几种可以避免首过效应的给药途径及其原理：\n\n(1) 静脉和肌肉注射：静脉注射直接进入体循环，因此不存在首过效应；肌肉注射经毛细血管吸收进入体循环，不经过肝系统，因此亦不存在首过效应。\n\n(2) 口腔黏膜吸收：口腔黏膜下有大量毛细血管汇总至颈内静脉，不经肝脏而直接进入心脏，可绕过肝脏的首过作用，一般可制成口腔贴片给药。\n\n(3) 经皮吸收：药物应用到皮肤上后，首先从制剂中释放到皮肤表面，溶解的药物分配进人角质层，扩散通过角质层到达活性表皮的界面，再分配进入水性的活性表皮，继续扩散到达真皮，被毛细血管吸收进入血液循环，可避开门肝系统。\n\n(4) 经鼻给药：鼻黏膜内血管丰富，鼻黏膜渗透性高，有利于全身吸收。药物吸收后直接进入体循环，无首过效应。\n\n(5) 经肺吸收：肺泡表面积大、含有丰富的毛细血管和极小的转运距离，因此肺部给药吸收迅速，而且吸收后的药物直接进入血液循环，不受肝首过效应的影响。\n\n(6) 直肠给药：直肠给药：栓剂距肛门2cm处，可使大部分药物避开肝首过效应，给药生物利用度远高于距肛门4cm处给药。当栓剂距肛门6cm处给药时，大部分药物经直肠上静脉进入门静脉一肝脏系统。淋巴循环也有助于直肠药物吸收，经淋巴吸收的药物可避开肝脏代谢作用。"
    },
    "2-5": {
        "text": "试述影响经皮给药的影响因素。",
        "options": {},
        "answer": "",
        "answer_text": "(1)生理因素：皮肤的渗透性存在个体差异，动物种属、年龄、性别、用药部位和皮肤的状态都可能引起皮肤渗透性的差异。药物经皮渗透速率随身体部位而异，这种差异主要是由于角质层厚度及皮肤附属器密度不同引起。身体各部位皮肤渗透性大小为阴囊>耳后>腋窝区>头皮>手臂>腿部>胸部。角质层厚度也与年龄、性别等多种因素有关。老人和男性的皮肤较儿童、妇女的渗透性低。\n\n(2)剂型因素：对于经皮给药系统的候选药物，一般以剂量小、药理作用强者较为理想。角质层的结构限制了大分子药物渗透的可能性，分子量大于600的物质不能自由通过角质层。药物的熔点也能影响经皮渗透性能，低熔点的药物容易渗透通过皮肤。\n脂溶性药物，即油／水分配系数大的药物较水溶性药物或亲水性药物容易通过角质层屏障，但是脂溶性太强的药物也难以透过亲水性的活性表皮和真皮层，主要在角质层中蓄积。\n给药系统的剂型对药物的释放性能影响很大，药物从给药系统中释放越容易，则越有利于药物的经皮渗透。常用的经皮给药剂型有乳膏、凝胶、涂剂和透皮贴片等，药物从这些剂型中的释放往往有显著差异。基质对药物的亲和力不应太大，否则将使药物难以转移到皮肤中，影响药物的吸收。\n\n(3)透皮吸收促进剂：应用经皮吸收促进剂可提高药物的经皮吸收。常用的促进剂有表面活性剂类、氮酮类化合物、醇类和脂肪酸类化合物芳香精油等。"
    },
    "2-6": {
        "text": "为什么应用\"表观分布容积\"这一名词，表观分布容积有何意义？",
        "options": {},
        "answer": "",
        "answer_text": "表观分布容积是指在药物充分分布的前提下，体内全部药物按血中同样浓度溶解时所需的体液总容积。它不是药物体内分布的真实容积，而是通过实验，根据体内药量和血药浓度的比值计算得到的容积，它是真实容积在实际情况下所表现出的特征值，所以称为表观分布容积。通过表观分布容积与血药浓度可以计算体内药量，并进行相关的药物动力学计算。\n\n表观分布容积与药物的蛋白质结合及药物在组织中的分布密切相关，能反映药物在体内的分布特点。"
    },
    "2-7": {
        "text": "药物血浆蛋白结合和组织蛋白结合对表观分布容积和药物消除有何影响？",
        "options": {},
        "answer": "",
        "answer_text": "当药物主要与血浆蛋白结合时，其表观分布容积小于它们的真实分布容积；而当药物主要与血管外的组织结合时，其表观分布容积大于它们的真实分布容积。蛋白结合率高的药物，通常体内消除较慢。"
    },
    "2-8": {
        "text": "讨论药物蛋白结合率的临床意义。",
        "options": {},
        "answer": "",
        "answer_text": "药物与血浆蛋白结合，能降低药物的分布与消除速度，延长作用时间，并有减毒和保护机体的作用。若药物与血浆蛋白结合率很高，药理作用将受到显著影响。由于药理作用主要和血中游离药物浓度有关，因此血中游离药物浓度的变化是影响药效的重要因素。如一个结合率低于70%时的药物，即使结合率降低10%，体内游离药物浓度最多只增加15%，而一个结合率高达98%的药物，若结合率降低10%，则可以使游离药物浓度上升5倍，这时可引起疗效的显著改变，甚至引起毒性反应。"
    },
    "2-9": {
        "text": "为什么药物与血浆蛋白结合后，会延长仅由肾小球滤过药物的肾清除率，但不影响通过肾小球滤过和肾小管主动分泌两种途径清除药物的肾清除率？",
        "options": {},
        "answer": "",
        "answer_text": "由于只有游离型才能被肾小球滤过，因此药物与血浆蛋白结合后，会降低药物的肾小球滤过率。对于仅由肾小球滤过的药物，则导致其肾清除率延长。对于同时存在肾小球滤过和肾小管主动分泌两种途径清除的药物，由于肾小管主动分泌一般不受蛋白结合率的影响，因此其肾清除率基本不受影响。如青霉素C尽管血浆蛋白结合率很高，很少被肾小球滤过，但主要由近曲小管分泌排入小管液，只需通过一次肾血液循环就几乎完全从血浆中被清除。"
    },
    "2-10": {
        "text": "药物蛋白结合率的轻微改变（如变化率为1%），是否会显著影响作用强度？",
        "options": {},
        "answer": "",
        "answer_text": "由于作用强度主要和血中游离药物浓度有关。对于高蛋白结合率的药物，药物蛋白结合率的轻微改变，可能导致血中游离药物浓度明显变化，因而会显著影响药物作用强度。如结合率高达98%的药物，若结合率降低1%，则可以使游离药物浓度上升1.5倍，可显著影响作用强度。对于低蛋白结合率的药物，结合率的轻微改变，对血中游离药物浓度影响不明显，因此不会显著影响药物作用强度。"
    },
    "2-11": {
        "text": "药物代谢酶系主要有哪些？简述他们的作用。",
        "options": {},
        "answer": "",
        "answer_text": "药物代谢酶主要位于细胞的内质网、微粒体、胞液、溶酶体，以及核膜和胞浆膜中。药物代谢酶通常又可分为微粒体酶系和非微粒体酶系二大类。\n(l)微粒体药物代谢酶系：微粒体酶系主要存在于肝细胞或其他细胞（如小肠黏膜、肾、肾上腺皮质细胞等）的内质网的亲脂性膜上。其中最重要的一族氧化酶，被称为肝微粒体混合功能氧化酶系统或称单加氧酶。该酶系催化的氧化反应类型极为广泛，是药物体内代谢的主要途径。\n(2)非微粒体酶系：非微粒体酶在肝内和血浆、胎盘、肾、肠黏膜及其他组织中均有存在，在体内除与葡萄糖醛酸结合外的其他缩合，以及某些氧化、还原及水解（除酰胺键外）反应均为该酶系所催化。通常凡是结构类似于体内正常物质、脂溶性较小、水溶性较大的药物都由这组酶系代谢。"
    },
    "2-12": {
        "text": "简述药物代谢酶在体内的分布情况。",
        "options": {},
        "answer": "",
        "answer_text": "(1)给药途径对药物代谢的影响：同一药物由于给药途径不同可影响药物的代谢过程，从而使药理效应受到影响。给药途径和方法所产生的代谢过程的差异主要与药物代谢酶在体内的分布以及局部器官和组织的血流量有关。由于肝脏和胃肠道存在有众多的药物代谢酶，口服药物的“首过效应”明显，因此“首过效应”是导致药物体内代谢差异的主要原因。\n(2)给药剂量和剂型对药物代谢的影响：药物在体内的代谢反应大都是酶反应，因此机体对药物的代谢能力主要取决于体内各种药物代谢酶的活力和数量。通常药物代谢速度和体内药量成正比，但当体内药物量增加到一定程度，达到药物代谢酶的最大代谢能力时，代谢反应会出现饱和现象，即代谢速度达到最大，不再随剂量增加而增加。\n(3)药物的光学异构特性对药物代谢的影响：不同的光学异构体具有不同的药理活性和副作用，体内的酶及药物受体具有立体选择性，因此不同的异构体具有明显的代谢差异。\n(4)酶抑制和诱导作用对药物代谢的影响：一些药物重复应用或与其他药物合并应用后，可产生酶抑制和诱导作用，导致药物代谢发生变化。\n(5)生理因素对药物代谢的影响：影响药物代谢的生理性因素主要包括年龄、性别、种族、疾病等等。儿童和老年人对药物的代谢能力常常明显低于成年人。特别是胎儿及新生儿的药物代谢酶活性低，甚至缺乏，多数情况下不仅药效高，而且容易产生毒性。药物在老年人体内的代谢表现为速度减慢，半衰期延长，耐受性减弱。"
    },
    "2-13": {
        "text": "试从干预药物代谢过程的角度出发，举例说明高效药物制剂设计的原理。",
        "options": {},
        "answer": "",
        "answer_text": "根据药酶抑制剂的性质，可设计利用一个药物对药酶产生抑制，从而来减少或延缓另一个药物的代谢，以达到提高疗效或延长作用时间的目的。以左旋多巴为例，为了减少脱羧酶的脱羧作用，设计将脱羧酶抑制剂和左旋多巴同时应用，组成复方片剂。例如，采用的脱羧酶抑制剂甲基多巴肼和盐酸羟苄丝肼，它们可抑制小肠、肝、肾中的脱羧酶的活性，因此能抑制左旋多巴的脱羧作用。这两种脱羧酶抑制剂不能透过血脑屏障，因而不会影响脑内脱羧酶的活性。结果是既能抑制外周的左旋多巴的代谢，增加进入中枢的左旋多巴的量，又能使摄入脑内的左旋多巴顺利地转换成多巴胺，进而发挥药理作用，大大降低了左旋多巴的给药剂量。"
    },
    "2-14": {
        "text": "影响肾小球滤过的因素有哪些？",
        "options": {},
        "answer": "",
        "answer_text": "主要有如下三个因素：\n(1)肾小球滤过膜的通透性和面积：当通透性改变或面积减少时，可使滤过率下降，尿液的成分改变和尿量减少。\n(2)肾小球有效滤过压改变：当肾小球毛细血管血压显著降低（如大失血）或囊内压升高（如输尿管结石等）时，可使有效滤过压降低，滤过率下降，尿量减少。如果血浆胶体渗透压降低（血浆蛋白明显减少或静脉注射大量生理盐水），则有效滤过压升高，滤过率增多。\n(3)肾血流量：肾血流量大时，滤过率高；反之，滤过率低。\n"
    },
    "2-15": {
        "text": "静脉快速输入大量生理盐水和大量饮用清水，尿量会发生什么变化？原因是什么？",
        "options": {},
        "answer": "",
        "answer_text": "均会引起尿量增多。\n主要原因是血浆蛋白被稀释，血浆蛋白浓度降低、血浆胶体渗透压下降，从而使肾小球有效滤过压升高，肾小球滤过率升高最后导致尿量增加。\n"
    },
    "2-16": {
        "text": "大量出汗或大量失血，尿量会发生什么变化？原因是什么？",
        "options": {},
        "answer": "",
        "answer_text": "大量出汗或大量失血，都会引起尿量减少。主要原因如下：\n  (1)大量出汗时，水的丢失多于电解质的丢失，血浆晶体渗透压升高，渗透压感受器兴奋，使下丘脑视上核、室旁核神经元合成抗利尿激素增多，神经垂体释放抗利尿激素增多，远曲小管和集合管对水通透性增加，水的重吸收增加，尿量减少。\n  (2)循环血量减少时，对容量感受器（位于大静脉和左心房）的刺激减弱，感受器沿迷走神经传人冲动减少，对视上核、室旁核的抑制减弱，使神经垂体释放抗利尿激素增加，远曲小管和集合管对水的通透性增加，水的重吸收增加，尿量减少。\n"
    },
    "2-17": {
        "text": "某一药物在体内符合单室模型，生物半衰期为4h，以下各项陈述是否正确，为什么？\nA．该药物消除速率常数为0.173h-1\nB．i.v.给药，16h后87.5%的药物被消除\nC．给药0.5g消除0.375g所需要的时间是给药1.0g消除0.5g所需时间的两倍\nD．完整收集12h的尿样，可以较好地估算经尿排泄的原型药物的总量。一定时间内消除了多少药物，取决于给药剂量",
        "options": {},
        "answer": "",
        "answer_text": "A．正确，k=0.693/t1/2=0.173h-1；\nB．错误，16h为4个半衰期，在4个半衰期内，[1-(1/2)^4]x100%即93.75%的药物被消除；\nC．正确，给药0.5g消除0.375g需要2个半衰期，而给药1.0g消除0.5g需要1个半衰期；\nD．错误，12h相当于3个半衰期，仅87.5%的经尿排泄的药物被消除，较好估算尿药总量需要5个以上半衰期。\n"
    },
    "2-18": {
        "text": "静脉注射给药后二室模型药物的血药浓度随时间下降有何特点？为什么？",
        "options": {},
        "answer": "",
        "answer_text": "二室模型药物静脉注射给药后，血药浓度随时间先较快地下降，此为分布相，之后较慢地下降，此为消除相。血药浓度的对数对时间作图为由两条斜率不同的直线相交而成的二次曲线。这是因为在给药后初期药物除了向体外消除，还有向周边室的分布，所以血药浓度在分布相下降较快；而在给药后末期，药物分布基本完成，体内过程以消除为主，所以在消除相血药浓度下降较慢。"
    },
    "2-19": {
        "text": "隔室模型的确定受哪些因素的影响？如何判断？",
        "options": {},
        "answer": "",
        "answer_text": "隔室数的确定主要取决于：①给药途径；②药物的吸收速度；③采样点及采样周期的时间安排；④血药浓度测定分析方法的灵敏度等因素。模型的判别：采用以下判据综合判断：①一般先以血药浓度的对数对时间作图作初步判断，如静脉注射给药后，lgC -t图形为一直线，则可能是单室模型；如不是直线，则可能属于多室模型。②选择残差平方和(SUM)与权重残差平方和(Re)最小的模型。③选择拟合度(r2)较大的模型。④选择AIC判据较小的模型。⑤F检验，若F计算值大于F界值，则说明模型2优于模型1。"
    },
    "2-20": {
        "text": "口服给药二室模型药物的血药浓度一时间曲线的特征是什么？",
        "options": {},
        "answer": "",
        "answer_text": "血药浓度-时间曲线图分为三个时相：①吸收相，给药后药物浓度持续上升，达到峰值浓度。在这一阶段，药物吸收是主要过程；②分布相，吸收至一定程度后，以药物从中央室向周边室的分布为主要过程，药物浓度下降较快；③消除相，吸收过程基本完成，中央室与周边室的分布趋于平衡，体内过程以消除为主，药物浓度逐渐衰减。"
    },
    "2-21": {
        "text": "重复给药与单剂量给药的药物体内过程有何不同？",
        "options": {},
        "answer": "",
        "answer_text": "与单剂量给药不同的是重复给药时，由于第二次给药前体内药物尚未消除完全，所以体内药物量在重复给药后逐渐蓄积。随着不断给药，体内药物量不断增加，经过一定时间后达到稳态。稳态时，药物在体内的消除速率等于给药速率，血药浓度维持在稳态，即在一恒定范围波动。"
    },
    "2-22": {
        "text": "药物的蓄积系数是否适用于所有重复给药的药物，还是只适用于体内消除较慢的药物？",
        "options": {},
        "answer": "",
        "answer_text": "蓄积系数R是一个比值，是稳态血药浓度与第一次给药后血药浓度之比。蓄积系数不是用来衡量过量剂量的绝对值，而是用来衡量频繁给药所导致的药物蓄积。影响R的因素有消除速率常数k和给药间隔时间。对于频繁给药所引起的药物蓄积，蓄积系数R是一个很有用的指标，它可适用于任何药物，且适用于无论是否有组织结合。"
    },
    "2-23": {
        "text": "重复静脉注射给药与血管外重复给药的稳态最大血药浓度各有何特点？为什么？",
        "options": {},
        "answer": "",
        "answer_text": "对于重复静脉注射给药，达稳态时，在注射的瞬间(t=0)的血药浓度最大，即为稳态最大血药浓度；而对于血管外重复给药，达稳态时，稳态最大血药浓度并不是在给药的瞬间(t=0)达到，而是在两次给药时间内的某一点（即稳态达峰时间t_max，t=t_max）达到。这是由于血管外给药时药物有一个吸收过程，使给药的瞬间(t=0)的血药浓度不是最大。"
    },
    "2-24": {
        "text": "什么是达坪分数？静脉注射给药达坪分数与血管外给药达坪分数求算公式有何不同？为什么？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解：\\newline"
                       "\\newline 达坪分数是指第n次给药后的平均血药浓度 \\overline C_n "
                       "\\newline 与稳态平均血药浓度\\overline C_{ss} 相比，相当于稳态平均血药浓度\\overline C_{ss} 的分数，以上f_{ss(n)}表示。"
                       "\\newline 静脉注射给药的达坪分数求算公式为:"
                       "f_{ss(n} = 1 - e^{-nk \\tau}"
                       "\\newline 血管外给药达坪分数求算公式为："
                       "\\newline f_{ss(n)} = 1 - \\frac{k_a e^{-nk \\tau} - ke^{-nk_a \\tau}}{k_a -k}"
                       "\\newline 这是由于血管外给药时药物有一个吸收过程，吸收速率常数k_a的"
                       "\\newline 大小会影响药物达到稳态的分数。只有当k_a>>k，在\\tau时吸收基本结束的情况下，"
                       "\\newline 才可以不考虑k_a对f_{ss(n)}的影响，此时f_{ss(n)} = 1-e^{-nk\\tau}"
    },
    "2-25": {
        "text": "重复静脉注射给药与血管外重复给药平均稳态血药浓度求算公式有何不同？为什么？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解：\\newline"
                       "重复静脉注射给药的平均稳态血药浓度求算公式为：\\overline C_{ss} = \\frac{X_0}{Vk \\tau}"
                       "\\newline 血管外重复给药的平均稳态血药浓度求算公式为： \\overline C_{ss} = \\frac{FX_0}{Vk \\tau}"
                       "\\newline 这是由于血管外给药时药物有一个吸收过程，通常药物不能完全吸收进入体内"
                       "\\newline 即吸收系数F<100 \\%），能够进入体内的药量为FX_0。"
    },
    "2-26": {
        "text": "影响血管外重复给药稳态峰浓度的因素有哪些？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解：\\newline"
                       "\\newline 血管外重复给药的稳态峰浓度为：C^{ss}_{max} = \\frac{FX_0}{V}(\\frac{e^{-kt_{max}}}{1-e^{-k \\tau}})"
                       "\\newline 影响稳态峰浓度的因素有：药物的消除速率常数k，吸收系数F，"
                       "\\newline 给药剂量X_0，药物的表观分布容积V，稳态达峰时间t_{max}，给药间隔时间 \\tau。"
    },
    "2-27": {
        "text": "对患者进行间歇静脉滴注时，为什么消除半衰期为36h的药物比消除半衰期为6h的药物更难进行给药方案调整？",
        "options": {},
        "answer": "",
        "answer_text": "重复给药时，大约在5个半衰期内可达到稳态。对于半衰期为36h的药物，大约要经过180h才能达到稳态，因此对半衰期很长的药物进行给药调整是很困难的。而半衰期为4h - 6h的药物，则可在大约20h - 30h（或ld）达到稳态。"
    },
    "2-28": {
        "text": "什么是蓄积系数？静脉注射给药与血管外给药蓄积系数求算公式有什么不同？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解：\\newline"
                       "蓄积系数又叫蓄积因子或积累系数，系指稳态血药浓度与第一次给药后"
                       "\\newline 的血药浓度的比值，以R表示。"
                       "\\newline 静脉注射给药蓄积系数求算公式为： R=\\frac{1}{1-e^{-k \\tau}}"
                       "\\newline 血管外给药蓄积系数求算公式为： R = \\frac{1}{(1-e^{-k \\tau})(1-e^{-k_a \\tau})}"
    },
    "2-29": {
        "text": "可用哪些参数描述血药浓度的波动程度？",
        "options": {},
        "answer": "",
        "answer_text": "描述血药浓度波动程度的参数有：波动百分数、波动度(DF)、血药浓度变化率。"
    },
    "2-30": {
        "text": "何为非线性药物动力学？非线性药物动力学与线性药物动力学有何区别？",
        "options": {},
        "answer": "",
        "answer_text": "有些药物的吸收、分布和体内消除过程，并不符合线性药物动力学特征，其主要表现为一些药物动力学参数随剂量不同而改变，这种药物动力学特征称为非线性药物动力学（nonlinear pharmacokinetics）。\n线性药物动力学的基本特征是血药浓度与体内药物量成正比。在线性药物动力学中，药物的生物半衰期、消除速度常数及清除率与剂量无关，血药浓度-时间曲线下面积与剂量成正比关系，当剂量改变时，其相应的时间点上的血药浓度与剂量成正比的改变等。而非线性药物动力学则表现为血药浓度及血药浓度-时间曲线下面积与剂量不成正比，药物动力学参数如生物半衰期、清除率等表现为剂量依赖性。"
    },
    "2-31": {
        "text": "写出非线性消除过程Michaelis-Menten方程，说明Vm、Km的意义。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解：\\newline "
                       "Michaelis-Menten方程如下所示："
                       "\\newline v = Vm \\times \\frac{[S]}{km + [S]}"
                       "\\newline Vm反映了酶系统的饱和水平和活性，"
                       "\\newline 它表示在酶饱和的情况下，单位时间内酶催化转化底物的最大能力。"
                       "\\newline Km表示酶与底物之间的亲和力或结合的紧密程度。"
    },
    "2-32": {
        "text": "试分析非线性药物动力学半衰期、血药浓度-时间曲线下面积及稳态血药浓度与剂量的关系。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解：\\newline"
                       "非线性药物动力学生物半衰期为 t_{1/2} = \\frac{\\frac{1}{2} C + 0.693K_m}{V_m} = \\frac{C+1.386K_m}{2V_m}"
                       "\\newline 半衰期随血药浓度或给药剂量的不同而变化。"
                       "\\newline 当C << Km，即血药浓度下降到很低时，t_{1/2} = \\frac{0.693k_m}{V_m},"
                       "\\newline 血药浓度或剂量对生物半衰期影响不明显，表现为线性动力学特征，"
                       "\\newline t_{1/2}与血药浓度无关；当C >> Km，即血药浓度较高时，t_{1/2} == \\frac{C}{2V_m},"
                       "\\newline 表明生物半衰期随血药浓度或剂量的增加而延长。"
                       "\\newline 血药浓度-时间曲线下面积为 AUC = \\int_{0}^{+ \\infty}Cdt = \\frac{X_0}{V_mV}(K_m + \\frac{X_0}{2V}),"
                       "\\newline 表明AUC与剂量不成正比关系。当X_0/(2V)<<Km，即剂量较低时，"
                       "\\newline 则 AUC = \\frac{K_mX_0}{V_mV},"
                       "\\newline AUC与剂量成正比，相当于线性一级消除过程；当X0/(2V)>>Km，即剂量较大时，则 AUC = \\frac{X_0^2}{2V_mV^2},"
                       "\\newline 表明AUC与剂量的平方成正比，此时，剂量的少量增加，会引起AUC较大的增加。"
                       "\\newline 稳态血药浓度 C_{ss} = \\frac{K_mX_0}{\\tau V_m - X_0}, "
                       "\\newline 当增加剂量时，稳态血药浓度的升高幅度高于正比例的增加程度。""\\newline""\\newline"
    },
    "2-33": {
        "text": "简述将统计矩应用于药物动力学的基础。",
        "options": {},
        "answer": "",
        "answer_text": "当一定量的药物输入机体时，不论是在给药部位或在整个机体内，各药物分子的滞留时间的长短，均属随机变量。药物的吸收、分布及消除可视为这种随机变量所相应的总体效应，因此，药-时曲线是某种概率统计曲线。亦即药-时曲线可看作是药物分子在体内滞留时间的概率分布曲线。"
    },
    "2-34": {
        "text": "为什么在药动学中应用统计矩？",
        "options": {},
        "answer": "",
        "answer_text": "室模型分析已广泛应用于药物动力学研究，但它并不适用于所有药物。例如，当某一药物的分布非常缓慢时，其体内过程并不严格按室模型进行，对它进行严密的药物动力学分析非常复杂。在多室模型的药物动力学解析中，也存在相似的问题。应用简单的统计矩理论，可解析、处理和表征药物的动力学特征。\n应用于药物动力学研究的统计矩分析，是一种非隔室的分析方法。它不需要对药物设定专门的隔室，也不必考虑药物的体内隔室模型特征。目前，这种分析方法主要适用于体内过程符合线性动力学的药物。"
    },
    "2-35": {
        "text": "单室模型静脉注射给药与血管外给药负荷剂量的求算有什么不同？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解：\\newline"
                       "单室模型静脉注射给药的负荷剂量求算公式为： X_0^{*} = \\frac{1}{1-e^{-k \\tau} \\cdot X_0}"
                       "\\newline 单室模型血管外给药的负荷剂量求算公式为： X_0^{*} = \\frac{1}{(1-e^{-k \\tau})(1-e^{-k_a \\tau})} \\cdot X_0"
    },
    "2-37": {
        "text": "治疗药物监测在临床药学中有何应用？",
        "options": {},
        "answer": "",
        "answer_text": "治疗药物监测在临床药学中的应用有：\n①指导临床合理用药、提高治疗水平。对治疗指数窄的药物、中毒症状易与疾病本身相混淆的药物、个体差异大的药物等开展TDM研究，调整给药方案，对提高药物疗效，减少或避免毒性反应发生具有重要意义。\n②确定合并用药的原则，临床上，合并用药的情况相当多，开展TDM研究药物的相互作用，对确定合并用药原则具有重要意义。\n③药物过量中毒的诊断，开展TDM对防止药物过量中毒和药物急性过量中毒的诊断具有重要意义，特别是能发现一些仅临床观察不易及时确诊的病例。\n④作为临床辅助诊断的手段，有些药物血药浓度与效应有较好的相关性，但有时用药剂量已达最大仍不见疗效，临床诊断是否正确，开展TDM研究具有重要意义。\n⑤作为医疗差错或事故的鉴定依据及评价患者用药依从性的手段。"
    },
    "2-38": {
        "text": "重复给药中，当维持剂量恒定时，负荷剂量对药物的稳态浓度是否会产生很大的影响？",
        "options": {},
        "answer": "",
        "answer_text": "负荷剂量仅影响体内的初始血药浓度。一般给药后需要4.32个t1/2才能达到95%稳态水平，需要6.64个t1/2才能达到99%稳态水平。在达到95%稳态的情况下，负荷剂量仅占其中的5%。在99%稳态水平时，负荷剂量只剩下1%。"
    },
    "2-39": {
        "text": "为什么临床上推荐氨基糖苷类抗生素每天给药一次？",
        "options": {},
        "answer": "",
        "answer_text": "①氨基糖苷类抗生素属于浓度依赖型，减少给药次数，加大每次用药剂量有利于提高血药峰浓度，从而增强疗效。②氨基糖苷类抗生素有较长的PAE。利用PAE可在原剂量或适当增加剂量的前提下，适当延长给药间隔。③氨基糖苷类抗生素有首次接触效应(FEE)，即细菌首次接触氨基糖苷类抗生素时，能被迅速杀灭，当未被杀灭的细菌再次或多次接触同种抗生素时，杀菌效果明显降低。这种现象亦称之为适应性耐药。④氨基糖苷类的肾毒性和耳毒性与肾皮质及内耳淋巴液中的药物浓度高低及维持时间长短有关，一日一次的给药方案可降低肾毒性和耳毒性。"
    },
    "2-40": {
        "text": "治疗药物监测的目的是什么？哪些情况下需要进行血药浓度监测？",
        "options": {},
        "answer": "",
        "answer_text": "治疗药物监测(TDM)是以药物动力学与药效动力学理论为指导，借助现代先进分析技术与电子计算机手段，通过对患者血液或其他体液中药物浓度检测，探讨临床用药过程中药物的吸收、分布、代谢和排泄。其目的是实现给药方案个体化，提高药物疗效，避免或减少不良反应，达到最佳治疗效果；同时也为药物过量中毒的诊断以及患者是否按医嘱用药提供重要依据。\n以下情况下需要进行血药浓度监测：①治疗指数低的药物，如地高辛、茶碱、奎尼丁、普鲁卡因胺、甲氨蝶呤等。②具有非线性动力学特征的药物，如苯妥英、水杨酸盐、保泰松、普萘洛尔、甲氨蝶呤、双香豆素等。③肝、肾、心及胃肠功能损害。④合并用药。⑤治疗作用与毒性反应难以区分。"
    },
    "2-41": {
        "text": "新药药物动力学研究时取样时间点如何确定？时间点确定有哪些要求？",
        "options": {},
        "answer": "",
        "answer_text": "根据研究样品的特性，取样点通常可安排9 - 13个点不等，一般在吸收相至少需要2~3个采样点，对于吸收快的血管外给药的药物，应尽量避免第一个点是Cmax；在Cmax附近至少需要3个采样点；消除相需要4-6个采样点。整个采样时间至少应持续到3 - 5个半衰期，或持续到血药浓度为Cmax的1/10 - 1/20。"
    },
    "2-42": {
        "text": "简述用于新药动力学研究的生物样本测定方法的评价指标。",
        "options": {},
        "answer": "",
        "answer_text": "生物样品的特点为取样量少、药物浓度低、干扰物质多以及个体差异大，因此必须建立灵敏、专一、精确、可靠的生物样品定量分析方法，并根据具体目的对方法进行确证。药物动力学研究时，进行测定方法方法学确证的评价指标包括：精密度、准确度、特异性、样品稳定性、灵敏度以及标准曲线和定量范围等。其中精密度主要包括日内和日间精密度，准确度以回收率来体现，灵敏度则主要以定量下限来表示。"
    },
    "3-43": {
        "text": "生物利用度评价的常用药动学参数有哪些？各有何意义？",
        "options": {},
        "answer": "",
        "answer_text": "生物利用度是指药物吸收进入体循环的速度和程度。进行药物生物利用度评价时的最主要参数包括血药浓度—时间曲线下面积AUC、达峰时tmax和峰浓度Cmax其中AUC与药物吸收的总量成正比，代表药物吸收的程度，tmax主要代表吸收的速度，Cmax是与治疗效果及毒性反应有关的参数，与吸收速率有关，也与药物吸收的程度相关。"
    },
    "3-44": {
        "text": "简述临床前药物动力学研究对新药研究的意义。",
        "options": {},
        "answer": "",
        "answer_text": "临床前药物动力学研究在新药研究开发的评价过程中起着重要作用。在药效学和毒理学评价中，药物或活性代谢物浓度数据及其相关药物动力学参数是产生、决定或阐明药效或毒性大小的基础，可提供药物对靶器官效应（药效或毒性）的依据；在药物制剂学研究中，临床前药物动力学研究结果是评价药物制剂特性和质量的重要依据；在临床研究中，临床前药物动力学研究结果能为设计和优化临床研究给药方案提供有关参考信息。对于未上市的速释、缓释、控释制剂，可以通过临床前药物动力学研究考察单次给药和多次给药后该制剂的药物动力学行为，并与已上市的被仿制产品或普通制剂比较，考察试验制剂的释药特征，对新组成的复方制剂，临床前药物动力学研究则可以提供组方合理性的药物动力学依据。"
    },
    "3-45": {
        "text": "简述缓、控释制剂进行生物利用度试验时稳态血药浓度波动的评价指标。",
        "options": {},
        "answer": "",
        "answer_text": "缓、控释制剂的重要特征表现在多次给药时血药浓度波动幅度小，且在治疗所需浓度范围内维持时间长。目前常用的评价缓、控释制剂进行生物利用度试验时与稳态血药浓度波动相关的参数主要包括：坪时间，包括半峰浓度维持时间、治疗维持时间和延迟商等3种表示方式；血药浓度超过平均稳态血药浓度Css的维持时间；峰谷波动百分率或波动度；峰谷摆动率；AUC波动百分率和波动系数等。其中由于波动度或峰谷波动百分率通过Css消除了个体及个体间清除率不同对结果的影响，被认为是一较好的评价指标。"
    },
    "3-46": {
        "text": "对一种新的对乙酰氨基酚制剂，设计一个该药品和市售药品比较的方案。用什么标准去证实新制剂的生物等效？",
        "options": {},
        "answer": "",
        "answer_text": "临床前药物动力学研究在新药研究开发的评价过程中起着重要作用。在药效学和毒理学评价中，药物或活性代谢物浓度数据及其相关药物动力学参数是产生、决定或阐明药效或毒性大小的基础，可提供药物对靶器官效应（药效或毒性）的依据；在药物制剂学研究中，临床前药物动力学研究结果是评价药物制剂特性和质量的重要依据；在临床研究中，临床前药物动力学研究结果能为设计和优化临床研究给药方案提供有关参考信息。对于未上市的速释、缓释、控释制剂，可以通过临床前药物动力学研究考察单次给药和多次给药后该制剂的药物动力学行为，并与已上市的被仿制产品或普通制剂比较，考察试验制剂的释药特征，对新组成的复方制剂，临床前药物动力学研究则可以提供组方合理性的药物动力学依据。"
    },
    "3-47": {
        "text": "对一种新的对乙酰氨基酚制剂，设计一个该药品和市售药品比较的方案。用什么标准去证实新制剂的生物等效？",
        "options": {},
        "answer": "",
        "answer_text": "设计新制剂与市售药品比较的方案需要考虑以下步骤：\n1. 研究设计：选择合适的设计，如随机交叉试验或平行设计试验。\n2. 参与人群：招募符合条件的人群，确保人口统计学特征相似。\n3. 给药方案：确定剂量和给药途径。\n4. 样本采集：收集血液或其他生物样本，测定血药浓度。\n5. 药物动力学测定：测定新制剂和市售药品的血药浓度，绘制血药浓度-时间曲线。\n6. 生物等效性评价：比较AUC（血药浓度-时间曲线下面积）和Cmax（峰浓度）等指标。\n7. 统计分析：计算指标的比值，并进行统计检验。\n8. 标准证实生物等效：使用适当的标准（如FDA、EMA等）验证新制剂是否满足生物等效性要求。\n如果新制剂的AUC和Cmax在标准要求的90%置信区间内与市售药品相符，可认为新制剂与市售药品在生物等效性上相当。具体方案需根据药物和研究目的进行调整。"
    },
    "3-48": {
        "text": "在比较同一药物口服试验制剂和参比制剂（上市制剂）的生物等效试验后，观察到试验制剂比上市制剂有更大的生物利用度。\n(1)能否批准该试验制剂上市，并认为它优于注册制剂？\n(2)能否认为两个制剂有一致的药效？\n(3)服用试验制剂是否会引起服用上市制剂不会出现的治疗问题？",
        "options": {},
        "answer": "",
        "answer_text": "7. (1)当两种制剂的生物利用度有差异时，经统计学处理亦存在两种制剂生物等效的可能性，从题中已知试验制剂的生物利用度好于上市制剂，但在决定能否批准试验制剂上市前应首先考虑两制剂是否生物等效，若统计结果表明两者具有生物等效性，按照相关规定可以批准试验制剂生产上市。若结果为两制剂生物不等效，则不能仅根据试验制剂生物利用度优于上市制剂而批准其上市。\n(2)若结果判断为两制剂生物不等效，则两制剂不具有一致的药效。\n(3)因为生物利用度的指标包括AUC、tmax和Cmax等，当AUC和Cmax都有显著提高时，服用该试验制剂可能会引起上市制剂所不会出现的治疗问题，包括可能出现更多的毒副作用。"
    },
    "4-1": {
        "text": "注射给药药物直接进入体循环，不存在吸收过程，药物的生物利用度为100%。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-2": {
        "text": "药物经口腔黏膜吸收，通过黏膜下毛细血管汇总至颈内静脉，不经肝脏而直接进入心脏，因此可避开肝首过效应。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-3": {
        "text": "脂溶性较强的药物易通过生物膜吸收，但较易跨角膜吸收的药物必须兼具脂溶性与水溶性。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-4": {
        "text": "药物经直肠给药可以完全避开肝首过效应。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-5": {
        "text": "药物粒子在肺部的沉积与粒子大小有关，一般来讲粒子越小在肺泡的沉积量就越大。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-6": {
        "text": "药物的分布是指药物从给药部位吸收进入血液后，由循环系统运送至体内各脏器组织的过程。分布速度往往比消除慢。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-7": {
        "text": "由于药物的理化性质及生理因素的差异，不同药物在体内具有不同的分布特性，但药物在体内分布是均匀的。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-8": {
        "text": "药物从血液向组织器官分布的速度取决于组织器官的血液灌流速度和药物与组织器官的亲和力。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-9": {
        "text": "连续应用某药物，当药物从组织解脱入血的速度比进入组织的速度快时，组织中的药物浓度会逐渐升高而引起蓄积。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-10": {
        "text": "蛋白结合率越高，游离药物浓度越小。当存在饱和现象或竞争结合现象时，游离浓度变化不大，对于毒副作用较强的药物，不易发生用药安全问题。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-11": {
        "text": "药物体内分布主要决定于血液中游离型药物的浓度，其次与该药物和组织结合的程度有关。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-12": {
        "text": "药物与血浆蛋白结合，能降低药物的分布与消除速度，延长作用时间，并有减毒和保护机体的作用。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-13": {
        "text": "蛋白质大分子药物主要依赖淋巴系统转运，可使药物不通过肝从而避免首过作用。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-14": {
        "text": "胎盘屏障不同于血脑屏障。药物脂溶性越大，越难透过。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-15": {
        "text": "肝微粒体混合功能氧化酶系统又称单加氧酶。该酶系催化的氧化反应特异性不强，是药物体内代谢的主要途径。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-16": {
        "text": "药物代谢的主要部位是在胃肠道和血浆中，此外代谢反应也可肝脏、肺、皮肤、肾、鼻粘膜、脑和其它组织进行。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-17": {
        "text": "药物通过肝转运至体循环的过程中，部分药物被代谢，使进入体循环的原型药物量减少的现象，称为“首过效应”。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-18": {
        "text": "对于肝提取率高的药物，肝血流量是主要影响因素，首过效应不明显。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-19": {
        "text": "肝提取率低的药物，基本不受血浆蛋白结合的影响，首过效应明显。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-20": {
        "text": "肝提取率中等的药物，肝血流量和血浆蛋白结合率对其均有影响。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-21": {
        "text": "第一相反应包括氧化、还原和结合三种，通常是脂溶性药物通过反应生成极性基团。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-22": {
        "text": "结合反应一般被认为是药物在体内的灭活过程，故又称之为“解毒反应”。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-23": {
        "text": "有的药物是自身的酶诱导剂，对肝微粒体中酶产生诱导作用，从而使其它药物代谢加快，药理活性及毒副作用降低。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-24": {
        "text": "左旋多巴与脱羧酶抑制剂甲基多巴肼合用，可增加血浆中左旋多巴浓度，同时增加脑内的左旋多巴浓度，并降低多巴胺浓度，使作用加强。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-25": {
        "text": "若某药物消除半衰期为3h，表示该药消除过程中从任何时间的浓度开始计算，其浓度下降一半的时间均为3h。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-26": {
        "text": "某药同时用于两个病人，消除半衰期分别为3h和6h，因后者时间较长，故给药剂量应增加。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-27": {
        "text": "亏量法处理尿排泄数据时对药物消除速度的波动较敏感。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-28": {
        "text": "药物的消除速度常数k大，说明该药体内消除慢，半衰期长。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-29": {
        "text": "静注两种单室模型药物，剂量相同，分布容积大的血药浓度大，分布容积小的血药浓度小。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-30": {
        "text": "肾清除率是反映肾功能的重要参数之一，某药清除率值大，说明药物清除快。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-31": {
        "text": "药物在胃肠道中崩解和吸收快，则达峰时间短，峰浓度高。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-32": {
        "text": "当药物大部分代谢时，可采用尿药速度法处理尿药排泄数据，求取消除速率常数。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-33": {
        "text": "达峰时只与吸收速度常数ka和消除速度常数k有关。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-34": {
        "text": "静脉滴注给药经过3.32个半衰期，血药浓度达到稳态浓度的90%。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-35": {
        "text": "新药体内外相关性评价中如果结果为A级相关则认为药物在体内的平均滞留时间和体外的平均溶出时间是确定而相关的。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-36": {
        "text": "生物样本因为取样量少、药物浓度低、干扰物质多以及个体差异大，因此最常采用免疫学方法如放射免疫分析法、酶免疫分析法、荧光免疫分析法等进行测定。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-37": {
        "text": "药物释放度与溶出度在新药研究中是相同的概念。",
        "options": {},
        "answer": "",
        "answer_text": "F"
    },
    "4-38": {
        "text": "反映药物吸收速度和吸收程度的参数主要指AUC、tmax、Cmax。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    "4-39": {
        "text": "生物利用度的试验设计往往采用随机交叉试验设计方法，其目的是为了消除个体差异与试验周期对试验结果的影响。",
        "options": {},
        "answer": "",
        "answer_text": "T"
    },
    # 选择题
    "5-1": {
        "text": "可产生肝脏首过效应的给药途径或剂型是",
        "options": {
            "A": "舌下片给药",
            "B": "口服胶囊",
            "C": "栓剂",
            "D": "静脉注射",
            "E": "透皮吸收给药"
        },
        "answer": "B",
        "answer_text": "口服胶囊"
    },
    "5-2": {
        "text": "胞饮作用的特点是",
        "options": {
            "A": "有部位特异性",
            "B": "需要载体",
            "C": "不需要消耗机体能量",
            "D": "逆浓度梯度转运",
            "E": "无部位特异性"
        },
        "answer": "A",
        "answer_text": "有部位特异性"
    },
    "5-3": {
        "text": "药物主动转运吸收的特异性部位",
        "options": {
            "A": "小肠",
            "B": "盲肠",
            "C": "结肠",
            "D": "直肠",
            "E": "阑尾"
        },
        "answer": "A",
        "answer_text": "小肠"
    },
    "5-4": {
        "text": "影响药物胃肠道吸收的剂型因素不包括",
        "options": {
            "A": "药物在胃肠道中的稳定性",
            "B": "粒子大小",
            "C": "多晶型",
            "D": "解离常数",
            "E": "胃排空速率"
        },
        "answer": "E",
        "answer_text": "胃排空速率"
    },
    "5-5": {
        "text": "影响药物胃肠道吸收的生理因素不包括",
        "options": {
            "A": "胃肠液成分与性质",
            "B": "胃肠道蠕动",
            "C": "循环系统",
            "D": "药物在胃肠道中的稳定性",
            "E": "胃排空速率"
        },
        "answer": "D",
        "answer_text": "药物在胃肠道中的稳定性"
    },
    "5-6": {
        "text": "一般认为在口服剂型中药物吸收速率的大致顺序",
        "options": {
            "A": "水溶液＞混悬液＞散剂＞胶囊剂＞片剂",
            "B": "水溶液＞混悬液＞胶囊剂＞散剂＞片剂",
            "C": "水溶液＞散剂＞混悬液＞胶囊剂＞片剂",
            "D": "混悬液＞水溶液＞散剂＞胶囊剂＞片剂",
            "E": "水溶液＞混悬液＞片剂＞散剂＞胶囊剂"
        },
        "answer": "A",
        "answer_text": "水溶液＞混悬液＞散剂＞胶囊剂＞片剂"
    },
    "5-7": {
        "text": "下列各因素均能加快胃的排空，但应除外",
        "options": {
            "A": "胃内容物渗透压降低",
            "B": "胃大部切除",
            "C": "胃内容物粘度降低",
            "D": "阿斯匹林",
            "E": "普奈洛尔"
        },
        "answer": "D",
        "answer_text": "阿斯匹林"
    },
    "5-8": {
        "text": "以下哪个不是被动扩散特征？",
        "options": {
            "A": "不消耗能量",
            "B": "有部位特异性",
            "C": "由高浓度区域向低浓度区域转运",
            "D": "不需借助载体进行转运",
            "E": "无饱和现象和竞争抑制现象"
        },
        "answer": "D",
        "answer_text": "不需借助载体进行转运"
    },
    "5-9": {
        "text": "以下哪条不是主动转运的特征？",
        "options": {
            "A": "消耗能量",
            "B": "可与结构类似的物质发生竞争现象",
            "C": "由低浓度向高浓度转运",
            "D": "不需载体进行转运",
            "E": "有饱和状态"
        },
        "answer": "D",
        "answer_text": "不需载体进行转运"
    },
    "5-10": {
        "text": "弱酸性药物的溶出速率大小与pH大小的关系是",
        "options": {
            "A": "随pH增加而增加",
            "B": "随pH减少而增加",
            "C": "速率可变，但与pH无关",
            "D": "视具体情况而定",
            "E": "每一种药物的溶出速率都是恒定的"
        },
        "answer": "A",
        "answer_text": "随pH增加而增加"
    },
    "5-11": {
        "text": "药物和血浆蛋白结合的特点有",
        "options": {
            "A": "结合型与游离型存在动态平衡",
            "B": "无竞争性",
            "C": "无饱和性",
            "D": "结合率取决于血液pH",
            "E": "结合型可自由扩散"
        },
        "answer": "A",
        "answer_text": "结合型与游离型存在动态平衡"
    },
    "5-12": {
        "text": "药物的表观分布容积是指",
        "options": {
            "A": "人体总体积",
            "B": "人体的体液总体积",
            "C": "游离药物量与血浓度之比",
            "D": "体内药量与血浓度之比",
            "E": "体内药物分布的实际容积"
        },
        "answer": "D",
        "answer_text": "体内药量与血浓度之比"
    },
    "5-13": {
        "text": "下列有关药物表观分布容积的叙述中，叙述正确的是",
        "options": {
            "A": "表观分布容积大，表明药物在血浆中浓度小",
            "B": "表观分布容积表明药物在体内分布的实际容积",
            "C": "表观分布容积不可能超过体液量",
            "D": "表观分布容积的单位是升/小时",
            "E": "表观分布容积具有生理学意义"
        },
        "answer": "A",
        "answer_text": "表观分布容积大，表明药物在血浆中浓度小"
    },
    "5-14": {
        "text": "药物与蛋白结合后",
        "options": {
            "A": "不能透过血管壁",
            "B": "不能由肾小球滤过",
            "C": "不能经肝代谢",
            "D": "不能透过胎盘屏障",
            "E": "以上都正确"
        },
        "answer": "D",
        "answer_text": "不能透过胎盘屏障"
    },
    "5-15": {
        "text": "以下错误的是：",
        "options": {
            "A": "淋巴循环可使药物不通过肝从而减少首过作用。",
            "B": "蛋白结合可减少首过作用。",
            "C": "都对",
            "D": "都不对"
        },
        "answer": "D",
        "answer_text": "都不对"
    },
    "5-16": {
        "text": "具有在各组织内均匀分布特征的药物",
        "options": {
            "A": "组织中的药物浓度比血液中的药物浓度高。",
            "B": "组织中的药物浓度与血液中的药物浓度几乎相等。",
            "C": "组织中的药物浓度低于血液中的药物浓度",
            "D": "组织和血液中的药物浓度存在动态平衡"
        },
        "answer": "D",
        "answer_text": "组织和血液中的药物浓度存在动态平衡"
    },
    "5-17": {
        "text": "以下关于蛋白结合的叙述正确的是：",
        "options": {
            "A": "蛋白结合率越高，由于竞争结合现象，容易引起不良反应。",
            "B": "蛋白结合存在动态平衡，有饱和和竞争结合现象。",
            "C": "药物与蛋白结合后，可促进透过血脑屏障。",
            "D": "蛋白结合率低的药物，由于竞争结合现象，容易引起不良反应。"
        },
        "answer": "A",
        "answer_text": "蛋白结合率越高，由于竞争结合现象，容易引起不良反应。"
    },
    "5-18": {
        "text": "药物向中枢神经系统的转运，主要取决于",
        "options": {
            "A": "药物的亲脂性，药物的脂溶性越高，向脑内转运越慢。",
            "B": "药物的亲脂性，药物的脂溶性越低，向脑内转运越慢。",
            "C": "药物血浆蛋白结合率，结合率越高，越易向脑内转运。",
            "D": "药物血浆蛋白结合率，结合率越低，越易向脑内转运。"
        },
        "answer": "B",
        "answer_text": "药物的亲脂性，药物的脂溶性越低，向脑内转运越慢。"
    },
    "5-19": {
        "text": "某些药物直肠给药优于口服给药，其理由主要是",
        "options": {
            "A": "避免了溶出过程",
            "B": "口服药物不吸收",
            "C": "在进入体循环前已被直肠吸收的药物有一部分不通过门肝系统",
            "D": "粘合剂、稀释剂等辅料干扰吸收",
            "E": "直肠给药剂型中基质有利于药物的释放"
        },
        "answer": "C",
        "answer_text": "在进入体循环前已被直肠吸收的药物有一部分不通过门肝系统"
    },
    "5-20": {
        "text": "药物的灭活和消除速度主要决定",
        "options": {
            "A": "起效的快慢",
            "B": "作用持续时间",
            "C": "最大效应",
            "D": "后遗效应的大小",
            "E": "不良反应的大小"
        },
        "answer": "B",
        "answer_text": "作用持续时间"
    },
    "5-21": {
        "text": "在新生儿时期，许多药物的半衰期延长，这是因为",
        "options": {
            "A": "较高的蛋白结合率",
            "B": "微粒体酶的诱发",
            "C": "药物吸收很完全",
            "D": "酶系统发育不全",
            "E": "阻止药物分布全身的屏障发育不全"
        },
        "answer": "D",
        "answer_text": "酶系统发育不全"
    },
    "5-22": {
        "text": "如果处方中选用口服硝酸甘油，就应选用较大剂量，因为",
        "options": {
            "A": "胃肠道吸收差",
            "B": "在肠中水解",
            "C": "与血浆蛋白结合率高",
            "D": "首过效应明显",
            "E": "肠道细菌分解"
        },
        "answer": "D",
        "answer_text": "首过效应明显"
    },
    "5-23": {
        "text": "可产生肝脏首过效应的给药途径或剂型是",
        "options": {
            "A": "舌下片给药",
            "B": "口服胶囊",
            "C": "栓剂",
            "D": "静脉注射",
            "E": "透皮吸收给药"
        },
        "answer": "B",
        "answer_text": "口服胶囊"
    },
    "5-24": {
        "text": "某前体药物和酶诱导剂同时使用时，可导致：",
        "options": {
            "A": "药理作用加快、加强或毒性降低",
            "B": "药理作用加快、加强或毒性增强",
            "C": "药理作用延缓、减弱或毒性降低",
            "D": "药理作用延缓、减弱或毒性增强",
            "E": "药理作用加快、减弱或毒性降低"
        },
        "answer": "B",
        "answer_text": "药理作用加快、加强或毒性增强"
    },
    "5-25": {
        "text": "药物代谢所涉及的化学反应主要有：",
        "options": {
            "A": "氧化、还原、分解、结合",
            "B": "氧化、还原、水解、脱羧",
            "C": "氧化、还原、水解、结合",
            "D": "氧化、乙酰化、分解、结合",
            "E": "还原、水解、结合、甲基化"
        },
        "answer": "C",
        "answer_text": "氧化、还原、水解、结合"
    },
    "5-26": {
        "text": "药物在体内以原型不可逆消失的过程，该过程是",
        "options": {
            "A": "吸收",
            "B": "分布",
            "C": "代谢",
            "D": "排泄",
            "E": "转运"
        },
        "answer": "D",
        "answer_text": "排泄"
    },
    "5-27": {
        "text": "药物排泄的主要器官是",
        "options": {
            "A": "肝",
            "B": "肺",
            "C": "脾",
            "D": "肠",
            "E": "肾"
        },
        "answer": "E",
        "answer_text": "肾"
    },
    "5-28": {
        "text": "药物除了肾排泄以外的最主要排泄途径是",
        "options": {
            "A": "胆汁",
            "B": "汗腺",
            "C": "唾液腺",
            "D": "泪腺",
            "E": "呼吸系统"
        },
        "answer": "A",
        "answer_text": "胆汁"
    },
    "5-29": {
        "text": "可以用来测定肾小球滤过速度的药物是",
        "options": {
            "A": "青霉素",
            "B": "链霉素",
            "C": "菊粉",
            "D": "葡萄糖",
            "E": "乙醇"
        },
        "answer": "C",
        "answer_text": "菊粉"
    },
    "5-30": {
        "text": "药物的脂溶性是影响下列哪一步骤的最重要因素",
        "options": {
            "A": "肾小球滤过率",
            "B": "肾小管分泌",
            "C": "肾小管重吸收",
            "D": "尿量",
            "E": "尿液酸碱性"
        },
        "answer": "C",
        "answer_text": "肾小管重吸收"
    },
    "5-31": {
        "text": "酸化尿液可能对下列药物中的哪一种肾排泄不利",
        "options": {
            "A": "水杨酸",
            "B": "葡萄糖",
            "C": "四环素",
            "D": "庆大霉素",
            "E": "麻黄碱"
        },
        "answer": "A",
        "answer_text": "水杨酸"
    },
    "5-32": {
        "text": "一定时间内肾能使多少溶剂的血浆中该药物清除的能力被称为",
        "options": {
            "A": "肾排泄速度",
            "B": "肾清除率",
            "C": "肾清除力",
            "D": "肾小管分泌",
            "E": "肾小球过滤速度"
        },
        "answer": "B",
        "answer_text": "肾清除率"
    },
    "5-33": {
        "text": "分子量增加可能会促进下列过程中的那一项",
        "options": {
            "A": "肾小球过滤",
            "B": "胆汁排泄",
            "C": "重吸收",
            "D": "肾小管分泌",
            "E": "尿排泄过度"
        },
        "answer": "B",
        "answer_text": "胆汁排泄"
    },
    "5-34": {
        "text": "下列过程中哪一种过程一般不存在竞争抑制",
        "options": {
            "A": "肾小球过滤",
            "B": "胆汁排泄",
            "C": "肾小管分泌",
            "D": "肾小管重吸收",
            "E": "药物从血液透析"
        },
        "answer": "A",
        "answer_text": "肾小球过滤"
    },
    "5-35": {
        "text": "在胆汁中排泄的药物或其代谢物在小肠中移动期间重新被吸收返回肝门静脉的现象被称为",
        "options": {
            "A": "肝的首过作用",
            "B": "肝代谢",
            "C": "肠肝循环",
            "D": "胆汁排泄",
            "E": "肠肝排泄"
        },
        "answer": "C",
        "answer_text": "肠肝循环"
    },
    "5-36": {
        "text": "重复给药的血药浓度-时间关系式的推导前提是",
        "options": {
            "A": "单室模型",
            "B": "双室模型",
            "C": "静脉注射给药",
            "D": "等剂量，等间隔",
            "E": "血管内给药"
        },
        "answer": "D",
        "answer_text": "等剂量，等间隔"
    },
    "5-37": {
        "text": "以下关于稳态血药浓度的叙述，正确的是",
        "options": {
            "A": "达到稳态后，血药浓度始终维持在一个恒定值",
            "B": "平均稳态血药浓度是稳态最大血药浓度和稳态最小血药浓度的算术平均值",
            "C": "平均稳态血药浓度在数值上更接近稳态最小血药浓度",
            "D": "增加给药频率，稳态最大血药浓度和稳态最小血药浓度的差值减少",
            "E": "半衰期越长，稳态血药浓度越小"
        },
        "answer": "C",
        "answer_text": "平均稳态血药浓度在数值上更接近稳态最小血药浓度"
    },
    "5-38": {
        "text": "应用于药物动力学研究的统计矩分析，是一种非隔室的分析方法。它主要适用于体内过程符合(    )的药物",
        "options": {
            "A": "隔室",
            "B": "非隔室",
            "C": "线性",
            "D": "非线性"
        },
        "answer": "C",
        "answer_text": "线性"
    },
    "5-39": {
        "text": "药-时曲线下的总面积AUC0→∞称为",
        "options": {
            "A": "一阶矩",
            "B": "零阶矩",
            "C": "三阶矩",
            "D": "二阶矩"
        },
        "answer": "B",
        "answer_text": "零阶矩"
    },
    "5-40": {
        "text": "静脉注射后，在血药浓度-时间曲线呈现单指数项方程特征情况下，MRT表示消除给药剂量的(    )所需要的时间",
        "options": {
            "A": "50%",
            "B": "25%",
            "C": "63.2%",
            "D": "73.2%"
        },
        "answer": "C",
        "answer_text": "63.2%"
    },
    "5-41": {
        "text": "对于静脉注射后具单室模型特征的药物：t1/2=(   )MRTiv",
        "options": {
            "A": "1.693",
            "B": "0.693",
            "C": "0.3465",
            "D": "2.693"
        },
        "answer": "B",
        "answer_text": "0.693"
    },
    "5-42": {
        "text": "以下有关给药方案的调整的说法，正确的是",
        "options": {
            "A": "设计口服给药方案时，必须要知道药物的F",
            "B": "设计口服给药方案时，必须要知道有药物的t1/2",
            "C": "设计口服给药方案时，必须要知道药物的V",
            "D": "设计口服给药方案时，必须要同时知道药物的F、t1/2和V",
            "E": "设计口服给药方案并不一定都要知道药物的F、t1/2和V"
        },
        "answer": "E",
        "answer_text": "设计口服给药方案并不一定都要知道药物的F、t1/2和V"
    },
    "5-43": {
        "text": "拟定给药方案时，主要可调节以下哪一项调整剂量",
        "options": {
            "A": "t1/2和k",
            "B": "X0和τ",
            "C": "Css和V",
            "D": "V和CL",
            "E": "Cssmax和Cssmin"
        },
        "answer": "B",
        "answer_text": "X0和τ"
    },
    "5-44": {
        "text": "对于肾功能衰退患者，用药时主要考虑",
        "options": {
            "A": "药物经肾脏的转运",
            "B": "药物在肝脏的代谢",
            "C": "药物在胃肠的吸收",
            "D": "药物与血浆蛋白的结合率",
            "E": "个体差异"
        },
        "answer": "A",
        "answer_text": "药物经肾脏的转运"
    },
    "5-45": {
        "text": "新生儿的药物半衰期延长是因为",
        "options": {
            "A": "酶系统发育不完全",
            "B": "蛋白结合率较高",
            "C": "微粒体酶的诱导作用",
            "D": "药物吸收完全",
            "E": "通常药物以静脉注射给药"
        },
        "answer": "A",
        "answer_text": "酶系统发育不完全"
    },
    "5-46": {
        "text": "药物的作用强度，主要取决于",
        "options": {
            "A": "药物在血液中的浓度",
            "B": "药物与血浆蛋白的结合率",
            "C": "药物排泄的速率",
            "D": "药物在靶器官的浓度",
            "E": "以上都对"
        },
        "answer": "D",
        "answer_text": "药物在靶器官的浓度"
    },
    "5-47": {
        "text": "丙磺舒增加青霉素的疗效是因为",
        "options": {
            "A": "对细菌代谢有双重阻断作用",
            "B": "二者竞争肾小管的分泌通道",
            "C": "在杀菌作用上有协同作用",
            "D": "延缓抗药性产生",
            "E": "以上都不对"
        },
        "answer": "C",
        "answer_text": "在杀菌作用上有协同作用"
    },
    "5-48": {
        "text": "药物A的血浆蛋白结合率为95%，药物B的血浆蛋白结合率为85%，药物A单用时t1/2为4h，如药物A与药物B合用，则药物A的t1/2为",
        "options": {
            "A": "小于4h",
            "B": "不变",
            "C": "大于4h",
            "D": "大于8h",
            "E": "大于10h"
        },
        "answer": "B",
        "answer_text": "不变"
    },
    "5-49": {
        "text": "当可被肝药酶代谢的药物与酶抑制剂合用时比单独应用的效应",
        "options": {
            "A": "无效",
            "B": "减弱",
            "C": "不变",
            "D": "增强",
            "E": "相反"
        },
        "answer": "D",
        "answer_text": "增强"
    },
    "5-50": {
        "text": "应用双香豆素治疗血栓时合用苯巴比妥，使凝血酶原时间比未加苯巴比妥时缩短，这是因为",
        "options": {
            "A": "苯巴比妥抑制凝血酶",
            "B": "患者对双香豆素产生了耐药性",
            "C": "苯巴比妥对抗双香豆素的作用",
            "D": "苯巴比妥抗血小板聚集",
            "E": "苯巴比妥诱导肝药酶使双香豆素代谢加速"
        },
        "answer": "E",
        "answer_text": "苯巴比妥诱导肝药酶使双香豆素代谢加速"
    },
    "5-51": {
        "text": "在进行口服给药药物动力学研究时，不适于采用的动物为：",
        "options": {
            "A": "家兔",
            "B": "犬",
            "C": "大鼠",
            "D": "小鼠"
        },
        "answer": "A",
        "answer_text": "家兔"
    },
    "5-52": {
        "text": "缓释制剂药物动力学参数中HVD是指",
        "options": {
            "A": "延迟商",
            "B": "波动系数",
            "C": "半峰浓度维持时间",
            "D": "峰谷摆动率"
        },
        "answer": "C",
        "answer_text": "半峰浓度维持时间"
    },
    "5-53": {
        "text": "SFDA推荐首选的生物等效性的评价方法为：",
        "options": {
            "A": "药物动力学评价方法",
            "B": "药效动力学评价方法",
            "C": "体外研究法",
            "D": "临床比较试验法"
        },
        "answer": "A",
        "answer_text": "药物动力学评价方法"
    },
    "5-54": {
        "text": "I期临床药物动力学试验时，下列哪条是错误的",
        "options": {
            "A": "目的是探讨药物在人体内的吸收、分布、消除的动态变化过程",
            "B": "受试者原则上应男性和女性兼有",
            "C": "年龄以18 -45岁为宜",
            "D": "一般应选择目标适应症患者进行"
        },
        "answer": "D",
        "answer_text": "一般应选择目标适应症患者进行"
    },
    "6-1": {
        "text": "药物经肌内注射有吸收过程，一般（ ）药物通过毛细血管壁直接扩散，水溶性药物中分子量（ ）的可以穿过毛细血管内皮细胞膜上的孔隙快速扩散进入毛细血管，分子量（ ）的药物主要通过淋巴系统吸收。",
        "options": {},
        "answer": "",
        "answer_text": "脂溶性；小；很大"
    },
    "6-2": {
        "text": "为达到理想的肺部沉积效率，应控制药物粒子的大小，一般其空气动力学粒径应介于（ ）。",
        "options": {},
        "answer": "",
        "answer_text": "0.5μm - 7.5μm"
    },
    "6-3": {
        "text": "蛋白多肽药物经黏膜吸收是今年研究的热点，主要非口服与注射途径包括（ ）、（ ）、（ ）等。",
        "options": {},
        "answer": "",
        "answer_text": "经鼻腔，经肺部，经直肠（经口腔黏膜等）"
    },
    "6-4": {
        "text": "药物的分布是指药物从给药部位吸收进入血液后，由___运送至___的过程。",
        "options": {},
        "answer": "",
        "answer_text": "循环系统；各脏器组织"
    },
    "6-5": {
        "text": "某些药物连续应用时，常常由于药物从组织解脱入血的速度比进入组织的速度___，导致组织中的药物有浓度逐渐上升的趋势，称为___。",
        "options": {},
        "answer": "",
        "answer_text": "慢；蓄积"
    },
    "6-6": {
        "text": "人血浆中主要有三种蛋白质与大多数药物结合有关，___、___和___。",
        "options": {},
        "answer": "",
        "answer_text": "白蛋白、α一酸性糖蛋白、脂蛋白"
    },
    "6-7": {
        "text": "药物的淋巴管转运主要和药物的___有关。分子量在___以上的大分子物质，经淋巴管转运的选择性倾向很强。",
        "options": {},
        "answer": "",
        "answer_text": "分子量；5000"
    },
    "6-8": {
        "text": "药物向中枢神经系统的转运，主要取决于药物的___性，另外药物与___也能在一定程度上影响血液-脑脊液间的药物分配。",
        "options": {},
        "answer": "",
        "answer_text": "脂溶性；蛋白的结合率"
    },
    "6-9": {
        "text": "药物的组织结合起着药物的___作用，可能延长___。",
        "options": {},
        "answer": "",
        "answer_text": "贮库；作用时间"
    },
    "6-10": {
        "text": "药物与蛋白结合除了受药物的理化性质、给药剂量、药物与蛋白质的亲和力及药物相互作用等因素影响外，还与___、___和___等因素有关。",
        "options": {},
        "answer": "",
        "answer_text": "动物种差、性别差异、生理和病理状态差异"
    },
    "6-11": {
        "text": "分布容积是指假设在药物充分分布的前提下，体内___按血中同样浓度溶解时所需的体液___。",
        "options": {},
        "answer": "",
        "answer_text": "全部药量；总容积"
    },
    "6-12": {
        "text": "对于肝提取率高的药物，首过效应显著，___是主要影响因素；而肝提取率低的药物，受___的影响较大，首过效应不明显。",
        "options": {},
        "answer": "",
        "answer_text": "肝血流量；蛋白结合"
    },
    "6-13": {
        "text": "通常药物代谢被减慢的现象，称为___作用，能使代谢减慢的物质叫做___。",
        "options": {},
        "answer": "",
        "answer_text": "酶抑制；酶抑制剂"
    },
    "6-14": {
        "text": "药物代谢被促进的现象，称为___作用，能使代谢加快的物质叫做___。",
        "options": {},
        "answer": "",
        "answer_text": "酶诱导；酶诱导剂"
    },
    "6-15": {
        "text": "新生儿黄疸是由于___结合不充分引起的疾病。而在新生儿体内恰恰是高度缺乏该结合反应所必须的___。",
        "options": {},
        "answer": "",
        "answer_text": "胆红素和葡萄糖醛酸；葡萄糖醛酸转移酶"
    },
    "6-16": {
        "text": "异烟肼在人体内的主要代谢途径是___，并存在___和___现象。",
        "options": {},
        "answer": "",
        "answer_text": "乙酰化；快乙酰化；慢乙酰化"
    },
    "6-17": {
        "text": "药物代谢酶通常又可分为___和___二大类。前者主要存在于___。",
        "options": {},
        "answer": "",
        "answer_text": "微粒体酶系；非微粒体酶系；肝脏"
    },
    "6-18": {
        "text": "维生素B6能促进多巴脱羧酶的活性，加速脑外的___脱羧转变成___，难于进入脑内，使药物在脑内达不到治疗浓度，作用下降。",
        "options": {},
        "answer": "",
        "answer_text": "左旋多巴；多巴胺"
    },
    "6-19": {
        "text": "机体最重要的排泄器官是（ ）。",
        "options": {},
        "answer": "",
        "answer_text": "肾"
    },
    "6-20": {
        "text": "肾单位由（ ）和（ ）两部分组成。",
        "options": {},
        "answer": "",
        "answer_text": "肾小球、肾小管"
    },
    "6-21": {
        "text": "测定其菊粉清除率，其值可以代表（ ）。",
        "options": {},
        "answer": "",
        "answer_text": "人和动物的肾小球滤过率"
    },
    "6-22": {
        "text": "大多数外源性物质的重吸收过程主要是被动过程，其重吸收的程度取决于药物的（ ）（ ）（ ）（ ）。",
        "options": {},
        "answer": "",
        "answer_text": "脂溶性，pKa，尿量，尿的pH值"
    },
    "6-23": {
        "text": "分子量在（ ）左右的药物有较大的胆汁排泄率。",
        "options": {},
        "answer": "",
        "answer_text": "500"
    },
    "6-24": {
        "text": "药物进入体内后，在血液、组织与体液间瞬时达到平衡，此药物属___室模型药物。",
        "options": {},
        "answer": "",
        "answer_text": "单"
    },
    "6-25": {
        "text": "静脉输注稳态血药浓度Css主要是由___决定，因为一般药物的___基本上是恒定的。",
        "options": {},
        "answer": "",
        "answer_text": "k0, k, V"
    },
    "6-26": {
        "text": "单室模型静脉输注达到稳态的速度与输液速度___关，而由___决定，___越长，达到稳态浓度所需时间也越___。",
        "options": {},
        "answer": "",
        "answer_text": "无，半衰期，长"
    },
    "6-27": {
        "text": "达峰时是指___，AUC是___，滞后时间是指___。",
        "options": {},
        "answer": "",
        "answer_text": "达到峰浓度的时间，血药浓度-时间曲线下面积，给药开始至血液中开始出现药物的时间"
    },
    "6-28": {
        "text": "多剂量给药要求血药浓度达到稳态血药浓度95%需____个T1/2。",
        "options": {},
        "answer": "",
        "answer_text": "4.3"
    },
    # 计算题
    "7-1":{
        "text": "一个病人静脉注射某药10mg，半小时后血药浓度是多少（已知t1/2=4h，V=60L）?",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: C=0.153（ug/ml）"
    },
    "7-2": {
        "text": "某药物静脉注射给药80mg，立即测得血药浓度为10mg/ml，4h后血药浓度降为7.5mg/ml。求该药物的生物半衰期（假定药物以一级速度消除）。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: t_{1/2}=9.6(h)"
    },
    "7-3": {
        "text": "某药半衰期8h，表观分布容积为0.4L/kg，体重60kg的患者静脉注射600 mg，注射后24h，消除的药量占给药剂量的百分比是多少？给药后24h的血药浓度为多少？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: C=3.13ug/ml"
    },
    "7-4": {
        "text": "某药0至0.5h内尿中排出量为37.5mg，在0.25h血浆内药物浓度测定为10ug/ml，求CLr。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: CLr=125(ml/min)"
    },
    "7-5": {
        "text": "已知磺胺嘧啶半衰期为16h，分布容积20L，尿中回收原形药物60%，求总清除率CL，肾清除率CLr，并估算肝代谢清除率CLb。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: CL=14.44(ml/min), CLr=8.66(ml/min), CLb=5.78(ml/min)"
    },
    "7-6": {
        "text": "某药物半衰期为40.8h，则该药物每天消除体内剩余药量的百分之几？",
        "options": {},
        "answer": "",
        "answer_text": "消除百分数=33.48%"
    },
    "7-7": {
        "text": "某药物静脉注射给药50mg，测得0 - 3h的AUC0~3为5.1(mg．h/L)，AUC为22.4(mg．h/L)，累计排泄尿量为11mg。那么，(1)在给药3h后有百分之多少的药物留在体内？(2)总清除率CL是多少？(3)肾清除率CLr是多少？(4)以肾清除方式排泄的药物所占的比重是多少？",
        "options": {},
        "answer": "",
        "answer_text": "(1) 77.2%, (2) 2.2(L/h), (3) 0.49L/h, (4) 0.22"
    },
    "7-8": {
        "text": "某一单室模型药物，生物半衰期为5h，静脉滴注达稳态血药浓度的95%，需要多少时间？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: t=21.6h"
    },
    "7-9": {
        "text": "某患者口服某药500mg后，测得血药浓度如下：...... 已知F=1，求K，ka，tmax,Cmax，V，CL，AUC及给药后10h的血药浓度。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: k=0.068h^{-1}, \\qquad ka=0.247h^{-1}, \\qquad tmax=7.25h, "
                       "\\newline Cmax=29.66ug/ml, \\qquad V=10.37L, \\qquad CL=0.69L/h,"
                       "\\newline AUC=724.6(ug.h/ml)"
    },
    "7-10": {
        "text": "某二室模型药物，静脉注射lOOmg，测得血药浓度一时间数据如下：\nt (h) 0.25 0.5 1.0 1.5 2.0 4.0 8.0 12.0 16.0\nC (mg/L) 43 32 20 14 11 6.5 2.8 1.2 0.52\n试求α，β，A，B，k12，k21，k10，VC。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: α=1.842(h^{-1}), \\qquad  β=0.210(h^{-1}), \\qquad  A=46.88(mg/L), "
                       "\\newline B=15.03(mg/L), \\qquad  k12=0.810(h^{-1}), \\qquad  k21=0.605(h^{-1}), "
                       "\\newline k10=0.636(h^{-1}), VC"
    },
    "7-11": {
        "text": "某患者体重50kg，肾功能正常，每8h静脉注射给予1mg/kg庆大霉素，已知庆大霉素的tl/2 =2h，V=O.2 L/kg。求稳态最大血药浓度、稳态最小血药浓度及平均稳态血药浓度。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: C^{ss}_{max} = 5.33(mg/L), \\quad C^{ss}_{min} = 0.33(mg/L), \\quad \\overline{C_{ss}} = 1.80(mg/L)"
    },
    "7-12": {
        "text": "已知头孢噻肟的消除半衰期为1.5h，表观分布容积为0.17 L/kg。给某患者(体重75kg)连续3d每天静脉注射3次该药l.Og，所得的血药峰浓度为多少？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: C^{ss}_{max} = 80.4(mg/L)"
    },
    "7-13": {
        "text": "在单室模型中，重复静脉注射给药，给药时间间隔为 ，给药剂量为X0 。①求 =tl/2和 =2tl/2时的 ；②达到50%、75%和90%的 ，需要多少个tl/2？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: 当\\tau = t_{1/2}时,X^{ss}_{max} = X_0,当\\tau = 2t_{1/2}时, X^{ss}_{max} = 1.33X_0,"
                       "\\newline 当f_{ss(n)}=50\\%时,n\\tau = t_{1/2}, "
                       "\\newline 当f_{ss(n)}=75\\%时,n\\tau = 2t_{1/2}, 当f_{ss(n)}=90\\%时,n\\tau = 3.32t_{1/2} "
    },
    "7-14": {
        "text": "某患者每8h口服lOOmg舒马普坦，已知舒马普坦的总清除率为250ml/min，生物利用度约为14%。求5个剂量后的平均血药浓度。（假定已达到稳态）",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: \\overline{C_{ss}}=0.12(mg/L)"
    },
    "7-15": {
        "text": "某药物按非线性动力学消除，已知Km为50mg/L，Vm为20mg/(L.h)，表观分布容积V为20L/kg。\n(1)若静脉注射给药1Omg/kg，试分析这种情况下该药物的消除动力学特征如何？\n(2)上述情况下，消除掉50%的药物，需要多长时间（即消除半衰期）?\n(3)如果静脉注射给药剂量为lOOmg/kg，则该药物的消除动力学特征又如何？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: (1)已知该药物按非线性动力学消除，C_0=X_0/V= 10/20=0.5mg/L，"
                       "\\newline 此时C_0<<K_m,因此，消除相当于线性一级动力学消除过程，"
                       "\\newline 消除速度常数K=20/50 =0.4h^{-1}。"
                       "\\newline (2)上述情况下，消除掉50\\%的药物所需的时间即消除半衰期为t_{1/2}=0.693/k=0.693/0.4=1.73h。"
                       "\\newline (3)当静脉注射给药剂量为lOOmg/kg时，C_0=X_0/V= 100/20=5mg/L，"
                       "\\newline 则该药物的消除动力学为非线性特征，符合Michaelis-Menten方程。"
    },
    "7-16": {
        "text": "某药物消除的Vm为lOumol/(L.h)，当该药浓度为4umol/L时，消除速度为5 umol/(L．h)。试问该药的Km为多少？当血药浓度降为1umol/L时药物的消除速度为多大？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: (1)根据Michaelis-Menten方程有， 5=\\frac{10 \\times 4}{K_m + 4}, K_m=40 \\mu mol/L; "
                       "\\newline (2) 当血药浓度降为1\\mu mol/L时，药物的消除速度为2[\\mu mol/(L．h)]"
    },
    "7-17": {
        "text": "某药以50mg/h静脉滴注，7.5h后停止滴注，测得血药浓度数值见下表：\n\nt(h)\t0\t2\t4\t6\t7.5\t9\t12\t15\nC(ug/ml)\t0\t3.4\t5.4\t6.5\t7.0\t4.6\t2.0\t0.9\n\n试用统计矩方法计算参数ke, t1/2, CL,Vss各是多少？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解：对最后三组数据进行线性同归(lgC-t)，得：\\lambda=0.2719(h^{-1}), "
                       "\\newline k_e= 0.2698(h^{-1}), \\quad t_{1/2}=0.693(h), \\quad V_{ss}=22.98(L),  \\quad CL=6.2(L/h)"
    },
    "7-18": {
        "text": "某药物在经典药物动力学研究中属于双室模型，当静脉注射该药物1g时，得到下列药物浓度数据：\n\nt(h)\t0\t0.165\t0.5\t1.0\t1.5\t3.0\t5\t7.5\t10\nC(ug/ml)\t100\t65.03\t28.69\t10.04\t4.93\t2.29\t1.36\t0.71\t0.38\n\n试用统计矩方法计算参数β, t1/2(β), CL,Vss各是多少？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解：对曲线最后四点进行线性回归(lgC-t)，得：\\lambda=0.257(h^{-1}), "
                       "\\newline \\beta= 0.657(h^{-1}), \\quad t_{1/2(\\beta)}=1.05(h), \\quad V_{ss}=26.6(L), \\quad CL=17.47(L/h)"
    },
    "7-19": {
        "text": "双氯西林的蛋白结合率为97%，消除半衰期为42 min，表观分布容积为20L。若每6h静脉注射250mg双氯西林，求稳态游离浓度。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: \\overline{C_{ss}} = \\frac{X_0}{kV\\tau} = \\frac{250}{\\frac{0.693}{42}\\times 20 \\times 6 \\times 60} = 2.1(\\mu g/ml) 由于双氯西林的蛋白结合率为97\\%，则游离药物为3\\%，游离药物浓度为0.03×2.1=0.063(JLg/ml)"
    },
    "7-20": {
        "text": "已知某抗生素的消除半衰期为8h，治疗浓度范围为25 - 50mg/L，每次静脉注射剂量维持恒定，求给药间隔时间。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: \\tau = 1.44t_{1/2} \\cdot  ln \\frac{C^{ss}_{max}}{C^{ss}_{min}} = 1.44 \\times 8 \\times ln \\frac{50}{25} = 8.0(h)"
    },
    "7-21": {
        "text": "一种符合单室模型的抗心律不齐药物，期望的血药浓度为5 mg/L，表观分布容积为0.173 L/kg，消除半衰期为2.0h。①一位成年男性患者（56岁，体重75kg）对药物治疗的反应不佳。测得其血药浓度为2 mg/L。如何调整静脉滴注速度以使血药浓度达到期望的5 mg/L?②若不给予负荷剂量，且其表观分布容积不变，要使血药浓度达到稳态的95%，需要多长时间？",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: 正常情况下， k_0 = C_{ss}kV = 5 \\times \\frac{0.693}{2} \\times 0.173 \\times 75 = 22.5(mg/h). "
                       "\\newline ①当以上述静脉滴注速度给予该成年男性患者时，血药浓度为2 mg/L，"
                       "\\newline 说明药物在该患者的消除比正常人快，则: CL_{患者} = \\frac{k_0}{C_{ss, 患者}} = \\frac{22.5}{2} = 11.25(L/h), "
                       "\\newline k_{0, 患者} = C_{ss}CL_{患者} = 5 \\times 11.25 = 56.2(mg/h). "
                       "\\newline ② n= -3.32lg(1-f_{ss(n)})=-3.32lg(1-0.95)=4.32, nt_{1/2}=4.32 \\times 2 = 8.64 (h)"
    },
    "7-22": {
        "text": "1.	某药的有效血药浓度为2. 5ug/ml，欲制成每天给药1次的口服缓释制剂，请设计剂量（K=0.2h-1，ka=2.0h-1，F=l，V=8L）",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: 因为 C_{ss} = 2.5 \\mu g/ml, K = 0.2h^{-1}, ka = 2.0h^{-1}, F=1, V=8L, "
                       "\\newline 我们需要计算剂量Dose。根据公式：C_{ss} = \\frac{Dose \\times F}{ka \\times V}, "
                       "\\newline 将已知的值代入公式，得到：2.5 = \\frac{Dose \\times 1} {2.0 \\times 8}, "
                       "\\newline 得到： 2.5 = \\frac{Dose}{16}, 得到：Dose = 2.5 \\times 16 = 40 \\mu g = 0.04 mg, 因此，设计的剂量为349 mg。"
    },
    "7-23": {
        "text": "某药有静脉注射剂、口服片剂与栓剂三种制剂，经生物利用度研究，某受试者用三种制剂后得到的血药浓度数据如下表。请计算该受试者口服片剂和栓剂的绝对生物利用度，静脉注射剂、口服片剂的给药剂量均为300mg，栓剂的给药剂量为250mg。",
        "options": {},
        "answer": "latex:",
        "answer_text": "解: \\newline "
                       "根据提示，我们可以使用梯形法计算每种制剂的AUC（曲线下面积），"
                       "\\newline 然后使用公式(14-7)计算口服片剂和栓剂的绝对生物利用度。"
                       "\\newline首先，我们计算各剂型的AUC。"
                       "\\newline 根据给定的数据，我们可以使用梯形法来估计AUC。"
                       "\\newline 下面是每种制剂的AUC计算：静脉注射剂的AUC："
                       "\\newline AUC_{IV} = \\frac{(0.167+0.333)(332+301)}{2} + \\frac{(0.333+0.5)(301+277)}{2} "
                       "\\newline + \\frac{(0.5+1)(277+259)}{2} + \\frac{(1+2)(259+221)}{2} + "
                       "\\newline \\frac{(2+3)(221+175)}{2} + \\frac{(3+4)(175+140)}{2} + \\frac{(4+6)(140+76)}{2} "
                       "\\newline + \\frac{(6+8)(76+46)}{2} + "
                       "\\newline \\frac{(8+10)(46+35)}{2}, AUC_{IV} = 8949 \\mu g ⋅ h/mL. "
                       "\\newline 口服片剂的AUC：AUC_{oral} = \\frac{(0.167+0.333)(16+36)}{2} + \\frac{(0.333+0.5)(36+53)}{2} "
                       "\\newline + \\frac{(0.5+1)(53+82)}{2} + "
                       "\\newline \\frac{(1+2)(82+168)}{2} + \\frac{(2+3)(168+164)}{2} + \\frac{(3+4)(164+150)}{2} "
                       "\\newline + \\frac{(4+6)(150+112)}{2} + "
                       "\\newline \\frac{(6+8)(112+54)}{2} + \\frac{(8+10)(54+27)}{2}, AUC_{oral} = 3085 \\mu g ⋅ h/mL. "
                       "\\newline 栓剂的AUC：首先，我们需要进行剂量校正。由于栓剂的给药剂量为250 mg，"
                       "\\newline 而其他剂型的给药剂量为300 mg， 我们需要将栓剂的AUC进行剂量校正。"
                       "\\newline AUC_{rectal, corrected} = AUC_{rectal} \\times 250/300, "
                       "\\newline 其中，AUC_{rectal}是栓剂的原始AUC。根据给定的数据，"
                       "\\newline 我们可以计算出口服片剂的绝对生物利用度为 75.66\\% ，"
                       "\\newline 栓剂的绝对生物利用度为 88.38\\%。"
    }
}

def display_questions(start, end):
    st.title('药物代谢动力学试卷展示')

    for question_id, question in questions.items():
        if start <= int(question_id) <= end:
            st.write(f'{question_id}. {question["text"]}')
            for option_key, option_value in question['options'].items():
                st.write(f'{option_key}. {option_value}')
            st.write('---')

def display_question(question_number, question_data):
    st.subheader(f"题目 {question_number}:")
    st.write(question_data['text'])

def search_question(keyword):
    results = []
    for question_number, question_data in questions.items():
        if keyword in question_data['text']:
            results.append(question_number)
    return results

def main():
    st.title("药物代谢动力学试卷展示应用")
    # display_questions(1,7)
    # 搜索框
    search_keyword = st.text_input('输入关键字搜索题目：')

    # 搜索按钮
    search_button = st.button('搜索')

    if search_button:
        # 执行搜索
        search_results = search_question(search_keyword)

        # 显示搜索结果
        if search_results:
            st.markdown('### 搜索结果：')
            for question_num in search_results:
                # Retrieve question data based on the question number
                question_data = questions.get(str(question_num))
                # Display the question and options
                if question_data:
                    st.markdown(f"**{question_num}.{question_data['text']}**")
                    for option, text in question_data['options'].items():
                        st.markdown(f'- {option}. {text}')
                    if question_data["answer"] == "latex:":
                        latex_code = question_data["answer_text"]  # 获取公式文字的变量
                        rendered_latex = r"$$" + latex_code + r"$$"
                        st.markdown(rendered_latex, unsafe_allow_html=True)
                    else:
                        st.markdown(f'答案：{question_data["answer"]}  <span style="background-color: yellow;">{question_data["answer_text"]}</span>', unsafe_allow_html=True)
                    st.markdown('---')
                else:
                    st.error("Question not found!")
        else:
            st.markdown('### 搜索结果：无匹配题目')

    # 显示所有题目
    # st.markdown('### 所有题目：')
    # for question_num, question_data in questions.items():
    #     st.markdown(f'**题目 {question_num}:** {question_data["text"]}')
    #     for option, text in question_data['options'].items():
    #         st.markdown(f'- {option}. {text}')
    #     st.markdown('---')


if __name__ == '__main__':
    main()


