# -*- UTF-8-*- 
# Author : David Vane

# -*- coding: utf-8 -*-

import streamlit as st

questions = {
    "1-1": {
        "text": "执业药师变更执业单位时，须到原执业药师注册机构办理再次注册手续（）",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-2": {
        "text": "执业药师注册期3年内参加继续教育所获得总学分累计不得少于30分（）",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-3": {
        "text": "取得本科学历者须工作满5年方可申请参加执业药师考试( )",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-4": {
        "text": "粉针剂通常是作为非处方药（）",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-5": {
        "text": "医疗保险基金准予支付列入《基本医疗保险药品目录》中的西药 ( )",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-6": {
        "text": "各省可以根据本地实际情况对“甲类目录”中的药品进行调整（）",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-7": {
        "text": "医疗保险基金准予支付列入《基本医疗保险药品目录》中的中药饮片 ( )",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-8": {
        "text": "处方药在零售药店可以采用开架自选的方式（）",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-9": {
        "text": "药品生产、批发企业可以直接向患者推荐、销售处方药（）",
        "options": {},
        "answer": "x",
        "answer_text": "x"
    },
    "1-10": {
        "text": "处方药与非处方药应当分柜台摆放（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-11": {
        "text": "根据药品的安全性评价，非处方药分为甲类和乙类（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-12": {
        "text": "乙类非处方药可以在药品监督管理部门批准的超市内零售（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-13": {
        "text": "国家药品监督管理局与上海市药品监督管理局之间是行政隶属关系（）",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-14": {
        "text": "我国药品监督检验机构共分四级（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-15": {
        "text": "中国食品药品检定研究院所负责标定和管理国家药品标准品、对照品（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-16": {
        "text": "美国的药品监督管理组织是FDA（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-17": {
        "text": "《药品生产许可证》有效期是5年（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-18": {
        "text": "《药品经营许可证》有效期是5年（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-19": {
        "text": "药品质量的内涵包括真伪、纯度、品质优良度三方面（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-20": {
        "text": "同一药物剂型不同，其药效也不相同（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-21": {
        "text": "同一药物剂型不同，其药效作用的强度和速度也不同（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-22": {
        "text": "同一药物剂型不同，其不良反应也不同（）",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-23": {
        "text": "药物上市前研究包括临床前研究和临床研究 （）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-24": {
        "text": "药物临床前研究中的安全性评价必须执行GCP（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-25": {
        "text": "药物临床研究必须执行GCP（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-26": {
        "text": "制剂的安全性包括刺激性试验、溶血试验、过敏试验三项（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-27": {
        "text": "制剂的稳定性包括化学稳定性和物理稳定性二项（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-28": {
        "text": "制剂稳定性试验常用方法是在室温条件下留样观察（）",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-29": {
        "text": "镇痛药需要做药物依赖性试验（）",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-30": {
        "text": "药品生产企业是指生产药品的专营企业或者兼营企业。   ",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-31": {
        "text": "药品生产许可证电子证书与纸质证书具有同等法律效力。 ",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-32": {
        "text": "药品委托生产的委托方应当是取得该药品批准文号的药品生产企业,负责委托生产药品的质量和销售。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-33": {
        "text": "药品生产许可证分为正本和副本。 ",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-34": {
        "text": "药品生产许可证载明事项分为许可事项和登记事项",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-35": {
        "text": "GMP规定注射用水可采用90°C以上保温循环的方式保存。   ",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-36": {
        "text": "每批药品应当有批记录,批记录应当由质量管理部门负责管理,至少保存至药品有效期后3年。   ",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-37": {
        "text": "质量标准、工艺规程、操作规程、稳定性考察等重要文件应当长期保存。 ",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-38": {
        "text": "无《药品经营许可证》的，不得经营药品。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-39": {
        "text": "开办药品批发企业，须经企业所在地的省级药监部门批准。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-40": {
        "text": "开办药品批发企业，须经企业所在地县级以上药监部门批准。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-41": {
        "text": "开办药品零售企业，须经企业所在地县级以上药监部门批准。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-42": {
        "text": "开办药品零售企业，须经企业所在地省级药监部门批准。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-43": {
        "text": "开办药品零售企业应符合方便群众购药的原则。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-44": {
        "text": "药品生产企业可以销售他人生产的药品。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-45": {
        "text": "药品生产企业可以销售本企业受委托生产的药品。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-46": {
        "text": "药品生产企业只能销售本企业生产的药品。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-47": {
        "text": "药品经营企业可以以展示会的方式现货销售药品。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-48": {
        "text": "药品经营企业可以购进和销售医疗机构配制的制剂。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-49": {
        "text": "药品经营企业可以擅自改变经营方式。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-50": {
        "text": "药品经营企业应当按照《药品经营许可证》许可的经营范围经营药品。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-51": {
        "text": "药品经营企业可以以买商品赠药品的方式向公众赠送处方药。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-52": {
        "text": "药师具有处方权和调剂处方权。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-53": {
        "text": "经注册的执业医师可以在任何医院取得处方权。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-54": {
        "text": "普通处方用纸为白色。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-55": {
        "text": "急诊处方用纸为白色。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-56": {
        "text": "儿科处方用纸为淡黄色。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-57": {
        "text": "麻醉药品处方用纸为淡红色。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-58": {
        "text": "第二类精神药品处方用纸为白色。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-59": {
        "text": "第一类精神药品处方用纸为白色。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-60": {
        "text": "中药饮片应当单独开具处方。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-61": {
        "text": "处方中的药品一般不超过7日用量。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-62": {
        "text": "麻醉药品和第一类精神药品的临床试验，可以以健康人为受试对象。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-63": {
        "text": "国家对麻醉药品和精神药品实行定点生产制度。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-64": {
        "text": "麻醉药品和第一类精神药品可以零售。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-65": {
        "text": "药品标签可以以涂改的方式进行修改。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-66": {
        "text": "目前，我国的药品广告由国家药品监督管理部门审批。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-67": {
        "text": "在药品包装上，药品的商品名可以与通用名称同行书写。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-68": {
        "text": "在药品包装上，药品商品名的字体和颜色不得比通用名称更突出和显著。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-69": {
        "text": "新药监测期已满的药品，报告该药品引起的所有不良反应。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-70": {
        "text": "新药监测期内的药品，报告该药品发生的所有不良反应。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-71": {
        "text": "必要时，可以越级报告药品不良反应。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-72": {
        "text": "药品不良反应实行逐级、定期报告制度。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-73": {
        "text": "我国对新药品种设立不超过5年的监测期。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-74": {
        "text": "在新药监测期内，国家药品监督管理局可以批准其他企业生产和进口该药品。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-75": {
        "text": "医药发明专利权的期限是10年。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "1-76": {
        "text": "受保护的中药品种分为三级。",
        "options": {},
        "answer": "",
        "answer_text": "x"
    },
    "2-1": {
        "text": "《执业药师资格制度暂行规定》明确执业药师资格注册机构为  （）",
        "options": {
            "A": "国家食品药品监督管理局",
            "B": "人事部",
            "C": "省级药品监督管理局",
            "D": "省级人事局（厅）",
            "E": "省、地、县药品监督管理局"
        },
        "answer": "C",
        "answer_text": "省级药品监督管理局"
    },
    "2-2": {
        "text": "执业药师资格考试属于（）",
        "options": {
            "A": "职业资格准入考试",
            "B": "主管药师资格认定考试",
            "C": "检验药学专业技术人员综合知识的考试",
            "D": "选拔负责药品质量岗位的专业技术人才的考试",
            "E": "为生产、经营企业考核质量管理人员的考试"
        },
        "answer": "A",
        "answer_text": "职业资格准入考试"
    },
    "2-3": {
        "text": "执业药师是（）",
        "options": {
            "A": "药学技术人员的技术职称",
            "B": "我国对药学技术人员实行职业准入控制制度的产物",
            "C": "我国对药学技术人员实行准入制度的称法",
            "D": "我国对药学技术人员实行控制的一种方式",
            "E": "我国对药学技术人员实行职称评定的形式"
        },
        "answer": "C",
        "answer_text": "我国对药学技术人员实行准入制度的称法"
    },
    "2-4": {
        "text": "执业药师的执业范围是（）",
        "options": {
            "A": "药品研制、药品生产、药品经营",
            "B": "药品生产、药品经营、药品使用",
            "C": "药品生产、药品经营、药品检验",
            "D": "药品经营、药品使用、药品检验",
            "E": "药品研制、药品经营、药品使用"
        },
        "answer": "C",
        "answer_text": "药品生产、药品经营、药品检验"
    },
    "2-5": {
        "text": "与《执业药师资格制度暂行规定》不符的内容有（）",
        "options": {
            "A": "执业药师资格考试合格者，由省人事部门颁发《执业药师资格证书》，该证书在全国范围内有效",
            "B": "人事部及省级人事（职改）部门为执业药师的注册管理机构",
            "C": "未经注册者，不得以执业药师身份执业",
            "D": "凡从事药品生产、经营、使用的单位，均应配备相应的执业药师",
            "E": "一个执业药师只能在一个省、自治区、直辖市注册"
        },
        "answer": "E",
        "answer_text": "一个执业药师只能在一个省、自治区、直辖市注册"
    },
    "2-6": {
        "text": "指出正确有效期限（）",
        "options": {
            "A": "执业药师注册有效期为三年",
            "B": "《药品生产许可证》的有效期为三年",
            "C": "药品批准文号有效期为三年",
            "D": "《进口药品生产许可证》有效期为三年",
            "E": "新药的监护期为不超过三年"
        },
        "answer": "A",
        "answer_text": "执业药师注册有效期为三年"
    },
    "2-7": {
        "text": "《药品管理法》规定，对疗效不确、不良反应大或者其他原因危害人民健康的药品，应当 （）",
        "options": {
            "A": "进行再评价",
            "B": "立即停止生产、经营、使用",
            "C": "撤消其批准文件",
            "D": "按假药处理",
            "E": "按劣药处理"
        },
        "answer": "C",
        "answer_text": "撤消其批准文件"
    },
    "2-8": {
        "text": "按照处方药与非处方药分类管理办法,购买非处方药由 （）",
        "options": {
            "A": "医师处方",
            "B": "社区医护人员处方",
            "C": "消费者自主选购",
            "D": "生产厂家销售人员推荐",
            "E": "药店销售人员介绍"
        },
        "answer": "C",
        "answer_text": "消费者自主选购"
    },
    "2-9": {
        "text": "非处方药分为甲、乙类是根据（）",
        "options": {
            "A": "药品的质量",
            "B": "药品的价格",
            "C": "药品的有效性",
            "D": "药品的安全性",
            "E": "药品的稳定性"
        },
        "answer": "D",
        "answer_text": "药品的安全性"
    },
    "2-10": {
        "text": "药品分类管理的原则和宗旨（）",
        "options": {
            "A": "方便群众购药",
            "B": "利于加强药品监督管理工作",
            "C": "保证人民用药安全有效、使用方便",
            "D": "利于医疗保障制度的建立",
            "E": "利于药品价格控制"
        },
        "answer": "A",
        "answer_text": "方便群众购药"
    },
    "2-11": {
        "text": "新药是指（）",
        "options": {
            "A": "我国从未生产过的药品",
            "B": "未曾在中国境内上市销售的药品",
            "C": "未收载于国家标准的药品",
            "D": "我国未使用过的药品",
            "E": "未曾在中国生产销售的药品"
        },
        "answer": "B",
        "answer_text": "未曾在中国境内上市销售的药品"
    },
    "2-12": {
        "text": "药品监督管理的目的是（）",
        "options": {
            "A": "保证药品质量，提高和维护全民族的身体素质",
            "B": "提高药品质量，保障人民用药安全",
            "C": "保证药品质量、保障人体用药安全，维护人民身体健康和用药的合法权益",
            "D": "提高药品疗效，维护人民身体健康",
            "E": "提高药品疗效，维护人民用药的合法权益"
        },
        "answer": "C",
        "answer_text": "保证药品质量、保障人体用药安全，维护人民身体健康和用药的合法权益"
    },
    "2-13": {
        "text": "按照处方药与非处方药分类管理办法,购买非处方药由  （）",
        "options": {
            "A": "医师处方",
            "B": "社区医护人员处方",
            "C": "消费者自主选购",
            "D": "生产厂家销售人员推荐",
            "E": "药店销售人员介绍"
        },
        "answer": "C",
        "answer_text": "消费者自主选购"
    },
    "2-14": {
        "text": "主管全国药品监督管理工作的是（）",
        "options": {
            "A": "国务院食品药品监督部门",
            "B": "国务院卫生行政部门",
            "C": "国务院产品质量监督部门",
            "D": "国务院食品药品监督管理部门",
            "E": "国务院工商行政管理部门"
        },
        "answer": "A",
        "answer_text": "国务院食品药品监督部门"
    },
    "2-15": {
        "text": "药品检验机构的职责是（）",
        "options": {
            "A": "依法实施药品审批工作",
            "B": "依法实施药品审批和药品质量监督检查所需的药品检验工作",
            "C": "依法实施药品监督检查检验工作",
            "D": "依法实施市售药品的抽样和检验工作",
            "E": "依法实施药品标准的复核"
        },
        "answer": "B",
        "answer_text": "依法实施药品审批和药品质量监督检查所需的药品检验工作"
    },
    "2-16": {
        "text": "负责国家药品标准的制定和修订的技术权威机构是（）",
        "options": {
            "A": "中央检验所",
            "B": "国家药典委员会",
            "C": "药品审评中心",
            "D": "药品认证中心",
            "E": "国家质量技术委员会"
        },
        "answer": "B",
        "answer_text": "国家药典委员会"
    },
    "2-17": {
        "text": "下列哪种情况的药品是假药？",
        "options": {
            "A": "更改生产批号的",
            "B": "被污染的",
            "C": "超过有效期的",
            "D": "药品所含成份与国家药品标准规定的成份不符",
            "E": "其他不符合药品标准规定的"
        },
        "answer": "D",
        "answer_text": "药品所含成份与国家药品标准规定的成份不符"
    },
    "2-18": {
        "text": "列入国家药品标准的药品名称为（）",
        "options": {
            "A": "商品名",
            "B": "英文名",
            "C": "通用名",
            "D": "汉语拼音名",
            "E": "常用名"
        },
        "answer": "C",
        "answer_text": "通用名"
    },
    "2-19": {
        "text": "我国药品注册的法定管理机构是（）",
        "options": {
            "A": "商务部",
            "B": "中华人民共和国卫生部",
            "C": "国家药品监督管理局",
            "D": "国家计划委员会",
            "E": "国家技术监督管理"
        },
        "answer": "C",
        "answer_text": "国家药品监督管理局"
    },
    "2-20": {
        "text": "药品的每个最小销售单元的包装必须（）",
        "options": {
            "A": "按照规定附产品宣传品",
            "B": "按照规定印有标签并附有说明书",
            "C": "按照规定印有标签",
            "D": "按照规定附有说明书",
            "E": "按照规定印上标签和说明"
        },
        "answer": "B",
        "answer_text": "按照规定印有标签并附有说明书"
    },
    "2-21": {
        "text": "“中华人民共和国药品管理法”的适用范围是（）",
        "options": {
            "A": "药品研制、检验、信息咨询的单位",
            "B": "在中华人民共和国境内从事药品研制、生产、经营、使用和监督管理活动",
            "C": "所有与药品相关的单位或者个人",
            "D": "所有从事药品使用的单位或者个人",
            "E": "中国境内从事药品的生产、经营和使用的单位或者个人"
        },
        "answer": "B",
        "answer_text": "在中华人民共和国境内从事药品研制、生产、经营、使用和监督管理活动"
    },
    "2-22": {
        "text": "药品经营企业购销药品和医疗机构购进药品，必须有（）",
        "options": {
            "A": "真实完整的购销记录",
            "B": "实事求是的记录",
            "C": "准确无误的购销记录",
            "D": "整齐完全的购销记录",
            "E": "完整的购销记录"
        },
        "answer": "A",
        "answer_text": "真实完整的购销记录"
    },
    "2-23": {
        "text": "下列将被视为劣药的是（）",
        "options": {
            "A": "被污染的",
            "B": "药品成份的含量不符合国家药品标准",
            "C": "变质的",
            "D": "试生产期的"
        },
        "answer": "B",
        "answer_text": "药品成份的含量不符合国家药品标准"
    },
    "2-24": {
        "text": "直接接触药品的包材和容器，必须符合（）",
        "options": {
            "A": "药品的质量要求",
            "B": "药品的药用要求",
            "C": "药用要求和保障人体健康、安全的标准，并经药监部门批准注册",
            "D": "保障人体健康、安全的标准",
            "E": "药监部门批准注册的要求"
        },
        "answer": "C",
        "answer_text": "药用要求和保障人体健康、安全的标准，并经药监部门批准注册"
    },
    "2-25": {
        "text": "《药品管理法》规定药品必须符合（）",
        "options": {
            "A": "国家药品标准或者省、自治区、直辖市药品标准",
            "B": "国家药品标准",
            "C": "国务院药品监督管理局批准的药品标准",
            "D": "国务院卫生行政部门颁布的药品标准",
            "E": "国家技术监督局批准的药品标准"
        },
        "answer": "A",
        "answer_text": "国家药品标准或者省、自治区、直辖市药品标准"
    },
    "2-26": {
        "text": "《药品管理法》规定，对疗效不确、不良反应大或者其他原因危害人民健康的药品，应当（）",
        "options": {
            "A": "进行再评价",
            "B": "立即停止生产、经营、使用",
            "C": "撤消其批准文件",
            "D": "按假药处理",
            "E": "按劣药处理"
        },
        "answer": "C",
        "answer_text": "撤消其批准文件"
    },
    "2-27": {
        "text": "针对国内发生重大灾害、疫情及其他突发事件的可能，国家对药品采取（）",
        "options": {
            "A": "药品的储备制度",
            "B": "药品的再评价制度",
            "C": "特殊的审批制度",
            "D": "药品的审批制度",
            "E": "药品的保护制度"
        },
        "answer": "A",
        "answer_text": "药品的储备制度"
    },
    "2-28": {
        "text": "从事药品生产活动，应当经所在地（）人民政府药品监督管理部门批准",
        "options": {
            "A": "省、自治区、直辖市",
            "B": "市",
            "C": "县",
            "D": "区"
        },
        "answer": "A",
        "answer_text": "省、自治区、直辖市"
    },
    "2-29": {
        "text": "对儿童用药品应该予以（）",
        "options": {
            "A": "优先审评审批",
            "B": "特殊审评审批",
            "C": "快速审评审批",
            "D": "普通审评审批"
        },
        "answer": "A",
        "answer_text": "优先审评审批"
    },
    "2-30": {
        "text": "在药品购销活动中发现假劣药应及时（）",
        "options": {
            "A": "退货",
            "B": "换货",
            "C": "销毁",
            "D": "报告当地药监部门",
            "E": "追查货源"
        },
        "answer": "D",
        "answer_text": "报告当地药监部门"
    },
    "2-31": {
        "text": "药品的内包装应能（）",
        "options": {
            "A": "保证药品在生产过程中的质量",
            "B": "保证药品在运输、储存中的质量",
            "C": "保证药品在使用过程中的质量",
            "D": "保证药品在生产、运输、储存及使用过程中的质量，并便于医疗使用",
            "E": "保证药品的质量，确保使用安全"
        },
        "answer": "D",
        "answer_text": "保证药品在生产、运输、储存及使用过程中的质量，并便于医疗使用"
    },
    "2-32": {
        "text": "药品生产（经营）许可证的有效期是（）",
        "options": {
            "A": "1年",
            "B": "2年",
            "C": "3年",
            "D": "4年",
            "E": "5年"
        },
        "answer": "E",
        "answer_text": "5年"
    },
    "2-33": {
        "text": "药品的批准文号、“进口药品注册证”、“医药产品注册证”的有效期是（）",
        "options": {
            "A": "5年",
            "B": "4年",
            "C": "3年",
            "D": "2年",
            "E": "1年"
        },
        "answer": "A",
        "answer_text": "5年"
    },
    "2-34": {
        "text": "下列哪个不能成为药品上市许可持有人（）",
        "options": {
            "A": "药厂",
            "B": "药物研究所",
            "C": "高校的药物研究院",
            "D": "新药发明人"
        },
        "answer": "D",
        "answer_text": "新药发明人"
    },
    "2-35": {
        "text": "药品经营企业和医疗机构购进药品，必须建立并执行的制度是（）",
        "options": {
            "A": "合理的验收制度",
            "B": "科学的检查制度",
            "C": "登记制度",
            "D": "进货检查验收制度",
            "E": "养护制度"
        },
        "answer": "D",
        "answer_text": "进货检查验收制度"
    },
    "2-36": {
        "text": "药品经营企业、医疗机构在药品保管和出入库方面应制定、执行的制度是（）",
        "options": {
            "A": "检查制度",
            "B": "保管制度",
            "C": "验收制度",
            "D": "分类登记制度",
            "E": "保管制度和检查制度"
        },
        "answer": "E",
        "answer_text": "保管制度和检查制度"
    },
    "2-37": {
        "text": "政府（）向居民提供免疫规划疫苗。",
        "options": {
            "A": "免费",
            "B": "自费",
            "C": "部分自费"
        },
        "answer": "A",
        "answer_text": "免费"
    },
    "2-38": {
        "text": "（）负责全国疫苗监督管理工作。",
        "options": {
            "A": "国务院药品监督管理部门",
            "B": "省药品监督管理部门",
            "C": "国务院卫生健康管理部门",
            "D": "国务院农业部门"
        },
        "answer": "A",
        "answer_text": "国务院药品监督管理部门"
    },
    "2-39": {
        "text": "开展疫苗临床试验，应当经（）依法批准",
        "options": {
            "A": "国务院药品监督管理部门",
            "B": "省药品监督管理部门",
            "C": "国务院卫生健康管理部门",
            "D": "国务院农业部门"
        },
        "answer": "A",
        "answer_text": "国务院药品监督管理部门"
    },
    "2-40": {
        "text": "对疾病预防、控制急需的疫苗和创新疫苗，国务院药品监督管理部门应当予以（）。",
        "options": {
            "A": "快速审评审批",
            "B": "优先审评审批",
            "C": "特殊审评审批",
            "D": "紧急审评审批"
        },
        "answer": "B",
        "answer_text": "优先审评审批"
    },
    "2-41": {
        "text": "药品注册管理遵循（）原则",
        "options": {
            "A": "公开",
            "B": "公平",
            "C": "公正",
            "D": "公开、公平、公正"
        },
        "answer": "D",
        "answer_text": "公开、公平、公正"
    },
    "2-42": {
        "text": "药物非临床安全性评价研究机构和药物临床试验机构必须分别执行（）",
        "options": {
            "A": "GAP和GUP",
            "B": "GMP和GSP",
            "C": "GLP和GCP",
            "D": "GLP和GUP",
            "E": "GLP和GSP"
        },
        "answer": "C",
        "answer_text": "GLP和GCP"
    },
    "2-43": {
        "text": "药品上市许可持有人应当对药品的（）进行进一步确证",
        "options": {
            "A": "安全性",
            "B": "有效性",
            "C": "质量可控性",
            "D": "安全性、有效性和质量可控性"
        },
        "answer": "D",
        "answer_text": "安全性、有效性和质量可控性"
    },
    "2-44": {
        "text": "《药品生产许可证》的许可事项包括( )",
        "options": {
            "A": "企业名称、法定代表人、注册地址、企业类型",
            "B": "企业负责人、注册地址、企业类型",
            "C": "企业生产范围、生产地址",
            "D": "企业名称、生产范围、注册地址、企业类型",
            "E": "企业名称、法定代表人、生产范围、生产地址"
        },
        "answer": "C",
        "answer_text": "企业生产范围、生产地址"
    },
    "2-45": {
        "text": "GMP规定，不得互相兼任的部门负责人为( )",
        "options": {
            "A": "药品生产和药品销售部门负责人",
            "B": "药品生产和质量管理部门负责人",
            "C": "药品销售和质量管理部门负责人"
        },
        "answer": "B",
        "answer_text": "药品生产和质量管理部门负责人"
    },
    "2-46": {
        "text": "负责注射剂、放射性药品生产企业GMP认证工作的是( )",
        "options": {
            "A": "国家药品认证委员会",
            "B": "国家食品药品监督管理局",
            "C": "国家食品药品监督管理局药品认证管理中心",
            "D": "国家食品药品监督管理局药品评价管理中心",
            "E": "省级药品监督管理部门"
        },
        "answer": "C",
        "answer_text": "国家食品药品监督管理局药品认证管理中心"
    },
    "2-47": {
        "text": "药品说明书和标签中的表述应当（）",
        "options": {
            "A": "科学、规范、准确",
            "B": "科学、规范、清晰",
            "C": "准确、客观、严谨",
            "D": "科学、主观、准确"
        },
        "answer": "A",
        "answer_text": "科学、规范、准确"
    },
    "2-48": {
        "text": "药品召回分为( )",
        "options": {
            "A": "主动召回和被动召回",
            "B": "主动召回和责令召回",
            "C": "主动召回和限期召回",
            "D": "限期召回和责令召回",
            "E": "主观召回和客观召回"
        },
        "answer": "B",
        "answer_text": "主动召回和责令召回"
    },
    "2-49": {
        "text": "适合洁净级别D级的生产操作有( )",
        "options": {
            "A": "高污染风险产品灌装(或灌封)",
            "B": "无菌原料药的粉碎、过筛和混合",
            "C": "灌装前可除菌过滤的药液或产品的配制",
            "D": "非无菌原料药精制、干燥、粉碎等操作的暴露环境",
            "E": "体外免疫诊断试剂的阳性血清的分装"
        },
        "answer": "B",
        "answer_text": "无菌原料药的粉碎、过筛和混合"
    },
    "2-50": {
        "text": "个人和组织发现药品生产企业进行违法生产的活动，有权向（ ）部门举报。",
        "options": {
            "A": "公安部门",
            "B": "质量监督局",
            "C": "法院",
            "D": "药品监督管理部门"
        },
        "answer": "D",
        "answer_text": "药品监督管理部门"
    },
    "2-51": {
        "text": "《药品经营质量管理规范》的适用范围是（）",
        "options": {
            "A": "药品经营企业",
            "B": "兼营医药商品的其他企业",
            "C": "经营药品批发业务的企业",
            "D": "经营药品零售业务的企业",
            "E": "所有在中国境内经营药品的专营和兼营企业"
        },
        "answer": "E",
        "answer_text": "所有在中国境内经营药品的专营和兼营企业"
    },
    "2-52": {
        "text": "药品经营企业售出的药品如发现质量问题应向有关管理部门报告，并及时（）",
        "options": {
            "A": "做好记录",
            "B": "查明原因，分清责任",
            "C": "采取有效的处理措施",
            "D": "追回药品和做好记录",
            "E": "进行质量分析"
        },
        "answer": "D",
        "answer_text": "追回药品和做好记录"
    },
    "2-53": {
        "text": "《城镇职工基本医疗保险定点零售药店管理暂行办法》规定，外配处方必须由（）",
        "options": {
            "A": "执业医师开具",
            "B": "社区医护人员开具",
            "C": "定点医疗机构医师开具",
            "D": "定点零售药店药师开具",
            "E": "三甲医院执业医师开具"
        },
        "answer": "C",
        "answer_text": "定点医疗机构医师开具"
    },
    "2-54": {
        "text": "药品经营企业验收进口药品必须凭（）",
        "options": {
            "A": "口岸药检所检验报告复印件",
            "B": "国际上通用的药品标准",
            "C": "供货企业《药品经营许可证》复印件",
            "D": "加盖供货单位质量检验机构原印章的《进口药品注册证》《进口药品检验报告书》复印件",
            "E": "进口口岸商检部门的检验合格证"
        },
        "answer": "D",
        "answer_text": "加盖供货单位质量检验机构原印章的《进口药品注册证》《进口药品检验报告书》复印件"
    },
    "2-55": {
        "text": "药品出库必须进行（）",
        "options": {
            "A": "复核",
            "B": "质量核对",
            "C": "化学分析",
            "D": "抽样检查",
            "E": "复核和质量检查"
        },
        "answer": "E",
        "answer_text": "复核和质量检查"
    },
    "2-56": {
        "text": "医疗机构配制制剂必须（）",
        "options": {
            "A": "经SFDA批准并发给批准文号",
            "B": "经省级药监部门批准并发给批准文号",
            "C": "经SFDA批准",
            "D": "经省级药监部门批准",
            "E": "经省级卫生厅核准"
        },
        "answer": "B",
        "answer_text": "经省级药监部门批准并发给批准文号"
    },
    "2-57": {
        "text": "《医疗机构制剂配制质量管理规范（试行）》规定，对《规范》的实施及制剂质量负责的是 （）",
        "options": {
            "A": "药剂科负责人",
            "B": "医疗机构负责人",
            "C": "医疗机构分管药剂工作的负责人",
            "D": "制剂室负责人",
            "E": "制剂室的执业药师"
        },
        "answer": "C",
        "answer_text": "医疗机构分管药剂工作的负责人"
    },
    "2-58": {
        "text": "《医疗机构制剂许可证》的有效期是（）",
        "options": {
            "A": "3年",
            "B": "5年",
            "C": "8年",
            "D": "10年",
            "E": "12年"
        },
        "answer": "B",
        "answer_text": "5年"
    },
    "2-59": {
        "text": "医疗机构配制的制剂不得（）",
        "options": {
            "A": "生产中药制剂",
            "B": "在医院内使用",
            "C": "经批准在医疗机构间调剂",
            "D": "在市场上销售或者变相销售和发布医疗机构制剂广告",
            "E": "配制标准制剂"
        },
        "answer": "D",
        "answer_text": "在市场上销售或者变相销售和发布医疗机构制剂广告"
    },
    "2-60": {
        "text": "医疗机构配制制剂必须（）",
        "options": {
            "A": "经国家药监部门批准并发给批准文号",
            "B": "经省级药监部门批准并发给批准文号",
            "C": "经国家药监部门批准",
            "D": "经省级药监部门批准",
            "E": "经省级卫生厅核准"
        },
        "answer": "B",
        "answer_text": "经省级药监部门批准并发给批准文号"
    },
    "2-61": {
        "text": "麻醉药品连续使用后易发生成瘾性以及（）",
        "options": {
            "A": "精神依赖性",
            "B": "身体依赖性",
            "C": "兴奋性",
            "D": "抑制性",
            "E": "二重性"
        },
        "answer": "A",
        "answer_text": "精神依赖性"
    },
    "2-62": {
        "text": "零售医药商店凭合法处方可以供应和调配（）",
        "options": {
            "A": "精神药品原料",
            "B": "二类精神药品制剂",
            "C": "麻醉药品制剂",
            "D": "一类精神药品制剂",
            "E": "美沙酮"
        },
        "answer": "B",
        "answer_text": "二类精神药品制剂"
    },
    "2-63": {
        "text": "第一类精神药品的供应仅可（）",
        "options": {
            "A": "在医疗机构",
            "B": "在医药门市部零售",
            "C": "凭盖有医疗单位公章的医生处方零售",
            "D": "在省级新药、特药商店零售",
            "E": "在县以上主管部门指定的医疗单位使用"
        },
        "answer": "A",
        "answer_text": "在医疗机构"
    },
    "2-64": {
        "text": "不属于医疗用毒性药品的是（）",
        "options": {
            "A": "砒霜",
            "B": "斑蝥",
            "C": "洋金花",
            "D": "阿托品",
            "E": "舒乐安定"
        },
        "answer": "E",
        "answer_text": "舒乐安定"
    },
    "2-65": {
        "text": "《精神药品管理办法》规定，精神药品的处方必须载明患者的（）",
        "options": {
            "A": "姓名、年龄、药品名称、剂量、住址、职业",
            "B": "姓名、年龄、门诊号、住院号、职业、住址",
            "C": "姓名、药品名称、剂量、用法、住址",
            "D": "姓名、年龄、住址、职业、药品名称、用量",
            "E": "姓名、年龄、性别、身份证号、诊断、药品名称及规格、剂量、用法"
        },
        "answer": "E",
        "answer_text": "姓名、年龄、性别、身份证号、诊断、药品名称及规格、剂量、用法"
    },
    "2-66": {
        "text": "国家对野生药材物种实行（）",
        "options": {
            "A": "严格管理的原则",
            "B": "保护和采猎相结合的原则",
            "C": "严禁采猎的原则",
            "D": "限量采猎的原则",
            "E": "保护与鼓励人工种养相结合的原则"
        },
        "answer": "C",
        "answer_text": "严禁采猎的原则"
    },
    "2-67": {
        "text": "国家一级保护野生药材物种是指（）",
        "options": {
            "A": "濒临灭绝状态的稀有植物物种",
            "B": "濒临灭绝状态的稀有珍贵野生药材物种",
            "C": "资源处于衰竭状态的重要野生药材物种",
            "D": "资源严重减少的主要常用野生药材物种",
            "E": "分布区域缩小的主要动植物物种"
        },
        "answer": "B",
        "answer_text": "濒临灭绝状态的稀有珍贵野生药材物种"
    },
    "2-68": {
        "text": "国家重点保护的野生药材物种分为（）",
        "options": {
            "A": "一级",
            "B": "二级",
            "C": "三级",
            "D": "四级",
            "E": "五级"
        },
        "answer": "C",
        "answer_text": "三级"
    },
    "2-69": {
        "text": "国家二级保护野生药材物种是指（）",
        "options": {
            "A": "濒临灭绝状态的稀有植物物种",
            "B": "濒临灭绝状态的稀有珍贵野生药材物种",
            "C": "资源处于衰竭状态的重要野生药材物种",
            "D": "资源严重减少的主要野生药材物种",
            "E": "分布区域缩小的主要动植物物种"
        },
        "answer": "C",
        "answer_text": "资源处于衰竭状态的重要野生药材物种"
    },
    "2-70": {
        "text": "中药饮片的标签可以缺项的是（）",
        "options": {
            "A": "生产企业",
            "B": "生产日期",
            "C": "产品批号",
            "D": "原产地",
            "E": "批准文号"
        },
        "answer": "E",
        "answer_text": "批准文号"
    },
    "2-71": {
        "text": "药品价格依法实行（）",
        "options": {
            "A": "政府定价、市场调节价、医药公司定价",
            "B": "政府定价、药品生产企业定价、医疗机构定价",
            "C": "物价部门定价、社保定价、销售单位定价",
            "D": "政府定价、政府指导价、市场调节价",
            "E": "物价部门定价、自由定价、政府指导价"
        },
        "answer": "D",
        "answer_text": "政府定价、政府指导价、市场调节价"
    },
    "2-72": {
        "text": "实行政府定价的药品仅限于（）",
        "options": {
            "A": "列入国家基本医疗保险药品目录的药品及其他生产、经营具有垄断性的药品",
            "B": "经营具有垄断性的药品",
            "C": "生产具有垄断性的药品",
            "D": "列入国家基本医疗保险药品目录的药品",
            "E": "其他使用具有一定特点的药品"
        },
        "answer": "A",
        "answer_text": "列入国家基本医疗保险药品目录的药品及其他生产、经营具有垄断性的药品"
    },
    "2-73": {
        "text": "药品不良反应主要是指（）",
        "options": {
            "A": "合格药品使用后出现的与用药目的无关的或意外的有害反应",
            "B": "合格药品在正常用法下出现的与用药目的无关的或意外的有害反应",
            "C": "合格药品在正常用量下出现的与用药目的无关的或意外的有害反应",
            "D": "合格药品在正常用法用量下出现的与用药目的无关的或意外的有害反应",
            "E": "合格药品在正常用法用量下出现的有害反应"
        },
        "answer": "D",
        "answer_text": "合格药品在正常用法用量下出现的与用药目的无关的或意外的有害反应"
    },
    "2-74": {
        "text": "药品生产经营企业和医疗预防保健机构应根据“药品不良反应监督管理办法”建立相应的（）",
        "options": {
            "A": "药品不良反应报告制度",
            "B": "报告制度",
            "C": "越级报告制度",
            "D": "监测管理制度",
            "E": "统计分析报告制度"
        },
        "answer": "A",
        "answer_text": "药品不良反应报告制度"
    },
    "2-75": {
        "text": "上市五年以内的新药，主要报告该药品引起的（）",
        "options": {
            "A": "所有可疑不良反应",
            "B": "严重或罕见的不良反应",
            "C": "严重、罕见或新的不良反应",
            "D": "一般的不良反应",
            "E": "新的不良反应"
        },
        "answer": "A",
        "answer_text": "所有可疑不良反应"
    },
    "3-1": {
        "text": "药事体系的基本职能有（）",
        "options": {
            "A": "培养药学人才",
            "B": "提供安全、有效、稳定、经济的药品",
            "C": "提供用药咨询服务",
            "D": "指导合理用药"
        },
        "answer": "ABCD",
        "answer_text": "A.培养药学人才, B.提供安全、有效、稳定、经济的药品, C.提供用药咨询服务, D.指导合理用药"
    },
    "3-2": {
        "text": "微观的药事管理包括 （）",
        "options": {
            "A": "药品质量管理",
            "B": "药学信息管理",
            "C": "药学服务管理",
            "D": "药学人员管理"
        },
        "answer": "ABCD",
        "answer_text": "A.药品质量管理, B.药学信息管理, C.药学服务管理, D.药学人员管理"
    },
    "3-3": {
        "text": "药事管理工作采用的手段有（）",
        "options": {
            "A": "政策手段",
            "B": "法律手段",
            "C": "技术手段",
            "D": "媒体监督手段"
        },
        "answer": "ABCD",
        "answer_text": "A.政策手段, B.法律手段, C.技术手段, D.媒体监督手段"
    },
    "3-4": {
        "text": "药事管理学科基础包括下面哪些学科（）",
        "options": {
            "A": "社会学",
            "B": "管理学",
            "C": "法学",
            "D": "经济学"
        },
        "answer": "ABCD",
        "answer_text": "A.社会学, B.管理学, C.法学, D.经济学"
    },
    "3-5": {
        "text": "根据工作领域不同，可以将药师分为：（）",
        "options": {
            "A": "社区药房药师",
            "B": "医疗保健机构药师",
            "C": "生产部门药师",
            "D": "流通领域药师"
        },
        "answer": "ABCD",
        "answer_text": "A.社区药房药师, B.医疗保健机构药师, C.生产部门药师, D.流通领域药师"
    },
    "3-6": {
        "text": "医疗机构药师的临床药学功能包括：（）",
        "options": {
            "A": "提供药学保健",
            "B": "开展药物治疗监测",
            "C": "开展药物利用评价",
            "D": "药物不良反应监测"
        },
        "answer": "ABCD",
        "answer_text": "A.提供药学保健, B.开展药物治疗监测, C.开展药物利用评价, D.药物不良反应监测"
    },
    "3-7": {
        "text": "社会药房药师的功能有：（）",
        "options": {
            "A": "供应合格药品",
            "B": "用药指导",
            "C": "管理药品",
            "D": "提供临床药学服务"
        },
        "answer": "ABC",
        "answer_text": "A.供应合格药品, B.用药指导, C.管理药品"
    },
    "3-8": {
        "text": "生产部门药师的功能有：（）",
        "options": {
            "A": "质量保证",
            "B": "质量控制",
            "C": "制定生产计划",
            "D": "追踪药品上市后的使用信息"
        },
        "answer": "ABCD",
        "answer_text": "A.质量保证, B.质量控制, C.制定生产计划, D.追踪药品上市后的使用信息"
    },
    "3-9": {
        "text": "执业西药师的考试科目包括：（）",
        "options": {
            "A": "药学专业知识一",
            "B": "药学专业知识二",
            "C": "药事管理与法规",
            "D": "综合知识与技能"
        },
        "answer": "ABCD",
        "answer_text": "A.药学专业知识一, B.药学专业知识二, C.药事管理与法规, D.综合知识与技能"
    },
    "3-10": {
        "text": "执业中药师的考试科目包括：（）",
        "options": {
            "A": "中药学专业知识一",
            "B": "中药学专业知识二",
            "C": "药事管理与法规",
            "D": "综合知识与技能"
        },
        "answer": "ABCD",
        "answer_text": "A.中药学专业知识一, B.中药学专业知识二, C.药事管理与法规, D.综合知识与技能"
    },
    "3-11": {
        "text": "临床药师的主要功能有：（）",
        "options": {
            "A": "药物治疗专家",
            "B": "药物信息主要来源",
            "C": "调剂药品",
            "D": "治疗结果评价和建议"
        },
        "answer": "ABD",
        "answer_text": "A.药物治疗专家, B.药物信息主要来源, D.治疗结果评价和建议"
    },
    "3-12": {
        "text": "执业药师继续教育分为下面几类：（）",
        "options": {
            "A": "必修",
            "B": "选修",
            "C": "必选",
            "D": "自修"
        },
        "answer": "ABD",
        "answer_text": "A.必修, B.选修, D.自修"
    },
    "3-13": {
        "text": "纳入《基本医疗保险药品目录》的药品应符合下列哪些原则？（）",
        "options": {
            "A": "临床必需",
            "B": "安全有效",
            "C": "价格合理",
            "D": "使用方便"
        },
        "answer": "ABCD",
        "answer_text": "A.临床必需, B.安全有效, C.价格合理, D.使用方便"
    },
    "3-14": {
        "text": "《基本医疗保险药品目录》所列药品包括（）",
        "options": {
            "A": "西药",
            "B": "中药材",
            "C": "中成药",
            "D": "中药饮片"
        },
        "answer": "ABC",
        "answer_text": "A.西药, B.中药材, C.中成药"
    },
    "3-15": {
        "text": "纳入《基本医疗保险药品目录》中“甲类目录”的药品是：",
        "options": {
            "A": "临床必需",
            "B": "使用广泛",
            "C": "疗效好",
            "D": "同类药品中价格低"
        },
        "answer": "ABCD",
        "answer_text": "A.临床必需, B.使用广泛, C.疗效好, D.同类药品中价格低"
    },
    "3-16": {
        "text": "纳入《基本医疗保险药品目录》中“乙类目录”的药品是：",
        "options": {
            "A": "临床治疗选择使用",
            "B": "疗效好",
            "C": "同类药品价格略高",
            "D": "同类药品价格低"
        },
        "answer": "ABC",
        "answer_text": "A.临床治疗选择使用, B.疗效好, C.同类药品价格略高"
    },
    "3-17": {
        "text": "药品作为特殊商品，其特殊性体现在：",
        "options": {
            "A": "专属性",
            "B": "两重性",
            "C": "质量的重要性",
            "D": "时限性"
        },
        "answer": "ABCD",
        "answer_text": "A.专属性, B.两重性, C.质量的重要性, D.时限性"
    },
    "3-18": {
        "text": "下列哪些属于药品的质量特征：",
        "options": {
            "A": "安全性",
            "B": "有效性",
            "C": "稳定性",
            "D": "均一性"
        },
        "answer": "ABCD",
        "answer_text": "A.安全性, B.有效性, C.稳定性, D.均一性"
    },
    "3-19": {
        "text": "药品质量监督检验的性质是：",
        "options": {
            "A": "盈利性",
            "B": "公正性",
            "C": "权威性",
            "D": "仲裁性"
        },
        "answer": "BCD",
        "answer_text": "B.公正性, C.权威性, D.仲裁性"
    },
    "3-20": {
        "text": "非处方药的遴选原则为：",
        "options": {
            "A": "应用安全",
            "B": "疗效确切",
            "C": "质量稳定",
            "D": "应用方便"
        },
        "answer": "ABCD",
        "answer_text": "A.应用安全, B.疗效确切, C.质量稳定, D.应用方便"
    },
    "3-21": {
        "text": "化学药品的名称包括：",
        "options": {
            "A": "通用名",
            "B": "化学名",
            "C": "英文名",
            "D": "汉语拼音"
        },
        "answer": "ABCD",
        "answer_text": "A.通用名, B.化学名, C.英文名, D.汉语拼音"
    },
    "3-22": {
        "text": "中药材的名称包括：",
        "options": {
            "A": "英文名",
            "B": "中文名",
            "C": "汉语拼音",
            "D": "拉丁名"
        },
        "answer": "ACD",
        "answer_text": "A.英文名, C.汉语拼音, D.拉丁名"
    },
    "3-23": {
        "text": "新药研发参照下列原则选择新药品种：",
        "options": {
            "A": "市场前景好",
            "B": "技术水平高",
            "C": "不侵犯知识产权",
            "D": "适合企业产品结构"
        },
        "answer": "ABCD",
        "answer_text": "A.市场前景好, B.技术水平高, C.不侵犯知识产权, D.适合企业产品结构"
    },
    "3-24": {
        "text": "新药的性状包括药物的：",
        "options": {
            "A": "色",
            "B": "味",
            "C": "嗅",
            "D": "外观"
        },
        "answer": "ABCD",
        "answer_text": "A.色, B.味, C.嗅, D.外观"
    },
    "3-25": {
        "text": "新药剂型的确立取决于：",
        "options": {
            "A": "作用部位",
            "B": "药物性质",
            "C": "生物利用度",
            "D": "给药途径"
        },
        "answer": "ABCD",
        "answer_text": "A.作用部位, B.药物性质, C.生物利用度, D.给药途径"
    },
    "3-26": {
        "text": "中药注册按照（）进行分类。",
        "options": {
            "A": "中药创新药",
            "B": "中药改良型新药",
            "C": "古代经典名方中药复方制剂",
            "D": "同名同方药"
        },
        "answer": "ABCD",
        "answer_text": "A.中药创新药, B.中药改良型新药, C.古代经典名方中药复方制剂, D.同名同方药"
    },
    "3-27": {
        "text": "新药的毒理学研究主要包括：",
        "options": {
            "A": "全身用药毒性试验",
            "B": "局部用药毒性试验",
            "C": "特殊毒理研究",
            "D": "药物依赖性试验"
        },
        "answer": "ABC",
        "answer_text": "A.全身用药毒性试验, B.局部用药毒性试验, C.特殊毒理研究"
    },
    "3-28": {
        "text": "特殊毒理研究包括：",
        "options": {
            "A": "致突变试验",
            "B": "致癌试验",
            "C": "生殖毒性试验",
            "D": "急性毒性试验"
        },
        "answer": "ABCD",
        "answer_text": "A.致突变试验, B.致癌试验, C.生殖毒性试验, D.急性毒性试验"
    },
    "3-29": {
        "text": "药品注册按照（）进行分类注册管理。",
        "options": {
            "A": "中药",
            "B": "化学药",
            "C": "生物制品",
            "D": "疫苗"
        },
        "answer": "ABCD",
        "answer_text": "A.中药, B.化学药, C.生物制品, D.疫苗"
    },
    "3-30": {
        "text": "药品经营活动的特点体现为：",
        "options": {
            "A": "单一性",
            "B": "综合性",
            "C": "专业性",
            "D": "政策性"
        },
        "answer": "ABCD",
        "answer_text": "A.单一性, B.综合性, C.专业性, D.政策性"
    },
    "3-31": {
        "text": "《药品经营许可证管理办法》适用于：",
        "options": {
            "A": "药品经营许可证发证",
            "B": "药品经营许可证换证",
            "C": "药品经营许可证变更",
            "D": "药品经营许可证监督管理"
        },
        "answer": "ABCD",
        "answer_text": "A.药品经营许可证发证, B.药品经营许可证换证, C.药品经营许可证变更, D.药品经营许可证监督管理"
    },
    "3-32": {
        "text": "医疗机构储存药品须采取下列哪些措施来保证药品质量：",
        "options": {
            "A": "冷藏",
            "B": "防冻",
            "C": "防潮",
            "D": "避光"
        },
        "answer": "ABCD",
        "answer_text": "A.冷藏, B.防冻, C.防潮, D.避光"
    },
    "3-33": {
        "text": "社会药房从业人员按功能分为如下等级：",
        "options": {
            "A": "店员",
            "B": "助理药师",
            "C": "药师",
            "D": "执业药师"
        },
        "answer": "ABCD",
        "answer_text": "A.店员, B.助理药师, C.药师, D.执业药师"
    },
    "3-34": {
        "text": "药品经营企业的库区环境应该：",
        "options": {
            "A": "无污染源",
            "B": "地面平整",
            "C": "无积水",
            "D": "无杂草"
        },
        "answer": "ABCD",
        "answer_text": "A.无污染源, B.地面平整, C.无积水, D.无杂草"
    },
    "3-35": {
        "text": "药品经营企业仓库可以分为：",
        "options": {
            "A": "合格品库",
            "B": "不合格库",
            "C": "发货库",
            "D": "退货库"
        },
        "answer": "ABCD",
        "answer_text": "A.合格品库, B.不合格库, C.发货库, D.退货库"
    },
    "3-36": {
        "text": "医疗机构包括：",
        "options": {
            "A": "医院",
            "B": "卫生院",
            "C": "门诊部",
            "D": "卫生室"
        },
        "answer": "ABCD",
        "answer_text": "A.医院, B.卫生院, C.门诊部, D.卫生室"
    },
    "3-37": {
        "text": "医疗机构临床药学业务包括：",
        "options": {
            "A": "治疗药物监测",
            "B": "药物信息收集",
            "C": "合理用药咨询",
            "D": "不良反应监测"
        },
        "answer": "ABCD",
        "answer_text": "A.治疗药物监测, B.药物信息收集, C.合理用药咨询, D.不良反应监测"
    },
    "3-38": {
        "text": "医疗机构的调剂部门可以分为：",
        "options": {
            "A": "门诊调剂",
            "B": "住院部调剂",
            "C": "急诊调剂",
            "D": "中药调剂"
        },
        "answer": "ABCD",
        "answer_text": "A.门诊调剂, B.住院部调剂, C.急诊调剂, D.中药调剂"
    },
    "3-39": {
        "text": "调剂处方的“四查十对”中的“四查”是指：",
        "options": {
            "A": "查处方",
            "B": "查药品",
            "C": "查配伍禁忌",
            "D": "查用药合理性"
        },
        "answer": "ABCD",
        "answer_text": "A.查处方, B.查药品, C.查配伍禁忌, D.查用药合理性"
    },
    "3-40": {
        "text": "医疗机构药学技术人员的技术职务可以分为：",
        "options": {
            "A": "主任药师",
            "B": "副主任药师",
            "C": "主管药师",
            "D": "药师"
        },
        "answer": "ABCD",
        "answer_text": "A.主任药师, B.副主任药师, C.主管药师, D.药师"
    },
    "3-41": {
        "text": "一级保护野生药材物种包括：",
        "options": {
            "A": "禁止采猎",
            "B": "必须持有《采药证》，按照批准的计划采猎、收购",
            "C": "属于自然淘汰的，其药用部分由各级药材公司负责经营管理，限量出口",
            "D": "不得出口",
            "E": "限量出口"
        },
        "answer": "ACD",
        "answer_text": "A.禁止采猎, C.属于自然淘汰的，其药用部分由各级药材公司负责经营管理，限量出口, D.不得出口"
    },
    "3-42": {
        "text": "申请中药一级保护的条件是：",
        "options": {
            "A": "对特定疾病有显著疗效的",
            "B": "对特定疾病有特殊疗效的",
            "C": "用于预防和治疗特殊疾病的",
            "D": "相当于国家一级保护野生药材物种的人工制品",
            "E": "从天然药物中提取的特殊制剂"
        },
        "answer": "ABC",
        "answer_text": "A.对特定疾病有显著疗效的, B.对特定疾病有特殊疗效的, C.用于预防和治疗特殊疾病的"
    },
    "3-43": {
        "text": "国家一级保护的野生动植物药材有：",
        "options": {
            "A": "虎骨",
            "B": "豹骨",
            "C": "羚羊角",
            "D": "鹿茸"
        },
        "answer": "ABCD",
        "answer_text": "A.虎骨, B.豹骨, C.羚羊角, D.鹿茸"
    },
    "4-1": {
        "text": "我国执业药师：",
        "options": {},
        "answer": "",
        "answer_text": "我国执业药师：执业药师是指经全国统一考试合格，取得《执业药师资格证书》，并经注册登记，在药品生产、经营、使用单位中执业的药学技术人员。英文：Licensed Pharmacist。分为：执业中药师和执业西药师"
    },
    "4-2": {
        "text": "药品：",
        "options": {},
        "answer": "",
        "answer_text": "药品是指用于预防、治疗、诊断人的疾病，有目的地调节人的生理机能并规定有适应症或者功能主治、用法和用量的物质，包括中药材、中药饮片、中成药、化学原料药及其制剂、抗生素、生化药品、放射性药品、血清、疫苗、血液制品和诊断药品等。"
    },
    "4-3": {
        "text": "新药：",
        "options": {},
        "answer": "",
        "answer_text": "新药是指未曾在中国境内上市销售的药品。"
    },
    "4-4": {
        "text": "处方药：",
        "options": {},
        "answer": "",
        "answer_text": "处方药是指凭执业医师和执业助理医师处方方可购买、调配和使用的药品。"
    },
    "4-5": {
        "text": "国家基本药物：",
        "options": {},
        "answer": "",
        "answer_text": "国家基本药物是指国家为了使本国公众获得基本医疗保障，有国家从目前应用的各类药物中经过科学评价而遴选出具有代表性的、可供疾病预防与治疗时优先考虑选择的药物。"
    },
    "4-6": {
        "text": "非处方药：",
        "options": {},
        "answer": "",
        "answer_text": "非处方药是指由国务院药品监督管理部门公布的，不需要凭执业医师和执业助理医师处方，消费者可以自行判断、购买和使用的药品。"
    },
    "4-7": {
        "text": "药品批发企业：",
        "options": {},
        "answer": "",
        "answer_text": "药品批发企业是指将购进的药品销售给药品生产、经营企业、医疗机构的药品经营企业。"
    },
    "4-8": {
        "text": "药品零售企业：",
        "options": {},
        "answer": "",
        "answer_text": "药品零售企业是将购进的药品直接销售给终端消费者的药品经营企业。"
    },
    "4-9": {
        "text": "药品注册：",
        "options": {},
        "answer": "",
        "answer_text": "药品注册是指药品注册申请人依照法定程序和相关要求提出药物临床试验、药品上市许可、再注册等申请以及补充申请，药品监督管理部门基于法律法规和现有科学认知进行安全性、有效性和质量可控性等审查，决定是否同意其申请的活动。"
    },
    "4-10": {
        "text": "药物临床试验：",
        "options": {},
        "answer": "",
        "answer_text": "药物临床试验是指以药品上市注册为目的，在人体中进行的药物研究，旨在确定药物的安全性和有效性。"
    },
    "4-11": {
        "text": "药品标准复核：",
        "options": {},
        "answer": "",
        "answer_text": "药品标准复核是指对申请人申报药品标准中设定项目的科学性、检验方法的可行性、质控指标的合理性等进行的实验室评估。"
    },
    "4-12": {
        "text": "定点零售药店：",
        "options": {},
        "answer": "",
        "answer_text": "定点零售药店是经统筹地区劳动保障行政部门审查，并经社会保险经办机构确定的，为城镇职工基本医疗保险参保人员提供处方外配服务的零售药店。"
    },
    "4-13": {
        "text": "处方外配：",
        "options": {},
        "answer": "",
        "answer_text": "处方外配是指参保人员持定点医疗机构处方，在定点零售药店购药的行为。"
    },
    "4-14": {
        "text": "医师处方：",
        "options": {},
        "answer": "",
        "answer_text": "医师处方是指由注册的执业医师和执业助理医师在诊疗活动中为患者开具的、由取得药学专业技术职务任职资格的药学专业技术人员审核、调配、核对，并作为患者用药凭证的医疗文书。处方还包括医疗机构病区用药医嘱单。"
    },
    "4-15": {
        "text": "调剂：",
        "options": {},
        "answer": "",
        "answer_text": "调剂是指配药、配方、发药的过程，又称为调配处方。"
    },
    "4-16": {
        "text": "药品有效期：",
        "options": {},
        "answer": "",
        "answer_text": "药品有效期是指药品在一定的存储条件下，能够保证其质量合格的期限。"
    },
    "4-17": {
        "text": "精神药品：",
        "options": {},
        "answer": "",
        "answer_text": "精神药品是指列入精神药品目录的药品和其他物质。精神药品分为第一类精神药品和第二类精神药品。"
    },
    "4-18": {
        "text": "中药材：",
        "options": {},
        "answer": "",
        "answer_text": "中药材指药用植物、动物、矿物的药用部分采收后经产地初加工形成的原料药材。"
    },
    "4-19": {
        "text": "中药饮片：",
        "options": {},
        "answer": "",
        "answer_text": "中药饮片是指在中医药理论指导下，根据辨证施治和调剂、制剂的需要，对中药材进行特殊加工炮制后的制成品。"
    },
    "4-20": {
        "text": "中成药：",
        "options": {},
        "answer": "",
        "answer_text": "中成药以中药材为原料，在中医药理论指导下，按规定的处方和方法，加工制成的一定剂型，标明药物作用、适应证、用法用量，供医生、患者直接使用的药物，主要有丸、散、膏、丹、露、酒、锭、片剂、冲剂、糖浆等不同的剂型。"
    },
    "5-1": {
        "text": "药事管理学的研究内容包括哪些方面？",
        "options": {},
        "answer": "",
        "answer_text": "药事管理学的研究内容包括药事管理体制、药品监督管理、药品法制管理、药品注册管理、药品生产和经营管理、药品使用管理、药品信息管理、药品知识产权保护、药学技术人员管理等方面。"
    },
    "5-2": {
        "text": "国家基本药物遴选原则是什么？",
        "options": {},
        "answer": "",
        "answer_text": "国家基本药物遴选原则包括防治必需、安全有效、价格合理、使用方便、中西药并重、基本保障、临床首选、基层能够配备等。"
    },
    "5-3": {
        "text": "简述《药品管理法》的立法目的、适用范围。",
        "options": {},
        "answer": "",
        "answer_text": "《药品管理法》的立法目的是加强药品监督管理，保证药品质量，保障人体用药安全，维护人民身体健康和用药的合法权益。适用范围包括在中华人民共和国境内从事药品的研制、生产、经营、使用和监督管理的单位或个人，必须遵守该法。"
    },
    "5-4": {
        "text": "开办药品生产企业必须具备什么条件？",
        "options": {},
        "answer": "",
        "answer_text": "《药品管理法》第十五条：具有依法经过资格认定的药学技术人员；具有与所经营药品相适应的营业场所、设备、仓储设施、卫生环境；具有与所经营药品相适应的质量管理机构或者人员；具有保证所经营药品质量的规章制度。"
    },
    "5-5": {
        "text": "什么是假药、劣药？",
        "options": {},
        "answer": "",
        "answer_text": "假药：药品所含成份与国家药品标准规定的成份不符的；以非药品冒充药品或者以他种药品冒充此种药品的。有下列情形之一的药品，按假药论处：国务院药品监督管理部门规定禁止使用的；依照本法必须批准而未经批准生产、进口，或者依照本法必须检验而未经检验即销售的；变质的；被污染的；使用依照本法必须取得批准文号而未取得批准文号的原料药生产的；所标明的适应症或者功能主治超出规定范围的。劣药：药品成份的含量不符合国家药品标准的。有下列情形之一的药品，按劣药论处：未标明有效期或者更改有效期的；不注明或者更改生产批号的；超过有效期的；直接接触药品的包装材料和容器未经批准的；擅自添加着色剂、防腐剂、香料、矫味剂及辅料的；其他不符合药品标准规定的。"
    },
    "5-6": {
        "text": "疫苗的批签发制度是什么意思？",
        "options": {},
        "answer": "",
        "answer_text": "每批疫苗销售前或者进口时，应当经国务院药品监督管理部门指定的批签发机构按照相关技术要求进行审核、检验。符合要求的，发给批签发证明；不符合要求的，发给不予批签发通知书。"
    },
    "5-7": {
        "text": "简述药品生产的特点。",
        "options": {},
        "answer": "",
        "answer_text": "药品生产的特点包括准入条件严格、质量要求高、环境保护迫切、生产技术先进、生产过程复杂。"
    },
    "5-8": {
        "text": "简述药品生产企业的特征。",
        "options": {},
        "answer": "",
        "answer_text": "药品生产企业的特征包括经济性、盈利性、独立性。"
    },
    "5-9": {
        "text": "药品分类储存保管中的“六分开”包括哪些方面？",
        "options": {},
        "answer": "",
        "answer_text": "药品分类储存保管中的“六分开”包括以下方面：\n1.药品与非药品分开\n2.处方药与非处方药分开\n3.特殊管理药品与一般药品分开\n4.有储存温度要求的与常温药品分开\n5.易窜味的药品、中药材、中药饮片以及危险药品与其他药品分开\n6.外用药与其他方法服用的药品分开"
    },
    "5-10": {
        "text": "哪些药品不得发布广告？",
        "options": {},
        "answer": "",
        "answer_text": "以下药品不得发布广告：\n1.麻、精、毒、放药品\n2.药品监督管理部门明令停止或禁止生产、销售和使用的药品\n3.医疗机构配制的制剂\n4.军队特需药品\n5.批准试生产的药品"
    },
    "5-11": {
        "text": "医药专利包括哪些类型？",
        "options": {},
        "answer": "",
        "answer_text": "医药专利包括以下类型：\n1. 医药发明专利\n2. 实用新型专利\n3. 外观设计专利"
    }
}

def display_questions(start, end):
    st.title('药事管理学试卷展示')
    st.header('选择题')
    st.subheader('[A型题]')

    for question_id, question in questions.items():
        if start <= int(question_id) <= end:
            st.write(f'{question_id}. {question["text"]}')
            for option_key, option_value in question['options'].items():
                st.write(f'{option_key}. {option_value}')
            st.write('---')

def display_question(question_number, question_data):
    st.subheader(f"题目 {question_number}:")
    st.write(question_data['text'])

def search_question(keyword):
    results = []
    for question_number, question_data in questions.items():
        if keyword in question_data['text']:
            results.append(question_number)
    return results

def main():
    st.title("药事管理学试卷展示应用")
    # display_questions(1,7)
    # 搜索框
    search_keyword = st.text_input('输入关键字搜索题目：')

    # 搜索按钮
    search_button = st.button('搜索')

    if search_button:
        # 执行搜索
        search_results = search_question(search_keyword)

        # 显示搜索结果
        if search_results:
            st.markdown('### 搜索结果：')
            for question_num in search_results:
                # Retrieve question data based on the question number
                question_data = questions.get(str(question_num))
                # Display the question and options
                if question_data:
                    st.markdown(f"**{question_num}.{question_data['text']}**")
                    for option, text in question_data['options'].items():
                        st.markdown(f'- {option}. {text}')
                    st.markdown(f'答案：{question_data["answer"]} <span style="background-color: yellow;">{question_data["answer_text"]}</span>', unsafe_allow_html=True)
                    st.markdown('---')
                else:
                    st.error("Question not found!")
        else:
            st.markdown('### 搜索结果：无匹配题目')

    # 显示所有题目
    # st.markdown('### 所有题目：')
    # for question_num, question_data in questions.items():
    #     st.markdown(f'**题目 {question_num}:** {question_data["text"]}')
    #     for option, text in question_data['options'].items():
    #         st.markdown(f'- {option}. {text}')
    #     st.markdown('---')


if __name__ == '__main__':
    main()

