# -*- UTF-8-*-
# Author : David Vane

import streamlit as st

questions = {
    "1-1": {
        "text": "药物是指用于预防、治疗、诊断疾病，并规定有适应症的物质。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-2": {
        "text": "药物分析是收载药品质量标准的典籍。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-3": {
        "text": "药品标准是对药品质量、规格及检验方法所作的技术规定。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-4": {
        "text": "药品标准的制定必须坚持“科学性、先进性、规范性、权威性”的原则。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-5": {
        "text": "钠离子的焰色反应显黄色。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-6": {
        "text": "钾离子的焰色反应显蓝色。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-7": {
        "text": "比旋度是反映手性药物特性及其纯度的主要指标。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-8": {
        "text": "重氮化偶合反应可用于芳香第一胺的鉴别。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-9": {
        "text": "物理常数包括相对密度、馏程、熔点、凝点等；其测定结果不仅对药品具有鉴别意义，也可反映药品的纯度，是评价药品质量的主要指标之一。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-10": {
        "text": "药物中的杂质的检查，一般要求测定其准确含量。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-11": {
        "text": "药物的干燥失重测定法是属于药物的特殊杂质的检查法。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-12": {
        "text": "药物的干燥失重测定法主要控制药物中的水分，也包括其它挥发性物质如乙醇等。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-13": {
        "text": "药物检查中不要求检查的杂质，说明药物中不含此类杂质。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-14": {
        "text": "用药物和杂质的溶解行为的差异进行杂质检查，是属于特殊杂质检查法。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-15": {
        "text": "《药典》中所规定的杂质检查项目是固定不变的。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-16": {
        "text": "气相色谱中，柱温直接影响分离效能和分析速度，应根据被测物的沸点、极性大小选择合适的柱温。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-17": {
        "text": "气相色谱中，对于多组份混合物或沸点相差较大的组分可采用程序升温的方法。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-18": {
        "text": "高效液相色谱仪检测器的响应值与待测溶液的浓度通常不呈一次线性关系的是蒸发光散射检测器。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-19": {
        "text": "二极管阵列检测器（DAD）可以同时记录供试品的吸收光谱，故可用于供试品的光谱鉴定和色谱峰的纯度检查。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-20": {
        "text": "为了减少滴定误差，需要选择合适的指示剂或指示方法，使滴定终点尽可能接近滴定反应的化学计量点。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-21": {
        "text": "为去除血浆中蛋白质，可加入异丙醇。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-22": {
        "text": "生物样品经前处理后能够降低分析时的背景噪声。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-23": {
        "text": "提取回收率的验证要考察高、中、低三个浓度的QC样品。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-24": {
        "text": "在生物样品分析方法验证中，精密度用实际样品测定。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-25": {
        "text": "当待测物热稳定性好时，可采用加热的方法将一些热变性蛋白质沉淀。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-26": {
        "text": "水杨酸、乙酰水杨酸均易溶于水，所以以水作为滴定介质。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-27": {
        "text": "水杨酸类药物均可以与三氯化铁在适当的条件下产生有色的铁配合物。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-28": {
        "text": "乙酰水杨酸中仅含有一种特殊杂质水杨酸。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-29": {
        "text": "阿司匹林能与三氯化铁试液直接显色。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-30": {
        "text": "二氢吡啶类药物的分析应避光操作。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-31": {
        "text": "硝苯地平的铈量法测定含量是基于硝苯地平的氧化性。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-32": {
        "text": "硝苯地平可还原后重氮化偶合反应进行鉴别。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-33": {
        "text": "硝苯地平的铈量法进行含量测定时的pH条件应是强酸性。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-34": {
        "text": "尼莫地平的苯环硝基具有氧化性，可将氢氧化亚铁氧化为红棕色氢氧化铁沉淀。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-35": {
        "text": "硝苯地平的丙酮溶液与氢氧化钠试液反应显橙红色。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-36": {
        "text": "尼群地平与碘化铋钾试剂反应呈橙红色沉淀。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-37": {
        "text": "氨氯地平可用重氮化偶合反应进行鉴别。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-38": {
        "text": "氨氯地平具有旋光性。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-39": {
        "text": "中国药典规定硝苯地平在避光条件下用HPLC检查有关物质。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-40": {
        "text": "巴比妥类药物与重金属离子的反应是由于结构中含有丙二酰脲。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-41": {
        "text": "巴比妥类药物在酸性条件下发生一级电离而有紫外吸收。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-42": {
        "text": "差示紫外分光光度法测定巴比妥类药物，其目的是消除杂质吸收的干扰。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-43": {
        "text": "药物的酸碱度检查法采用蒸馏水为溶剂。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-44": {
        "text": "氯氮卓水解后显芳伯氨基反应。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-45": {
        "text": "由于辅料影响，盐酸异丙嗪片需提取后再进行IR鉴别。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-46": {
        "text": "用铈量法测定吩噻嗪类药物的含量时，常用的指示剂是吩噻嗪类药物自身做指示剂。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-47": {
        "text": "非水滴定法可用于吩噻嗪类药物片剂的直接滴定。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-48": {
        "text": "有氧化物存在时，吩噻嗪类药物的鉴别可采用钯离子比色法。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-49": {
        "text": "盐酸氯丙嗪可与稀盐酸-三硝基苯酚生成沉淀。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-50": {
        "text": "异丙嗪置于铜网上燃烧，火焰显绿色。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-51": {
        "text": "奋乃静置于铜网上燃烧，火焰显绿色。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-52": {
        "text": "盐酸氯丙嗪可被硝酸氧化显红色用于鉴别。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-53": {
        "text": "吩噻嗪类药物与钯离子配合呈色的反应可用于鉴别。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-54": {
        "text": "硫氮杂蒽母核在205nm、254nm、300nm三个波长处有最大吸收，可用紫外分光光度法鉴别本类药物。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-55": {
        "text": "青蒿素和双氢青蒿素均可采用与碘化钾试液-淀粉反应进行鉴别。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-56": {
        "text": "硫酸奎宁在稀硫酸溶液中显蓝色荧光。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-57": {
        "text": "双氢青蒿素是青蒿琥酯的体内活性代谢物。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-58": {
        "text": "中国药典中青蒿素原料药采用UV法进行含量测定。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-59": {
        "text": "中国药典中用于某生物碱的鉴别方法为：供试品水溶液中滴加溴试液与氨试液，即显翠绿色，该反应是Vitali反应。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-60": {
        "text": "中国药典规定硫酸奎宁需检查其他金鸡纳碱。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-61": {
        "text": "硫酸奎宁供试品溶液中滴加氯化钡溶液，生成白色沉淀。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-62": {
        "text": "硫酸奎宁属于喹啉类药物。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-63": {
        "text": "绿奎宁反应可用于鉴别硫酸奎宁。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-64": {
        "text": "喹啉类药物具有喹啉杂环，可用紫外吸收光谱的特征鉴别该类药物。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-65": {
        "text": "CZE电泳模式中只能使用水相缓冲溶液。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-66": {
        "text": "UPLC操作中流速不受限制，且越高越好。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-67": {
        "text": "MECC主要用于非离子状态的样品。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-68": {
        "text": "CZE主要用于非离子状态的样品。",
        "options": {},
        "answer": "",
        "answer_text": "×"
    },
    "1-69": {
        "text": "环糊精是手性HPLC技术中手性流动相添加剂。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-70": {
        "text": "奎宁是手性HPLC技术中手性流动相添加剂。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-71": {
        "text": "纤维素可作HPLC的手性固定相。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-72": {
        "text": "GC-MS最常用的测定方法为总离子流法和质量碎片图谱法。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-73": {
        "text": "目前GC-MS最常用的接口是毛细管柱直接导入型接口。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "1-74": {
        "text": "UPLC与HPLC基于相同的分离机制，故相互之间的方法转换非常简易。",
        "options": {},
        "answer": "",
        "answer_text": "√"
    },
    "2-1": {
        "text": "在《中国药典》中，通用的测定方法收载在（ ）",
        "options": {
            "A": "药典一部",
            "B": "药典二部",
            "C": "药典三部",
            "D": "药典四部"
        },
        "answer": "D",
        "answer_text": "药典四部"
    },
    "2-2": {
        "text": "解释和使用《中国药典》正确进行质量检定的基本原则的是（ ）",
        "options": {
            "A": "检验方法",
            "B": "真实性",
            "C": "代表性",
            "D": "索引",
            "E": "凡例"
        },
        "answer": "E",
        "answer_text": "凡例"
    },
    "2-3": {
        "text": "以下不属于《中国药典》二部收载的是（ ）",
        "options": {
            "A": "化学药品",
            "B": "抗生素",
            "C": "生物药品",
            "D": "生化药品",
            "E": "放射性药品"
        },
        "answer": "C",
        "answer_text": "生物药品"
    },
    "2-4": {
        "text": "按《中国药典》精密量取50ml某溶液时，宜选用（ ）",
        "options": {
            "A": "50ml量筒",
            "B": "50ml移液管",
            "C": "50ml滴定管",
            "D": "100ml量筒",
            "E": "50ml烧杯"
        },
        "answer": "B",
        "answer_text": "50ml移液管"
    },
    "2-5": {
        "text": "《中国药典》规定“精密称定”时，系指重量应准确至所取重量的（ ）",
        "options": {
            "A": "百分之一",
            "B": "千分之一",
            "C": "万分之一",
            "D": "百分之十",
            "E": "千分之三"
        },
        "answer": "B",
        "answer_text": "千分之一"
    },
    "2-6": {
        "text": "中国药典中规定，称取“2.00g”系指（ ）",
        "options": {
            "A": "称取重量可为1.5~2.5g",
            "B": "称取重量可为1.95~2.05g",
            "C": "称取重量可为1.995~2.005g",
            "D": "称取重量可为1.9995~2.0005g",
            "E": "称取重量可为1~3g"
        },
        "answer": "C",
        "answer_text": "称取重量可为1.9952.005g"
    },
    "2-7": {
        "text": "药典规定取用量“约”若干时，系指取用量不得超过规定量的",
        "options": {
            "A": "±0.1%",
            "B": "±1%",
            "C": "±5%",
            "D": "±10%",
            "E": "±2%"
        },
        "answer": "D",
        "answer_text": "±10%"
    },
    "2-8": {
        "text": "中国药典规定的“阴凉处”是指",
        "options": {
            "A": "放在阴暗处，温度不超过2°C",
            "B": "放在阴暗处，温度不超过10°C",
            "C": "避光，温度不超过20°C",
            "D": "温度不超过20°C",
            "E": "放在室温避光处"
        },
        "answer": "D",
        "answer_text": "温度不超过20°C"
    },
    "2-9": {
        "text": "《中国药典》规定“室温”系指",
        "options": {
            "A": "20°C",
            "B": "20~25°C",
            "C": "25°C",
            "D": "20~30°C",
            "E": "10~30°C"
        },
        "answer": "E",
        "answer_text": "10~30°C"
    },
    "2-10": {
        "text": "关于中国药典，最正确的说法是",
        "options": {
            "A": "一部药物分析的书",
            "B": "收载所有药物的法典",
            "C": "一部药物词典",
            "D": "我国制定的药品标准的法典",
            "E": "我国中草药的法典"
        },
        "answer": "D",
        "answer_text": "我国制定的药品标准的法典"
    },
    "2-11": {
        "text": "药物鉴别试验的目的是证明",
        "options": {
            "A": "未知药物的真伪",
            "B": "已知药物的真伪",
            "C": "未知药物的化学结构",
            "D": "已知药物的化学结构"
        },
        "answer": "B",
        "answer_text": "已知药物的真伪"
    },
    "2-12": {
        "text": "在药品质量标准中，药品的外观、臭、味等内容归属的项目是",
        "options": {
            "A": "性状",
            "B": "一般鉴别",
            "C": "专属鉴别",
            "D": "检查"
        },
        "answer": "A",
        "answer_text": "性状"
    },
    "2-13": {
        "text": "葡萄糖酸钙在无色火焰中燃烧，火焰显",
        "options": {
            "A": "黄色",
            "B": "砖红色",
            "C": "紫色",
            "D": "蓝色"
        },
        "answer": "B",
        "answer_text": "砖红色"
    },
    "2-14": {
        "text": "能与茜素氟蓝、Ce(NO3)2作用，显蓝紫色的是",
        "options": {
            "A": "Na+",
            "B": "F-",
            "C": "K+",
            "D": "SO42-"
        },
        "answer": "B",
        "answer_text": "F-"
    },
    "2-15": {
        "text": "下列叙述不正确的是",
        "options": {
            "A": "鉴别反应完成需要一定的时间",
            "B": "鉴别反应不需要考虑“量”的问题",
            "C": "鉴别反应需要有一定的专属性",
            "D": "鉴别反应需要在一定条件下进行"
        },
        "answer": "B",
        "answer_text": "鉴别反应不需要考虑“量”的问题"
    },
    "2-16": {
        "text": "下列药物中能发生三氯化铁反应的是",
        "options": {
            "A": "链霉素",
            "B": "葡萄糖",
            "C": "对乙酰氨基酚",
            "D": "苯巴比妥"
        },
        "answer": "C",
        "answer_text": "对乙酰氨基酚"
    },
    "2-17": {
        "text": "下列药物中无旋光性的是",
        "options": {
            "A": "葡萄糖",
            "B": "硫酸奎宁",
            "C": "盐酸麻黄碱",
            "D": "阿司匹林"
        },
        "answer": "D",
        "answer_text": "阿司匹林"
    },
    "2-18": {
        "text": "空白试验是",
        "options": {
            "A": "用标准品代替样品同法操作",
            "B": "用纯溶剂代替样品同法操作",
            "C": "不加显色剂，按样品测定方法同法操作",
            "D": "不加供试品，按样品测定方法同法操作"
        },
        "answer": "D",
        "answer_text": "不加供试品，按样品测定方法同法操作"
    },
    "2-19": {
        "text": "下列叙述正确的是",
        "options": {
            "A": "一般鉴别试验能证实是哪一种药物",
            "B": "一般鉴别试验只能证实是某一类药物，不能证实是哪一种药物",
            "C": "鉴别试验只能应用化学方法",
            "D": "鉴别试验只能应用光谱法"
        },
        "answer": "B",
        "answer_text": "一般鉴别试验只能证实是某一类药物，不能证实是哪一种药物"
    },
    "2-20": {
        "text": "一般鉴别试验收载在药典的",
        "options": {
            "A": "凡例",
            "B": "正文",
            "C": "附录",
            "D": "索引"
        },
        "answer": "C",
        "answer_text": "附录"
    },
    "2-21": {
        "text": "富马酸亚铁片中硫酸盐的检查：取本品0.15g，依法检查。与标准硫酸钾溶液3.0ml（每1ml相当于100μg的SO42-）同法操作比较，不得更深，其限量为",
        "options": {
            "A": "0.1%",
            "B": "0.2%",
            "C": "0.01%",
            "D": "0.02%"
        },
        "answer": "B",
        "answer_text": "0.2%"
    },
    "2-22": {
        "text": "葡萄糖中砷盐的检查：取本品0.2g，依法检查，其限量为0.0001%，试计算需取标准砷溶液（每1ml相当于1μg的As）多少毫升",
        "options": {
            "A": "1.0",
            "B": "1.5",
            "C": "2.0",
            "D": "3.0"
        },
        "answer": "C",
        "answer_text": "2.0"
    },
    "2-23": {
        "text": "检查某药物中的砷盐，取标准砷溶液2.0ml（每1ml相当于1μg的As）制备标准砷斑，砷盐限量为0.0001%，应取供试品的量为",
        "options": {
            "A": "0.20g",
            "B": "2.0g",
            "C": "0.020g",
            "D": "1.0g"
        },
        "answer": "B",
        "answer_text": "2.0g"
    },
    "2-24": {
        "text": "检查维生素C中的重金属时，若取样量为1.0g，要求含重金属不得超过百万分之十，应吸取标准铅溶液（每1ml相当于0.01mg的Pb）多少毫升",
        "options": {
            "A": "0.2ml",
            "B": "0.4ml",
            "C": "2ml",
            "D": "1ml"
        },
        "answer": "D",
        "answer_text": "1ml"
    },
    "2-25": {
        "text": "氯化物检查时，制备对照溶液是用",
        "options": {
            "A": "NaCl溶液",
            "B": "标准NaCl溶液",
            "C": "KCl溶液",
            "D": "标准Cl-溶液"
        },
        "answer": "B",
        "answer_text": "标准NaCl溶液"
    },
    "2-26": {
        "text": "药物中的氯化物杂质检查，是使该杂质在酸性溶液中与硝酸银作用生成氯化银浑浊，所用的稀酸是",
        "options": {
            "A": "硫酸",
            "B": "硝酸",
            "C": "盐酸",
            "D": "醋酸"
        },
        "answer": "B",
        "answer_text": "硝酸"
    },
    "2-27": {
        "text": "铁盐检查时，要求酸性条件的原因是",
        "options": {
            "A": "防止Fe3+水解",
            "B": "防止Fe3+还原",
            "C": "使生成颜色稳定",
            "D": "提高反应灵敏度"
        },
        "answer": "A",
        "answer_text": "防止Fe3+水解"
    },
    "2-28": {
        "text": "铁盐的检查须在哪种酸性溶液中进行",
        "options": {
            "A": "硫酸",
            "B": "硝酸",
            "C": "盐酸",
            "D": "醋酸"
        },
        "answer": "C",
        "answer_text": "盐酸"
    },
    "2-29": {
        "text": "重金属检查法中，若以硫代乙酰胺作显色剂，溶液最适pH值为",
        "options": {
            "A": "3~3.5",
            "B": "4~4.5",
            "C": "5~5.5",
            "D": "6~6.5"
        },
        "answer": "A",
        "answer_text": "3~3.5"
    },
    "2-30": {
        "text": "重金属检查的原理是",
        "options": {
            "A": "重金属与硝酸反应",
            "B": "重金属离子与硫化物反应",
            "C": "重金属离子与乙二胺四乙酸盐发生配位反应",
            "D": "重金属离子在规定条件下与硫离子发生沉淀反应"
        },
        "answer": "D",
        "answer_text": "重金属离子在规定条件下与硫离子发生沉淀反应"
    },
    "2-31": {
        "text": "砷盐检查时，溴化汞试纸的作用是",
        "options": {
            "A": "吸收H2S",
            "B": "与SbH3 形成有色斑点",
            "C": "与AsH3 形成有色斑点",
            "D": "消除AsH3 的干扰"
        },
        "answer": "C",
        "answer_text": "与AsH3 形成有色斑点"
    },
    "2-32": {
        "text": "古蔡氏法检查砷盐时，和溴化汞试纸生成砷斑的化合物是",
        "options": {
            "A": "HgBr2",
            "B": "AsH3",
            "C": "AsH(HgBr)2",
            "D": "SnCl2"
        },
        "answer": "B",
        "answer_text": "AsH3"
    },
    "2-33": {
        "text": "在用古蔡氏法检查砷盐时，导气管中塞入醋酸铅棉花的目的是",
        "options": {
            "A": "除去I2",
            "B": "除去AsH3",
            "C": "除去H2S",
            "D": "除去HBr"
        },
        "answer": "C",
        "answer_text": "除去H2S"
    },
    "2-34": {
        "text": "古蔡氏法检查砷盐时，加入KI和SnCl2的主要作用是",
        "options": {
            "A": "增加AsH3的生成",
            "B": "将As5+还原为As3+",
            "C": "加快氢气的生成",
            "D": "抑制SbH3的生成"
        },
        "answer": "B",
        "answer_text": "将As5+还原为As3+"
    },
    "2-35": {
        "text": "Ag-DDC法检查砷盐的原理是：砷化氢与Ag-DDC吡啶作用，生成的物质是",
        "options": {
            "A": "砷斑",
            "B": "锑斑",
            "C": "胶态银",
            "D": "胶态砷"
        },
        "answer": "C",
        "answer_text": "胶态银"
    },
    "2-36": {
        "text": "《中国药典》规定检查有机溶剂残留的方法为",
        "options": {
            "A": "气相色谱法",
            "B": "高效液相色谱法",
            "C": "紫外分光光度法",
            "D": "滴定法"
        },
        "answer": "A",
        "answer_text": "气相色谱法"
    },
    "2-37": {
        "text": "硫氰酸盐法是检查药品中的",
        "options": {
            "A": "氯化物",
            "B": "铁盐",
            "C": "重金属",
            "D": "硫酸盐"
        },
        "answer": "B",
        "answer_text": "铁盐"
    },
    "2-38": {
        "text": "对于药物中的硫酸盐进行检查时，所用的显色剂是",
        "options": {
            "A": "AgNO3",
            "B": "H2S",
            "C": "硫氰酸铵",
            "D": "BaCl2"
        },
        "answer": "D",
        "answer_text": "BaCl2"
    },
    "2-39": {
        "text": "对于药物中的氯化物进行检查时，所用的显色剂是",
        "options": {
            "A": "AgNO3",
            "B": "H2S",
            "C": "硫氰酸铵",
            "D": "BaCl2"
        },
        "answer": "A",
        "answer_text": "AgNO3"
    },
    "2-40": {
        "text": "药物的杂质检查要求应",
        "options": {
            "A": "不允许有任何杂质存在",
            "B": "符合分析纯的规定",
            "C": "不允许有对人体有害的物质存在",
            "D": "不超过药品质量标准对该药杂质限量的规定"
        },
        "answer": "D",
        "answer_text": "不超过药品质量标准对该药杂质限量的规定"
    },
    "2-41": {
        "text": "色谱法定量分析时，为准确测量，要求分离度应大于",
        "options": {
            "A": "1",
            "B": "1.2",
            "C": "1.5",
            "D": "2.5"
        },
        "answer": "C",
        "answer_text": "1.5"
    },
    "2-42": {
        "text": "中国药典规定紫外分光光度法测定中，溶液的吸收度应控制在",
        "options": {
            "A": "0.00~2.00",
            "B": "0.3~1.0",
            "C": "0.3~0.7",
            "D": "0.1~1.0"
        },
        "answer": "B",
        "answer_text": "0.3~1.0"
    },
    "2-43": {
        "text": "紫外分光光度计在紫外光区使用的光源是",
        "options": {
            "A": "氘灯",
            "B": "空心阴极灯",
            "C": "硅碳棒",
            "D": "Nernst灯"
        },
        "answer": "A",
        "answer_text": "氘灯"
    },
    "2-44": {
        "text": "在药物分析中,气相色谱法中最常用的检测器是",
        "options": {
            "A": "TCD",
            "B": "FID",
            "C": "ECD",
            "D": "NPD"
        },
        "answer": "B",
        "answer_text": "FID"
    },
    "2-45": {
        "text": "在高效液相色谱法中，使用的流动相应与仪器系统的原保存溶剂能互溶，如不互溶，则先取下上次的色谱柱，用_冲洗过渡，进样器和检测器的流通池也注入同样溶剂进行过渡，过渡完毕后，接上相应的色谱柱，换上本次使用的流动相。",
        "options": {
            "A": "甲醇",
            "B": "乙醇",
            "C": "异丙醇",
            "D": "乙腈"
        },
        "answer": "C",
        "answer_text": "异丙醇"
    },
    "2-46": {
        "text": "在薄层层析中化合物斑点的Rf值是指",
        "options": {
            "A": "溶剂前沿移离薄层板底边的距离与化合物斑点移离薄层板底边的距离的比值",
            "B": "溶剂前沿移离原点的距离与化合物斑点移离原点的距离的比值",
            "C": "化合物斑点移离原点的距离与溶剂前沿移离原点的距离的比值",
            "D": "化合物斑点移离薄层板底边的距离与溶剂前沿移离薄层板底边的距离的比值"
        },
        "answer": "C",
        "answer_text": "化合物斑点移离原点的距离与溶剂前沿移离原点的距离的比值"
    },
    "2-47": {
        "text": "氧瓶燃烧法测定含氯有机药物，常用的吸收液是",
        "options": {
            "A": "水",
            "B": "稀硫酸",
            "C": "稀氢氧化钠",
            "D": "氯化钠溶液"
        },
        "answer": "C",
        "answer_text": "稀氢氧化钠"
    },
    "2-48": {
        "text": "选择程序升温方法进行分离的样品，主要是",
        "options": {
            "A": "同分异构体",
            "B": "同系物",
            "C": "沸点差异大的混合物",
            "D": "极性差异大的混合物"
        },
        "answer": "C",
        "answer_text": "沸点差异大的混合物"
    },
    "2-49": {
        "text": "在反相色谱法中，若以甲醇-水为流动相，增加甲醇的比例时，组分的",
        "options": {
            "A": "保留时间增加",
            "B": "保留时间减小",
            "C": "保留时间不变",
            "D": "无法判断"
        },
        "answer": "B",
        "answer_text": "保留时间减小"
    },

    "2-50": {
        "text": "准确度是指用某分析方法测定的结果与真实值或参考值接近的程度，一般表示为( )",
        "options": {
            "A": "百分回收率",
            "B": "偏差",
            "C": "重现性",
            "D": "相对标准偏差"
        },
        "answer": "A",
        "answer_text": "百分回收率"
    },

    "2-51": {
        "text": "在设计的范围内，测试结果与试样中被测物浓度直接呈正比关系的程度称为( )",
        "options": {
            "A": "精密度",
            "B": "耐用性",
            "C": "准确度",
            "D": "线性"
        },
        "answer": "D",
        "answer_text": "线性"
    },

    "2-52": {
        "text": "色谱峰面积的RSD用于评价（ ）",
        "options": {
            "A": "色谱柱的效能",
            "B": "色谱系统的重复性",
            "C": "方法的灵敏度",
            "D": "方法的准确度"
        },
        "answer": "B",
        "answer_text": "色谱系统的重复性"
    },

    "2-53": {
        "text": "拖尾因子用于评价（ ）",
        "options": {
            "A": "色谱柱的效能",
            "B": "色谱峰的对称性",
            "C": "方法的灵敏度",
            "D": "方法的准确度"
        },
        "answer": "B",
        "answer_text": "色谱峰的对称性"
    },
    "2-54": {
        "text": "定量限要求信噪比的限度为（ ）",
        "options": {
            "A": "1",
            "B": "3",
            "C": "5",
            "D": "10"
        },
        "answer": "D",
        "answer_text": "10"
    },

    "2-55": {
        "text": "较短时间内，相同条件下，由同一分析人员连续测定所得结果的RSD称为（ ）",
        "options": {
            "A": "重现性",
            "B": "重复性",
            "C": "稳定性",
            "D": "中间精密度"
        },
        "answer": "B",
        "answer_text": "重复性"
    },

    "2-56": {
        "text": "HPLC常用的定性参数是（ ）",
        "options": {
            "A": "峰面积",
            "B": "峰高",
            "C": "分离度",
            "D": "保留时间"
        },
        "answer": "D",
        "answer_text": "保留时间"
    },
    "2-57": {
        "text": "中性乙醇是指（ ）",
        "options": {
            "A": "将乙醇pH调至7",
            "B": "将乙醇pH调至7±1",
            "C": "对指示剂显中性",
            "D": "对酚酞显中性"
        },
        "answer": "C",
        "answer_text": "对指示剂显中性"
    },
    "2-58": {
        "text": "用高氯酸滴定时，常用的溶剂是（ ）",
        "options": {
            "A": "水",
            "B": "乙二胺",
            "C": "冰醋酸",
            "D": "液氨"
        },
        "answer": "C",
        "answer_text": "冰醋酸"
    },
    "2-59": {
        "text": "容量分析法的相对误差一般为（ ）",
        "options": {
            "A": "≤0.2%",
            "B": "≤0.3%",
            "C": "≤0.5%",
            "D": "≤2%"
        },
        "answer": "A",
        "answer_text": "≤0.2%"
    },
    "2-60": {
        "text": "《中国药典》规定的滴定度（T）是指（ ）",
        "options": {
            "A": "每1ml实际浓度的滴定液所相当的被测药物的质量（mg）",
            "B": "每1ml规定浓度的滴定液所相当的被测药物的质量（mg）",
            "C": "每1 mg被测药物所相当的滴定液的实际浓度",
            "D": "每1 mg被测药物所相当的滴定液的规定浓度"
        },
        "answer": "B",
        "answer_text": "每1ml规定浓度的滴定液所相当的被测药物的质量（mg）"
    },
    "2-61": {
        "text": "下列研究目的中，体内分析使用毛发样品的是（ ）",
        "options": {
            "A": "生物利用度",
            "B": "药物清除率",
            "C": "药物剂量回收",
            "D": "体内微量元素测定"
        },
        "answer": "D",
        "answer_text": "体内微量元素测定"
    },

    "2-62": {
        "text": "在体内药物分析方法的建立过程中，用空白生物基质试验进行验证的指标是 ( )",
        "options": {
            "A": "方法的定量范围",
            "B": "方法的准确度",
            "C": "方法的精密度",
            "D": "方法的特异性"
        },
        "answer": "D",
        "answer_text": "方法的特异性"
    },

    "2-63": {
        "text": "用于评价样品处理方法将体内样品中待测物从生物介质中提取出来的能力的是( )",
        "options": {
            "A": "准确度",
            "B": "精密度",
            "C": "提取回收率",
            "D": "定量下限"
        },
        "answer": "C",
        "answer_text": "提取回收率"
    },

    "2-64": {
        "text": "用于分析过程中对分析样品进行质控的是( )",
        "options": {
            "A": "准确度",
            "B": "精密度",
            "C": "QC样品",
            "D": "定量下限"
        },
        "answer": "C",
        "answer_text": "QC样品"
    },

    "2-65": {
        "text": "临床治疗药物监测宜选用的体内样品是( )",
        "options": {
            "A": "血清",
            "B": "尿液",
            "C": "毛发",
            "D": "粪便"
        },
        "answer": "A",
        "answer_text": "血清"
    },
    "2-66": {
        "text": "药物体内代谢类型研究宜选用的体内样品是( )",
        "options": {
            "A": "血清",
            "B": "尿液",
            "C": "毛发",
            "D": "粪便"
        },
        "answer": "B",
        "answer_text": "尿液"
    },

    "2-67": {
        "text": "去除血浆中蛋白质，可加入( )",
        "options": {
            "A": "甲醇",
            "B": "异丙醇",
            "C": "硝酸",
            "D": "氢氧化钠"
        },
        "answer": "A",
        "answer_text": "甲醇"
    },

    "2-68": {
        "text": "体内药物分析中，标准曲线至少由几个浓度的系列溶液组成( )",
        "options": {
            "A": "5个",
            "B": "6个",
            "C": "8个",
            "D": "10个"
        },
        "answer": "B",
        "answer_text": "6个"
    },

    "2-69": {
        "text": "使用QC样品考察批内RSD，至少需要多少个样品的分析结果( )",
        "options": {
            "A": "3个",
            "B": "5个",
            "C": "9个",
            "D": "15个"
        },
        "answer": "D",
        "answer_text": "15个"
    },

    "2-70": {
        "text": "使用QC样品考察批间RSD，至少需要多少个样品的分析结果( )",
        "options": {
            "A": "9个",
            "B": "15个",
            "C": "27个",
            "D": "45个"
        },
        "answer": "D",
        "answer_text": "45个"
    },
    "2-71": {
        "text": "乙酰水杨酸含量测定中避免水杨酸干扰的中和滴定法是（ ）",
        "options": {
            "A": "直接滴定法",
            "B": "氧化中和法",
            "C": "双相滴定法",
            "D": "水解中和法"
        },
        "answer": "D",
        "answer_text": "水解中和法"
    },

    "2-72": {
        "text": "阿司匹林与碳酸钠试液共热后，再加稀硫酸酸化，产生的白色沉淀为（ ）",
        "options": {
            "A": "苯酚",
            "B": "乙酰水杨酸",
            "C": "水杨酸",
            "D": "苯甲酸"
        },
        "answer": "C",
        "answer_text": "水杨酸"
    },

    "2-73": {
        "text": "对乙酰氨基酚中检查的特殊杂质是（ ）",
        "options": {
            "A": "水杨醛",
            "B": "对氨基酚",
            "C": "水杨酸",
            "D": "苯甲酸"
        },
        "answer": "B",
        "answer_text": "对氨基酚"
    },

    "2-74": {
        "text": "两步滴定法测定阿司匹林含量是因为（ ）",
        "options": {
            "A": "片剂中有其他碱性物质",
            "B": "阿司匹林具有酸碱两性",
            "C": "片剂中有其他酸性物质",
            "D": "使滴定终点明显"
        },
        "answer": "C",
        "answer_text": "片剂中有其他酸性物质"
    },
    "2-75": {
        "text": "炽灼后产生的气体能使湿润的醋酸铅试纸显黑色的药物是( )",
        "options": {
            "A": "阿司匹林",
            "B": "布洛芬",
            "C": "对乙酰氨基酚",
            "D": "美洛昔康"
        },
        "answer": "D",
        "answer_text": "美洛昔康"
    },
    "2-76": {
        "text": "鉴别水杨酸及其盐类，最常用的试剂是( )",
        "options": {
            "A": "碘化钾",
            "B": "三氯化铁",
            "C": "硫酸亚铁",
            "D": "亚铁氰化钾"
        },
        "answer": "B",
        "answer_text": "三氯化铁"
    },
    "2-77": {
        "text": "阿司匹林应检查的杂质是( )",
        "options": {
            "A": "苯甲酸",
            "B": "对氨基酚",
            "C": "水杨酸钠",
            "D": "水杨酸"
        },
        "answer": "D",
        "answer_text": "水杨酸"
    },
    "2-78": {
        "text": "某药物与碳酸钠试液加热水解，放冷，加稀硫酸酸化后，析出白色沉淀并有醋酸臭气产生，则该药物是( )",
        "options": {
            "A": "苯甲酸",
            "B": "对氨基水杨酸钠",
            "C": "醋酸",
            "D": "阿司匹林"
        },
        "answer": "D",
        "answer_text": "阿司匹林"
    },
    "2-79": {
        "text": "血浆中阿司匹林与水杨酸的含量测定可采用( )",
        "options": {
            "A": "水解后剩余滴定法",
            "B": "GC法",
            "C": "两步滴定法",
            "D": "HPLC法"
        },
        "answer": "D",
        "answer_text": "HPLC法"
    },
    "2-80": {
        "text": "人血浆中布洛芬的立体选择性研究可采用（ ）",
        "options": {
            "A": "UV法",
            "B": "GC法",
            "C": "酸碱滴定法",
            "D": "HPLC法"
        },
        "answer": "D",
        "answer_text": "HPLC法"
    },
    "2-81": {
        "text": "下列哪个药物不具有重氮化－偶合反应",
        "options": {
            "A": "盐酸丁卡因",
            "B": "对乙酰氨基酚",
            "C": "盐酸普鲁卡因",
            "D": "对氨基水杨酸钠"
        },
        "answer": "A",
        "answer_text": "盐酸丁卡因"
    },
    "2-82": {
        "text": "亚硝酸钠滴定指示终点的方法有若干，我国药典采用的方法为",
        "options": {
            "A": "电位法",
            "B": "外指示剂法",
            "C": "内指示剂法",
            "D": "永停滴定法"
        },
        "answer": "A",
        "answer_text": "电位法"
    },
    "2-83": {
        "text": "不可采用亚硝酸钠滴定法测定的药物是",
        "options": {
            "A": "Ar-NH2",
            "B": "Ar-NO2",
            "C": "Ar-NHCOR",
            "D": "Ar-NHR"
        },
        "answer": "D",
        "answer_text": "Ar-NHR"
    },
    "2-84": {
        "text": "盐酸普鲁卡因常用鉴别反应有",
        "options": {
            "A": "重氮化－偶合反应",
            "B": "氧化反应",
            "C": "磺化反应",
            "D": "碘化反应"
        },
        "answer": "A",
        "answer_text": "重氮化－偶合反应"
    },
    "2-85": {
        "text": "亚硝酸钠滴定法测定时，一般加入溴化钾，目的是",
        "options": {
            "A": "使终点变色明显",
            "B": "使氨基游离",
            "C": "加快反应速度",
            "D": "增强药物碱性"
        },
        "answer": "C",
        "answer_text": "加快反应速度"
    },
    "2-86": {
        "text": "下列药物不属于对氨基苯甲酸酯类的是",
        "options": {
            "A": "盐酸利多卡因",
            "B": "苯佐卡因",
            "C": "盐酸丁卡因",
            "D": "盐酸普鲁卡因"
        },
        "answer": "A",
        "answer_text": "盐酸利多卡因"
    },
    "2-87": {
        "text": "区别巴比妥与含硫巴比妥药物可采用",
        "options": {
            "A": "铜盐反应",
            "B": "甲醛-硫酸反应",
            "C": "银盐反应",
            "D": "碘液反应"
        },
        "answer": "A",
        "answer_text": "铜盐反应"
    },
    "2-88": {
        "text": "根据巴比妥类药物的结构特点可采用以下方法对其进行定量分析，其中不对的方法是",
        "options": {
            "A": "银量法",
            "B": "溴量法",
            "C": "紫外分光光度法",
            "D": "三氯化铁比色法"
        },
        "answer": "D",
        "answer_text": "三氯化铁比色法"
    },
    "2-89": {
        "text": "非水液中滴定巴比妥类药物，其目的是",
        "options": {
            "A": "巴比妥类的Ka值增大，酸性增强",
            "B": "增加巴比妥类的溶解性",
            "C": "巴比妥类的Ka值减少",
            "D": "除去干扰物的影响"
        },
        "answer": "A",
        "answer_text": "巴比妥类的Ka值增大，酸性增强"
    },
    "2-90": {
        "text": "常用于鉴别司可巴比妥的试液是",
        "options": {
            "A": "氯化钾试液",
            "B": "碘化钾试液",
            "C": "碘试液",
            "D": "氢溴酸试液"
        },
        "answer": "C",
        "answer_text": "碘试液"
    },
    "2-91": {
        "text": "关于巴比妥类药物鉴别中的银盐反应，以下叙述正确的是",
        "options": {
            "A": "在适当的酸性条件下，生成难溶性的二银盐",
            "B": "在适当的酸性条件下，生成难溶性的一银盐",
            "C": "在适当的碱性条件下，生成难溶性的二银盐",
            "D": "在适当的碱性条件下，生成难溶性的一银盐"
        },
        "answer": "C",
        "answer_text": "在适当的碱性条件下，生成难溶性的二银盐"
    },
    "2-92": {
        "text": "决定巴比妥类药物共性的是",
        "options": {
            "A": "巴比妥酸的取代基性质",
            "B": "巴比妥酸的取代基个数",
            "C": "巴比妥酸的环状结构",
            "D": "巴比妥酸的取代基位置"
        },
        "answer": "C",
        "answer_text": "巴比妥酸的环状结构"
    },
    "2-93": {
        "text": "硫喷妥在0.1mol/LNaOH溶液中的紫外吸收特征是",
        "options": {
            "A": "无明显紫外吸收峰",
            "B": "最大吸收峰为240nm",
            "C": "最大吸收峰为304nm",
            "D": "最大吸收峰为255nm"
        },
        "answer": "C",
        "answer_text": "最大吸收峰为304nm"
    },
    "2-94": {
        "text": "巴比妥类药物与碱溶液共热，水解释放出氨气，是由于",
        "options": {
            "A": "分子结构中含有酰亚胺基团",
            "B": "分子结构中含有羰基",
            "C": "分子结构中含有丙烯基",
            "D": "分子结构中含有苯取代基"
        },
        "answer": "A",
        "answer_text": "分子结构中含有酰亚胺基团"
    },
    "2-95": {
        "text": "用于苯巴比妥鉴别的反应是",
        "options": {
            "A": "硝酸反应",
            "B": "甲醛-硫酸反应",
            "C": "与碘液反应",
            "D": "戊烯二醛反应"
        },
        "answer": "B",
        "answer_text": "甲醛-硫酸反应"
    },
    "2-96": {
        "text": "中国药典用于地西泮含量测定的是",
        "options": {
            "A": "非水滴定",
            "B": "HPLC法",
            "C": "溴量法",
            "D": "紫外分光光度法"
        },
        "answer": "A",
        "answer_text": "非水滴定"
    },
    "3-97": {
        "text": "ChP中需检查游离生育酚的药物是",
        "options": {
            "A": "维生素A",
            "B": "维生素B1",
            "C": "维生素C",
            "D": "维生素D",
            "E": "维生素E"
        },
        "answer": "E",
        "answer_text": "维生素E"
    },
    "3-98": {
        "text": "维生素E的含量测定方法中，以下叙述正确的是",
        "options": {
            "A": "铈量法适用于复方制剂中维生素E的定量",
            "B": "铈量法适用于纯度不高的维生素E的定量",
            "C": "铈量法适用于纯度高的维生素E的定量",
            "D": "铈量法适用于各种存在形式的维生素E的定量"
        },
        "answer": "C",
        "answer_text": "铈量法适用于纯度高的维生素E的定量"
    },
    "3-99": {
        "text": "紫外分光光度法测定维生素A的方法是",
        "options": {
            "A": "三点校正分光光度法",
            "B": "差示分光光度法",
            "C": "比色法",
            "D": "三波长分光光度法"
        },
        "answer": "A",
        "answer_text": "三点校正分光光度法"
    },
    "3-100": {
        "text": "用碘量法测定维生素C注射液含量时，由于下列哪一因素的干扰需加丙酮作掩蔽剂以消除干扰",
        "options": {
            "A": "氧化剂",
            "B": "抗氧剂",
            "C": "水份",
            "D": "溶解氧"
        },
        "answer": "B",
        "answer_text": "抗氧剂"
    },
    "3-101": {
        "text": "能发生硫色素特征反应的是",
        "options": {
            "A": "维生素A",
            "B": "维生素B1",
            "C": "维生素C",
            "D": "维生素E"
        },
        "answer": "B",
        "answer_text": "维生素B1"
    },
    "3-102": {
        "text": "ChP中需检查麦角甾醇的药物是",
        "options": {
            "A": "维生素A",
            "B": "维生素B1",
            "C": "维生素D2",
            "D": "维生素D3",
            "E": "维生素E"
        },
        "answer": "C",
        "answer_text": "维生素D2"
    },
    "3-103": {
        "text": "维生素C的鉴别反应，ChP采用的试剂是",
        "options": {
            "A": "碱性酒石酸铜",
            "B": "硝酸银",
            "C": "碘化铋钾",
            "D": "乙酰丙酮"
        },
        "answer": "B",
        "answer_text": "硝酸银"
    },
    "3-104": {
        "text": "2,6-二氯靛酚法测定维生素C含量",
        "options": {
            "A": "滴定在酸性介质中进行",
            "B": "2,6-二氯靛酚由红色至无色指示终点",
            "C": "2,6-二氯靛酚的还原型为红色",
            "D": "2,6-二氯靛酚的还原型为蓝色"
        },
        "answer": "A",
        "answer_text": "滴定在酸性介质中进行"
    },
    "3-105": {
        "text": "下列药物的碱性溶液，加入铁氰化钾后，再加正丁醇，显蓝色荧光的是",
        "options": {
            "A": "维生素A",
            "B": "维生素B1",
            "C": "维生素C",
            "D": "维生素D",
            "E": "维生素E"
        },
        "answer": "B",
        "answer_text": "维生素B1"
    },
    "3-106": {
        "text": "维生素C注射液中抗氧化剂亚硫酸氢钠对碘量法有干扰，能排除其干扰的掩蔽剂是",
        "options": {
            "A": "硼酸",
            "B": "草酸",
            "C": "丙酮",
            "D": "酒石酸"
        },
        "answer": "C",
        "answer_text": "丙酮"
    },
    "3-107": {
        "text": "各国药典对甾体激素类药物常用HPLC或GC法测定其含量，主要原因是",
        "options": {
            "A": "它们没有特征紫外吸收，不能用紫外分光光度法",
            "B": "不能用滴定分析法进行测定",
            "C": "由于“其它甾体”的存在，色谱法可消除它们的干扰",
            "D": "色谱法准确度优于滴定分析法"
        },
        "answer": "C",
        "answer_text": "由于“其它甾体”的存在，色谱法可消除它们的干扰"
    },
    "3-108": {
        "text": "下列供试品中可以用氧瓶燃烧进行鉴别实验的是",
        "options": {
            "A": "地塞米松磷酸钠注射液",
            "B": "葡萄糖注射液",
            "C": "对乙酰氨基酚片",
            "D": "维生素C注射液"
        },
        "answer": "A",
        "answer_text": "地塞米松磷酸钠注射液"
    },
    "3-109": {
        "text": "甾体激素黄体酮的特有反应产生蓝紫色用于鉴别，所用的试剂是",
        "options": {
            "A": "亚硝基铁氰化钾",
            "B": "硫酸-甲醇",
            "C": "苦味酸",
            "D": "重氮苯磺酸"
        },
        "answer": "A",
        "answer_text": "亚硝基铁氰化钾"
    },
    "3-110": {
        "text": "四氮唑比色法测定甾体激素时，对下列哪个基团有特异反应",
        "options": {
            "A": "D4-3-酮基",
            "B": "C17-a-醇酮基",
            "C": "17,21-二羟-20酮基",
            "D": "C17-甲酮基"
        },
        "answer": "B",
        "answer_text": "C17-a-醇酮基"
    },
    "3-111": {
        "text": "kober 反应适用于以下哪项的含量测定",
        "options": {
            "A": "雄激素",
            "B": "雌激素",
            "C": "皮质激素",
            "D": "孕激素"
        },
        "answer": "B",
        "answer_text": "雌激素"
    },
    "3-112": {
        "text": "四氮唑比色法适用于下列何种药物的测定",
        "options": {
            "A": "雄激素",
            "B": "雌激素",
            "C": "皮质激素",
            "D": "孕激素"
        },
        "answer": "C",
        "answer_text": "皮质激素"
    },
    "3-113": {
        "text": "以下何类甾体激素分子中具有a-醇酮基而具有还原性",
        "options": {
            "A": "雄激素",
            "B": "雌激素",
            "C": "皮质激素",
            "D": "孕激素"
        },
        "answer": "C",
        "answer_text": "皮质激素"
    },
    "3-114": {
        "text": "异烟肼比色法测定甾体激素类药物的含量时，对哪项更有专属性",
        "options": {
            "A": "D4-3-酮基",
            "B": "D5-7-酮基",
            "C": "C11-酮基",
            "D": "C17-酮基",
            "E": "C20-酮基"
        },
        "answer": "A",
        "answer_text": "D4-3-酮基"
    },
    "3-115": {
        "text": "《中国药典》中甾体激素之“其他甾体”检查广泛采用",
        "options": {
            "A": "GC",
            "B": "HPLC",
            "C": "TLC",
            "D": "UV"
        },
        "answer": "B",
        "answer_text": "HPLC"
    },
    "3-116": {
        "text": "与碱性酒石酸酮试液反应生成砖红色沉淀的药物是",
        "options": {
            "A": "黄体酮",
            "B": "甲睾酮",
            "C": "醋酸地塞米松",
            "D": "炔雌醇"
        },
        "answer": "C",
        "answer_text": "醋酸地塞米松"
    },
    "3-117": {
        "text": "具有b-内酰胺环结构的药物是",
        "options": {
            "A": "四环素",
            "B": "苯巴比妥",
            "C": "普鲁卡因青霉素",
            "D": "链霉素"
        },
        "answer": "C",
        "answer_text": "普鲁卡因青霉素"
    },
    "3-118": {
        "text": "氨苄青霉素可采用的含量测定方法是",
        "options": {
            "A": "酸性染料比色法",
            "B": "双相滴定法",
            "C": "HPLC",
            "D": "亚硝酸钠滴定法"
        },
        "answer": "C",
        "answer_text": "HPLC"
    },
    "3-119": {
        "text": "可用茚三酮反应进行鉴别的药物是",
        "options": {
            "A": "四环素",
            "B": "苯巴比妥",
            "C": "庆大霉素",
            "D": "金霉素"
        },
        "answer": "C",
        "answer_text": "庆大霉素"
    },
    "3-120": {
        "text": "链霉素的特征反应是",
        "options": {
            "A": "硫色素反应",
            "B": "重氮化-偶合反应",
            "C": "麦芽酚反应",
            "D": "差向异构反应"
        },
        "answer": "C",
        "answer_text": "麦芽酚反应"
    },
    "3-121": {
        "text": "β-内酰胺类抗生素药物分析的基础性质是",
        "options": {
            "A": "氢化噻唑环的羟基的酸性",
            "B": "β-内酰胺环的不稳定",
            "C": "分子结构中的共轭双键骨架，手性碳原子",
            "D": "A+B+C"
        },
        "answer": "D",
        "answer_text": "A+B+C"
    },
    "3-122": {
        "text": "在弱酸性（pH=2.0~6.0）溶液中会发生差向异构的药物是",
        "options": {
            "A": "四环素",
            "B": "庆大霉素",
            "C": "链霉素",
            "D": "头孢氨苄"
        },
        "answer": "A",
        "answer_text": "四环素"
    },
    "3-123": {
        "text": "左氧氟沙星应检查的杂质是",
        "options": {
            "A": "甲醇",
            "B": "乙醇",
            "C": "丙酮",
            "D": "光学异构体"
        },
        "answer": "D",
        "answer_text": "光学异构体"
    },
    "3-124": {
        "text": "具有丙二酸呈色反应的药物是",
        "options": {
            "A": "诺氟沙星",
            "B": "磺胺嘧啶",
            "C": "氯丙嗪",
            "D": "司可巴比妥"
        },
        "answer": "A",
        "answer_text": "诺氟沙星"
    },
    "3-125": {
        "text": "可采用重氮化偶合反应进行鉴别的药物是",
        "options": {
            "A": "诺氟沙星",
            "B": "磺胺嘧啶",
            "C": "氯丙嗪",
            "D": "司可巴比妥"
        },
        "answer": "B",
        "answer_text": "磺胺嘧啶"
    },
    "3-126": {
        "text": "中国药典鉴别诺氟沙星采用的方法是",
        "options": {
            "A": "GC",
            "B": "HPLC",
            "C": "紫外分光光度法",
            "D": "可见分光光度法"
        },
        "answer": "B",
        "answer_text": "HPLC"
    },
    "3-127": {
        "text": "中国药典检查诺氟沙星采用的方法是",
        "options": {
            "A": "GC",
            "B": "HPLC",
            "C": "紫外分光光度法",
            "D": "可见分光光度法"
        },
        "answer": "B",
        "answer_text": "HPLC"
    },
    "3-128": {
        "text": "能与铜离子发生有色沉淀的药物是",
        "options": {
            "A": "诺氟沙星",
            "B": "磺胺嘧啶",
            "C": "氯丙嗪",
            "D": "阿托品"
        },
        "answer": "B",
        "answer_text": "磺胺嘧啶"
    },
    "3-129": {
        "text": "左氧氟沙星原料药含量测定，中国药典采用的是离子对高效液相色谱法，所用的离子对试剂是",
        "options": {
            "A": "高氯酸钠",
            "B": "乙二胺",
            "C": "磷酸二氢钠",
            "D": "磷酸氢钠"
        },
        "answer": "A",
        "answer_text": "高氯酸钠"
    },
    "3-130": {
        "text": "中国药典规定，凡检查含量均匀度的制剂不再检查",
        "options": {
            "A": "溶出度",
            "B": "重（装）量差异",
            "C": "崩解时限",
            "D": "释放度"
        },
        "answer": "B",
        "answer_text": "重（装）量差异"
    },
    "3-131": {
        "text": "下列哪些制剂需要检查含量均匀度",
        "options": {
            "A": "滴眼剂",
            "B": "小剂量片剂",
            "C": "注射剂",
            "D": "糖浆剂"
        },
        "answer": "B",
        "answer_text": "小剂量片剂"
    },
    "3-132": {
        "text": "检查化学药品胶囊的装量差异时，一般取样量为",
        "options": {
            "A": "10粒",
            "B": "20粒",
            "C": "30粒",
            "D": "5粒"
        },
        "answer": "B",
        "answer_text": "20粒"
    },
    "3-133": {
        "text": "单剂量固体制剂含量均匀度的检查是为了",
        "options": {
            "A": "控制小剂量的固体制剂、单剂中含药量的均匀程度",
            "B": "严格重量差异的检查",
            "C": "严格含量测定的可信程度",
            "D": "避免制剂工艺的影响"
        },
        "answer": "A",
        "answer_text": "控制小剂量的固体制剂、单剂中含药量的均匀程度"
    },
    "3-134": {
        "text": "溶出度检查时，规定的介质温度应为",
        "options": {
            "A": "37±0.5℃",
            "B": "37±1.0℃",
            "C": "37±2.0℃",
            "D": "37±5.0℃"
        },
        "answer": "A",
        "answer_text": "37±0.5℃"
    },
    "3-135": {
        "text": "溶出度测定的结果判断：6片中每片的溶出量按标示量计算，均应不低于规定限度Q，除另有规定外，“Q”值应为标示量的",
        "options": {
            "A": "60％",
            "B": "70％",
            "C": "80％",
            "D": "90％"
        },
        "answer": "B",
        "answer_text": "70％"
    },
    "3-136": {
        "text": "制订制剂分析方法时，须加注意的问题是",
        "options": {
            "A": "添加剂对药物的稀释作用",
            "B": "辅料对药物性质的影响",
            "C": "辅料对药物的吸附作用",
            "D": "辅料对药物检定的干扰作用"
        },
        "answer": "D",
        "answer_text": "辅料对药物检定的干扰作用"
    },
    "3-137": {
        "text": "含片照《中国药典》二部崩解时限检查法（附录ⅩA）检查，除另有规定外，应全部崩解的时间为",
        "options": {
            "A": "10分钟",
            "B": "15分钟",
            "C": "30分钟",
            "D": "60分钟"
        },
        "answer": "C",
        "answer_text": "30分钟"
    },
    "3-138": {
        "text": "《中国药典》规定，凡检查溶出度的制剂，可不再进行",
        "options": {
            "A": "含量均匀度检查",
            "B": "崩解时限检查",
            "C": "主药含量测定",
            "D": "含（装）量差异检查"
        },
        "answer": "B",
        "answer_text": "崩解时限检查"
    },
    "3-139": {
        "text": "《中国药典》规定的糖衣片的崩解时限是",
        "options": {
            "A": "60分钟",
            "B": "45分钟",
            "C": "15分钟",
            "D": "30分钟"
        },
        "answer": "A",
        "answer_text": "60分钟"
    },
    "3-140": {
        "text": "测定亚铁盐含量时为避免干扰，应选择",
        "options": {
            "A": "重铬酸钾法",
            "B": "高锰酸钾法",
            "C": "铈量法",
            "D": "容量沉淀法"
        },
        "answer": "C",
        "answer_text": "铈量法"
    },
    "3-141": {
        "text": "《中国药典》规定不溶性微粒检查法系在可见异物检查符合规定后，用以检查不溶性微粒的大小及数量的是",
        "options": {
            "A": "所有注射剂",
            "B": "溶液型静脉用注射剂",
            "C": "注射液",
            "D": "溶液型注射剂"
        },
        "answer": "B",
        "answer_text": "溶液型静脉用注射剂"
    },
    "3-142": {
        "text": "原料药含量百分数如未规定上限，系指不超过",
        "options": {
            "A": "100.1％",
            "B": "101.0％",
            "C": "100.0％",
            "D": "110.1％"
        },
        "answer": "B",
        "answer_text": "101.0％"
    },
    "3-143": {
        "text": "中药及其制剂分析时，最常用的纯化方法是",
        "options": {
            "A": "结晶法",
            "B": "柱色谱法",
            "C": "HPLC",
            "D": "GC"
        },
        "answer": "B",
        "answer_text": "柱色谱法"
    },
    "3-144": {
        "text": "在中药材的灰分检查中，更能准确反映外来杂质质量的是",
        "options": {
            "A": "总灰分",
            "B": "硫酸盐灰分",
            "C": "酸不溶性灰分",
            "D": "碳酸盐灰分"
        },
        "answer": "C",
        "answer_text": "酸不溶性灰分"
    },
    "3-145": {
        "text": "对中药及其制剂进行残留农药检查时，当接触农药不明时，一般可测定",
        "options": {
            "A": "总有机氯量",
            "B": "总有机溴量",
            "C": "总有机磷量",
            "D": "总有机氯量和总有机磷量"
        },
        "answer": "D",
        "answer_text": "总有机氯量和总有机磷量"
    },
    "3-146": {
        "text": "对易霉变的桃仁需额外进行的检查项目是",
        "options": {
            "A": "含氯量测定",
            "B": "含磷量测定",
            "C": "含硫量测定",
            "D": "黄曲霉素测定"
        },
        "answer": "D",
        "answer_text": "黄曲霉素测定"
    },
    "3-147": {
        "text": "以下药品中需进行显微鉴别的是",
        "options": {
            "A": "肉桂油",
            "B": "西洋参口服液",
            "C": "山楂叶提取物",
            "D": "三七"
        },
        "answer": "D",
        "answer_text": "三七"
    },
    "3-148": {
        "text": "含挥发性贵重药的药品中水分测定用",
        "options": {
            "A": "甲苯法",
            "B": "减压干燥法",
            "C": "烘干法",
            "D": "HPLC"
        },
        "answer": "B",
        "answer_text": "减压干燥法"
    },
    "3-149": {
        "text": "不含或少含挥发性成分的药品中水分测定用",
        "options": {
            "A": "甲苯法",
            "B": "减压干燥法",
            "C": "烘干法",
            "D": "HPLC"
        },
        "answer": "C",
        "answer_text": "烘干法"
    },
    "3-150": {
        "text": "含挥发性成分的药品中水分测定用",
        "options": {
            "A": "甲苯法",
            "B": "减压干燥法",
            "C": "烘干法",
            "D": "HPLC"
        },
        "answer": "A",
        "answer_text": "甲苯法"
    },
    "3-151": {
        "text": "利用其外观、形状及感官性质等特征作为真伪鉴别依据的方法是",
        "options": {
            "A": "性状鉴别",
            "B": "显微鉴别",
            "C": "色谱鉴别",
            "D": "化学鉴别"
        },
        "answer": "A",
        "answer_text": "性状鉴别"
    },
    "3-152": {
        "text": "矿物药的主要成分为无机化合物，其鉴别方法是",
        "options": {
            "A": "性状鉴别",
            "B": "显微鉴别",
            "C": "色谱鉴别",
            "D": "化学鉴别"
        },
        "answer": "D",
        "answer_text": "化学鉴别"
    },
    "3-153": {
        "text": "鉴别人血白蛋白的方法是",
        "options": {
            "A": "凯氏定氮法",
            "B": "家兔法",
            "C": "免疫电泳法",
            "D": "酶联免疫法"
        },
        "answer": "C",
        "answer_text": "免疫电泳法"
    },
    "3-154": {
        "text": "鉴别重组乙肝疫苗的方法是",
        "options": {
            "A": "凯氏定氮法",
            "B": "家兔法",
            "C": "免疫电泳法",
            "D": "酶联免疫法"
        },
        "answer": "D",
        "answer_text": "酶联免疫法"
    },
    "3-155": {
        "text": "热源检查以哪种实验方法作为基准方法",
        "options": {
            "A": "豚鼠法",
            "B": "小鼠法",
            "C": "大鼠法",
            "D": "家兔法"
        },
        "answer": "D",
        "answer_text": "家兔法"
    },
    "3-156": {
        "text": "鉴别人用狂犬疫苗的方法是",
        "options": {
            "A": "凯氏定氮法",
            "B": "家兔法",
            "C": "免疫电泳法",
            "D": "酶联免疫法"
        },
        "answer": "D",
        "answer_text": "酶联免疫法"
    },
    "3-157": {
        "text": "下列不属于生物制品的是",
        "options": {
            "A": "重组DNA制品",
            "B": "重组RNA制品",
            "C": "重组乙肝疫苗",
            "D": "人血白蛋白"
        },
        "answer": "B",
        "answer_text": "重组RNA制品"
    },
    "3-158": {
        "text": "下列属于生物制品的是",
        "options": {
            "A": "门冬酰胺",
            "B": "肌苷",
            "C": "胃蛋白酶",
            "D": "人血白蛋白"
        },
        "answer": "D",
        "answer_text": "人血白蛋白"
    },
    "3-159": {
        "text": "人血白蛋白中残余乙醇含量测定的方法是",
        "options": {
            "A": "免疫双扩散法",
            "B": "GC",
            "C": "康卫皿扩散法",
            "D": "免疫电泳法"
        },
        "answer": "C",
        "answer_text": "康卫皿扩散法"
    },
    "3-160": {
        "text": "过敏性试验一般使用的动物是",
        "options": {
            "A": "豚鼠",
            "B": "小鼠",
            "C": "大鼠",
            "D": "家兔"
        },
        "answer": "A",
        "answer_text": "豚鼠"
    },
    "3-161": {
        "text": "单克隆抗体制品中小鼠腹水瘤细胞DNA残留量采用的检测方法是",
        "options": {
            "A": "电泳法",
            "B": "HPLC",
            "C": "GC",
            "D": "DNA探针杂交"
        },
        "answer": "D",
        "answer_text": "DNA探针杂交"
    },
    "3-162": {
        "text": "冻干制品进行真空度检查时，瓶内应出现的辉光颜色为",
        "options": {
            "A": "红",
            "B": "绿",
            "C": "蓝紫",
            "D": "橙红"
        },
        "answer": "C",
        "answer_text": "蓝紫"
    },
    "4-1": {
        "text": "《药品非临床研究质量管理规定》的缩写为（         ）",
        "options": {
            "A": "GCP",
            "B": "GMP",
            "C": "GLP",
            "D": "GAP",
            "E": "GSP"
        },
        "answer": "C",
        "answer_text": "GLP"
    },
    "4-2": {
        "text": "《药品生产质量管理规范》的缩写为（         ）",
        "options": {
            "A": "GCP",
            "B": "GMP",
            "C": "GLP",
            "D": "GAP",
            "E": "GSP"
        },
        "answer": "B",
        "answer_text": "GMP"
    },
    "4-3": {
        "text": "《药品经营质量管理规范》的缩写为（         ）",
        "options": {
            "A": "GCP",
            "B": "GMP",
            "C": "GLP",
            "D": "GAP",
            "E": "GSP"
        },
        "answer": "E",
        "answer_text": "GSP"
    },
    "4-4": {
        "text": "《药品临床试验质量管理规范》的缩写为（      ）",
        "options": {
            "A": "GCP",
            "B": "GMP",
            "C": "GLP",
            "D": "GAP",
            "E": "GSP"
        },
        "answer": "A",
        "answer_text": "GCP"
    },
    "4-5": {
        "text": "《美国药典》的缩写为（     ）",
        "options": {
            "A": "USP",
            "B": "BP",
            "C": "INN",
            "D": "JP",
            "E": "Ch.P"
        },
        "answer": "A",
        "answer_text": "USP"
    },
    "4-6": {
        "text": "国际非专利药品的缩写为（     ）",
        "options": {
            "A": "USP",
            "B": "BP",
            "C": "INN",
            "D": "JP",
            "E": "Ch.P"
        },
        "answer": "C",
        "answer_text": "INN"
    },
    "4-7": {
        "text": "《英国药典》的缩写为（     ）",
        "options": {
            "A": "USP",
            "B": "BP",
            "C": "INN",
            "D": "JP",
            "E": "Ch.P"
        },
        "answer": "B",
        "answer_text": "BP"
    },
    "4-8": {
        "text": "《中国药典》的缩写为（     ）",
        "options": {
            "A": "USP",
            "B": "BP",
            "C": "INN",
            "D": "JP",
            "E": "Ch.P"
        },
        "answer": "E",
        "answer_text": "Ch.P"
    },
    "4-9": {
        "text": "中国药典规定盐酸去氧肾上腺素需检查的特殊杂质（　 　）",
        "options": {
            "A": "对氨基酚",
            "B": "对氨基苯甲酸",
            "C": "酮体",
            "D": "间氨基酚",
            "E": "肾上腺酮",
            "F": "酮胺"
        },
        "answer": "C",
        "answer_text": "酮体"
    },
    "4-10": {
        "text": "中国药典规定盐酸异丙肾上腺素需检查的特殊杂质（　 　）",
        "options": {
            "A": "对氨基酚",
            "B": "对氨基苯甲酸",
            "C": "酮体",
            "D": "间氨基酚",
            "E": "肾上腺酮",
            "F": "酮胺"
        },
        "answer": "C",
        "answer_text": "酮体"
    },
    "4-11": {
        "text": "中国药典规定肾上腺素需检查的特殊杂质（　 　）",
        "options": {
            "A": "对氨基酚",
            "B": "对氨基苯甲酸",
            "C": "酮体",
            "D": "间氨基酚",
            "E": "肾上腺酮",
            "F": "酮胺"
        },
        "answer": "C",
        "answer_text": "酮体"
    },
    "4-12": {
        "text": "中国药典规定重酒石酸去甲肾上腺素需检查的特殊杂质（　 　）",
        "options": {
            "A": "对氨基酚",
            "B": "对氨基苯甲酸",
            "C": "酮体",
            "D": "间氨基酚",
            "E": "肾上腺酮",
            "F": "酮胺"
        },
        "answer": "C",
        "answer_text": "酮体"
    },
    "4-13": {
        "text": "中国药典规定盐酸甲氧明需检查的特殊杂质（　 　）",
        "options": {
            "A": "对氨基酚",
            "B": "对氨基苯甲酸",
            "C": "酮体",
            "D": "间氨基酚",
            "E": "肾上腺酮",
            "F": "酮胺"
        },
        "answer": "F",
        "answer_text": "酮胺"
    },
    "4-14": {
        "text": "中国药典中测定盐酸去氧肾上腺素的含量采用（　 　）",
        "options": {
            "A": "非水滴定",
            "B": "两步滴定法",
            "C": "HPLC法",
            "D": "溴量法",
            "E": "紫外分光光度法",
            "F": "亚硝酸钠滴定法"
        },
        "answer": "D",
        "answer_text": "溴量法"
    },
    "4-15": {
        "text": "中国药典中测定肾上腺素的含量采用（　 　）",
        "options": {
            "A": "非水滴定",
            "B": "两步滴定法",
            "C": "HPLC法",
            "D": "溴量法",
            "E": "紫外分光光度法",
            "F": "亚硝酸钠滴定法"
        },
        "answer": "A",
        "answer_text": "非水滴定"
    },
    "4-16": {
        "text": "中国药典中测定盐酸麻黄碱注射液的含量采用（　 　）",
        "options": {
            "A": "非水滴定",
            "B": "两步滴定法",
            "C": "HPLC法",
            "D": "溴量法",
            "E": "紫外分光光度法",
            "F": "亚硝酸钠滴定法"
        },
        "answer": "C",
        "answer_text": "HPLC法"
    },
    "4-17": {
        "text": "中国药典中测定盐酸异丙肾上腺素的含量采用（　 　）",
        "options": {
            "A": "非水滴定",
            "B": "两步滴定法",
            "C": "HPLC法",
            "D": "溴量法",
            "E": "紫外分光光度法",
            "F": "亚硝酸钠滴定法"
        },
        "answer": "A",
        "answer_text": "非水滴定"
    },
    "4-18": {
        "text": "中国药典中杂质酮体的检查采用（　 　）",
        "options": {
            "A": "非水滴定",
            "B": "两步滴定法",
            "C": "HPLC法",
            "D": "溴量法",
            "E": "紫外分光光度法",
            "F": "亚硝酸钠滴定法"
        },
        "answer": "E",
        "answer_text": "紫外分光光度法"
    },
    "4-19": {
        "text": "中国药典中测定盐酸克仑特罗的含量采用（　 　）",
        "options": {
            "A": "非水滴定",
            "B": "两步滴定法",
            "C": "HPLC法",
            "D": "溴量法",
            "E": "紫外分光光度法",
            "F": "亚硝酸钠滴定法"
        },
        "answer": "F",
        "answer_text": "亚硝酸钠滴定法"
    },
    "4-20": {
        "text": "中国药典中测定硫酸沙丁胺醇片的含量采用（　 　）",
        "options": {
            "A": "非水滴定",
            "B": "两步滴定法",
            "C": "HPLC法",
            "D": "溴量法",
            "E": "紫外分光光度法",
            "F": "亚硝酸钠滴定法"
        },
        "answer": "C",
        "answer_text": "HPLC法"
    },
    "4-21": {
        "text": "中国药典中测定重酒石酸间羟胺的含量采用（　 　）",
        "options": {
            "A": "非水滴定",
            "B": "两步滴定法",
            "C": "HPLC法",
            "D": "溴量法",
            "E": "紫外分光光度法",
            "F": "亚硝酸钠滴定法"
        },
        "answer": "D",
        "answer_text": "溴量法"
    },
    "4-22": {
        "text": "中国药典中测定盐酸甲氧明的含量采用（　 　）",
        "options": {
            "A": "非水滴定",
            "B": "两步滴定法",
            "C": "HPLC法",
            "D": "溴量法",
            "E": "紫外分光光度法",
            "F": "亚硝酸钠滴定法"
        },
        "answer": "A",
        "answer_text": "非水滴定"
    },
    "4-23": {
        "text": "盐酸麻黄碱",
        "options": {
            "A": "与亚硝基铁氰化钠反应显色",
            "B": "与硫酸铜和氢氧化钠试液反应显蓝紫色",
            "C": "与甲醛-硫酸反应显红色",
            "D": "与甲醛-硫酸反应显淡红色",
            "E": "与甲醛-硫酸反应显玫瑰红→橙红→深棕红",
            "F": "与甲醛-硫酸反应显棕色→暗紫色",
            "G": "与甲醛-硫酸反应显紫→棕→绿"
        },
        "answer": "A",
        "answer_text": "与亚硝基铁氰化钠反应显色"
    },
    "4-24": {
        "text": "重酒石酸间羟胺",
        "options": {
            "A": "与亚硝基铁氰化钠反应显色",
            "B": "与硫酸铜和氢氧化钠试液反应显蓝紫色",
            "C": "与甲醛-硫酸反应显红色",
            "D": "与甲醛-硫酸反应显淡红色",
            "E": "与甲醛-硫酸反应显玫瑰红→橙红→深棕红",
            "F": "与甲醛-硫酸反应显棕色→暗紫色",
            "G": "与甲醛-硫酸反应显紫→棕→绿"
        },
        "answer": "B",
        "answer_text": "与硫酸铜和氢氧化钠试液反应显蓝紫色"
    },
    "4-25": {
        "text": "肾上腺素",
        "options": {
            "A": "与亚硝基铁氰化钠反应显色",
            "B": "与硫酸铜和氢氧化钠试液反应显蓝紫色",
            "C": "与甲醛-硫酸反应显红色",
            "D": "与甲醛-硫酸反应显淡红色",
            "E": "与甲醛-硫酸反应显玫瑰红→橙红→深棕红",
            "F": "与甲醛-硫酸反应显棕色→暗紫色",
            "G": "与甲醛-硫酸反应显紫→棕→绿"
        },
        "answer": "C",
        "answer_text": "与甲醛-硫酸反应显红色"
    },
    "4-26": {
        "text": "盐酸异丙肾上腺素",
        "options": {
            "A": "与亚硝基铁氰化钠反应显色",
            "B": "与硫酸铜和氢氧化钠试液反应显蓝紫色",
            "C": "与甲醛-硫酸反应显红色",
            "D": "与甲醛-硫酸反应显淡红色",
            "E": "与甲醛-硫酸反应显玫瑰红→橙红→深棕红",
            "F": "与甲醛-硫酸反应显棕色→暗紫色",
            "G": "与甲醛-硫酸反应显紫→棕→绿"
        },
        "answer": "F",
        "answer_text": "与甲醛-硫酸反应显棕色→暗紫色"
    },
    "4-27": {
        "text": "盐酸去氧肾上腺素",
        "options": {
            "A": "与亚硝基铁氰化钠反应显色",
            "B": "与硫酸铜和氢氧化钠试液反应显蓝紫色",
            "C": "与甲醛-硫酸反应显红色",
            "D": "与甲醛-硫酸反应显淡红色",
            "E": "与甲醛-硫酸反应显玫瑰红→橙红→深棕红",
            "F": "与甲醛-硫酸反应显棕色→暗紫色",
            "G": "与甲醛-硫酸反应显紫→棕→绿"
        },
        "answer": "E",
        "answer_text": "与甲醛-硫酸反应显玫瑰红→橙红→深棕红"
    },
    "4-28": {
        "text": "盐酸甲氧明",
        "options": {
            "A": "与亚硝基铁氰化钠反应显色",
            "B": "与硫酸铜和氢氧化钠试液反应显蓝紫色",
            "C": "与甲醛-硫酸反应显红色",
            "D": "与甲醛-硫酸反应显淡红色",
            "E": "与甲醛-硫酸反应显玫瑰红→橙红→深棕红",
            "F": "与甲醛-硫酸反应显棕色→暗紫色",
            "G": "与甲醛-硫酸反应显紫→棕→绿"
        },
        "answer": "G",
        "answer_text": "与甲醛-硫酸反应显紫→棕→绿"
    },
    "4-29": {
        "text": "水杨酸的鉴别（ ）",
        "options": {
            "A": "在弱酸性条件下与Fe3+反应生成紫堇色配合物",
            "B": "与碘化铋钾生成沉淀",
            "C": "与氨制AgNO3银镜反应",
            "D": "与AgNO3生成二银盐的白色沉淀",
            "E": "在酸性条件下与亚硝酸钠生成重氮盐"
        },
        "answer": "A",
        "answer_text": "在弱酸性条件下与Fe3+反应生成紫堇色配合物"
    },
    "4-30": {
        "text": "巴比妥类的鉴别（ ）",
        "options": {
            "A": "在弱酸性条件下与Fe3+反应生成紫堇色配合物",
            "B": "与碘化铋钾生成沉淀",
            "C": "与氨制AgNO3银镜反应",
            "D": "与AgNO3生成二银盐的白色沉淀",
            "E": "在酸性条件下与亚硝酸钠生成重氮盐"
        },
        "answer": "D",
        "answer_text": "与AgNO3生成二银盐的白色沉淀"
    },
    "4-31": {
        "text": "司可巴比妥的特殊反应（ ）",
        "options": {
            "A": "经有机破坏后显硫的特殊反应",
            "B": "与高锰酸钾在碱性条件下反应使之褪色",
            "C": "与硝酸钾共热生成黄色硝基化合物",
            "D": "与铜盐的吡啶溶液作用生成紫色",
            "E": "与钴盐反应生成紫堇色的配合物"
        },
        "answer": "B",
        "answer_text": "与高锰酸钾在碱性条件下反应使之褪色"
    },
    "4-32": {
        "text": "硫喷妥钠的特殊反应（ ）",
        "options": {
            "A": "经有机破坏后显硫的特殊反应",
            "B": "与高锰酸钾在碱性条件下反应使之褪色",
            "C": "与硝酸钾共热生成黄色硝基化合物",
            "D": "与铜盐的吡啶溶液作用生成紫色",
            "E": "与钴盐反应生成紫堇色的配合物"
        },
        "answer": "A",
        "answer_text": "经有机破坏后显硫的特殊反应"
    },
    "4-33": {
        "text": "司可巴比妥的反应（ ）",
        "options": {
            "A": "酸性条件下生成白色难溶性二银盐沉淀",
            "B": "与高锰酸钾在碱性条件下反应使之褪色",
            "C": "在HCl酸性条件下生成重氮盐",
            "D": "在适宜pH下与FeCl3直接呈色",
            "E": "在碱性条件下水解后用标准酸滴定"
        },
        "answer": "B",
        "answer_text": "与高锰酸钾在碱性条件下反应使之褪色"
    },
    "4-34": {
        "text": "水杨酸的反应（ ）",
        "options": {
            "A": "酸性条件下生成白色难溶性二银盐沉淀",
            "B": "与高锰酸钾在碱性条件下反应使之褪色",
            "C": "在HCl酸性条件下生成重氮盐",
            "D": "在适宜pH下与FeCl3直接呈色",
            "E": "在碱性条件下水解后用标准酸滴定"
        },
        "answer": "D",
        "answer_text": "在适宜pH下与FeCl3直接呈色"
    },
    "4-35": {
        "text": "巴比妥在碱性条件下与钴盐反应（ ）",
        "options": {
            "A": "紫堇色配合物",
            "B": "绿色配合物",
            "C": "白色沉淀，难溶于氨水",
            "D": "白色沉淀，可溶于氨水"
        },
        "answer": "A",
        "answer_text": "紫堇色配合物"
    },
    "4-36": {
        "text": "硫喷妥在碱性条件下与铜盐反应（ ）",
        "options": {
            "A": "紫堇色配合物",
            "B": "绿色配合物",
            "C": "白色沉淀，难溶于氨水",
            "D": "白色沉淀，可溶于氨水"
        },
        "answer": "B",
        "answer_text": "绿色配合物"
    },
    "4-37": {
        "text": "苯巴比妥在碱性条件下与银盐反应（ ）",
        "options": {
            "A": "紫堇色配合物",
            "B": "绿色配合物",
            "C": "白色沉淀，难溶于氨水",
            "D": "白色沉淀，可溶于氨水"
        },
        "answer": "C",
        "answer_text": "白色沉淀，难溶于氨水"
    },
    "4-38": {
        "text": "巴比妥在碱性条件下与汞盐反应（ ）",
        "options": {
            "A": "紫堇色配合物",
            "B": "绿色配合物",
            "C": "白色沉淀，难溶于氨水",
            "D": "白色沉淀，可溶于氨水"
        },
        "answer": "D",
        "answer_text": "白色沉淀，可溶于氨水"
    },
    "4-39": {
        "text": "可用于鉴别氢溴酸山莨菪碱的反应（ ）",
        "options": {
            "A": "绿奎宁反应",
            "B": "氧瓶燃烧破坏后呈氯化物反应",
            "C": "水解后重氮化-偶合反应",
            "D": "Vitali反应",
            "E": "银镜反应"
        },
        "answer": "D",
        "answer_text": "Vitali反应"
    },
    "4-40": {
        "text": "可用于鉴别硫酸奎宁的反应（ ）",
        "options": {
            "A": "绿奎宁反应",
            "B": "氧瓶燃烧破坏后呈氯化物反应",
            "C": "水解后重氮化-偶合反应",
            "D": "Vitali反应",
            "E": "银镜反应"
        },
        "answer": "A",
        "answer_text": "绿奎宁反应"
    },
    "4-41": {
        "text": "可用于鉴别硫酸阿托品的反应（ ）",
        "options": {
            "A": "绿奎宁反应",
            "B": "氧瓶燃烧破坏后呈氯化物反应",
            "C": "水解后重氮化-偶合反应",
            "D": "Vitali反应",
            "E": "银镜反应"
        },
        "answer": "D",
        "answer_text": "Vitali反应"
    },
    "4-42": {
        "text": "可用于鉴别地西泮的反应（ ）",
        "options": {
            "A": "酸性染料比色法",
            "B": "钯离子比色法",
            "C": "经酸水解后进行重氮化偶合反应",
            "D": "戊烯二醛反应",
            "E": "碘化铋钾试剂反应生成沉淀",
            "F": "银镜反应",
            "G": "非水滴定法"
        },
        "answer": "E",
        "answer_text": "碘化铋钾试剂反应生成沉淀"
    },
    "4-43": {
        "text": "可用于鉴别硫酸阿托品的反应（ ）",
        "options": {
            "A": "酸性染料比色法",
            "B": "钯离子比色法",
            "C": "经酸水解后进行重氮化偶合反应",
            "D": "戊烯二醛反应",
            "E": "碘化铋钾试剂反应生成沉淀",
            "F": "银镜反应",
            "G": "非水滴定法"
        },
        "answer": "E",
        "answer_text": "碘化铋钾试剂反应生成沉淀"
    },
    "4-44": {
        "text": "可用于鉴别硝苯地平的反应（ ）",
        "options": {
            "A": "酸性染料比色法",
            "B": "钯离子比色法",
            "C": "经酸水解后进行重氮化偶合反应",
            "D": "戊烯二醛反应",
            "E": "碘化铋钾试剂反应生成沉淀",
            "F": "银镜反应",
            "G": "非水滴定法"
        },
        "answer": "E",
        "answer_text": "碘化铋钾试剂反应生成沉淀"
    },
    "4-45": {
        "text": "可用于鉴别氢溴酸山莨菪碱的反应（ ）",
        "options": {
            "A": "酸性染料比色法",
            "B": "钯离子比色法",
            "C": "经酸水解后进行重氮化偶合反应",
            "D": "戊烯二醛反应",
            "E": "碘化铋钾试剂反应生成沉淀",
            "F": "银镜反应",
            "G": "非水滴定法"
        },
        "answer": "E",
        "answer_text": "碘化铋钾试剂反应生成沉淀"
    },
    "4-46": {
        "text": "中国药典规定硫酸阿托品原料药的含量测定方法（ ）",
        "options": {
            "A": "酸性染料比色法",
            "B": "钯离子比色法",
            "C": "经酸水解后进行重氮化偶合反应",
            "D": "戊烯二醛反应",
            "E": "碘化铋钾试剂反应生成沉淀",
            "F": "银镜反应",
            "G": "非水滴定法"
        },
        "answer": "G",
        "answer_text": "非水滴定法"
    },
    "4-47": {
        "text": "中国药典规定硫酸阿托品片的含量测定方法（ ）",
        "options": {
            "A": "酸性染料比色法",
            "B": "钯离子比色法",
            "C": "经酸水解后进行重氮化偶合反应",
            "D": "戊烯二醛反应",
            "E": "碘化铋钾试剂反应生成沉淀",
            "F": "银镜反应",
            "G": "非水滴定法"
        },
        "answer": "A",
        "answer_text": "酸性染料比色法"
    },
    "4-48": {
        "text": "中国药典规定氢溴酸山莨菪碱片的的含量测定方法（ ）",
        "options": {
            "A": "酸性染料比色法",
            "B": "钯离子比色法",
            "C": "经酸水解后进行重氮化偶合反应",
            "D": "戊烯二醛反应",
            "E": "碘化铋钾试剂反应生成沉淀",
            "F": "银镜反应",
            "G": "非水滴定法"
        },
        "answer": "A",
        "answer_text": "酸性染料比色法"
    },
    "4-49": {
        "text": "维生素A可采用的含量测定方法（ ）",
        "options": {
            "A": "三点校正紫外分光光度法",
            "B": "碘量法",
            "C": "非水滴定法",
            "D": "正相HPLC法",
            "E": "GC法"
        },
        "answer": "A",
        "answer_text": "三点校正紫外分光光度法"
    },
    "4-50": {
        "text": "维生素B1可采用的含量测定方法（ ）",
        "options": {
            "A": "三点校正紫外分光光度法",
            "B": "碘量法",
            "C": "非水滴定法",
            "D": "正相HPLC法",
            "E": "GC法"
        },
        "answer": "C",
        "answer_text": "非水滴定法"
    },
    "4-51": {
        "text": "维生素C可采用的含量测定方法（ ）",
        "options": {
            "A": "三点校正紫外分光光度法",
            "B": "碘量法",
            "C": "非水滴定法",
            "D": "正相HPLC法",
            "E": "GC法"
        },
        "answer": "B",
        "answer_text": "碘量法"
    },
    "4-52": {
        "text": "维生素D可采用的含量测定方法（ ）",
        "options": {
            "A": "三点校正紫外分光光度法",
            "B": "碘量法",
            "C": "非水滴定法",
            "D": "正相HPLC法",
            "E": "GC法"
        },
        "answer": "D",
        "answer_text": "正相HPLC法"
    },
    "4-53": {
        "text": "维生素E可采用的含量测定方法（ ）",
        "options": {
            "A": "三点校正紫外分光光度法",
            "B": "碘量法",
            "C": "非水滴定法",
            "D": "正相HPLC法",
            "E": "GC法"
        },
        "answer": "E",
        "answer_text": "GC法"
    },
    "4-54": {
        "text": "维生素A可采用的鉴别测定方法（ ）",
        "options": {
            "A": "三氯化锑反应",
            "B": "麦芽酚反应",
            "C": "硝酸反应",
            "D": "与2,6-二氯靛酚反应",
            "E": "硫色素反应"
        },
        "answer": "A",
        "answer_text": "三氯化锑反应"
    },
    "4-55": {
        "text": "维生素B1可采用的鉴别测定方法（ ）",
        "options": {
            "A": "三氯化锑反应",
            "B": "麦芽酚反应",
            "C": "硝酸反应",
            "D": "与2,6-二氯靛酚反应",
            "E": "硫色素反应"
        },
        "answer": "E",
        "answer_text": "硫色素反应"
    },
    "4-56": {
        "text": "维生素C可采用的鉴别测定方法（ ）",
        "options": {
            "A": "三氯化锑反应",
            "B": "麦芽酚反应",
            "C": "硝酸反应",
            "D": "与2,6-二氯靛酚反应",
            "E": "硫色素反应"
        },
        "answer": "D",
        "answer_text": "与2,6-二氯靛酚反应"
    },
    "4-57": {
        "text": "维生素D可采用的鉴别测定方法（ ）",
        "options": {
            "A": "三氯化锑反应",
            "B": "麦芽酚反应",
            "C": "硝酸反应",
            "D": "与2,6-二氯靛酚反应",
            "E": "硫色素反应"
        },
        "answer": "A",
        "answer_text": "三氯化锑反应"
    },
    "4-58": {
        "text": "维生素E可采用的鉴别测定方法（ ）",
        "options": {
            "A": "三氯化锑反应",
            "B": "麦芽酚反应",
            "C": "硝酸反应",
            "D": "与2,6-二氯靛酚反应",
            "E": "硫色素反应"
        },
        "answer": "C",
        "answer_text": "硝酸反应"
    },
    "4-59": {
        "text": "可与碘化汞钾生成淡黄色沉淀的药物（ ）",
        "options": {
            "A": "维生素A",
            "B": "维生素B1",
            "C": "维生素C",
            "D": "维生素D",
            "E": "维生素E"
        },
        "answer": "B",
        "answer_text": "维生素B1"
    },
    "4-60": {
        "text": "可与三氯化锑的无水氯仿溶液作用产生不稳定的蓝色的药物（ ）",
        "options": {
            "A": "维生素A",
            "B": "维生素B1",
            "C": "维生素C",
            "D": "维生素D",
            "E": "维生素E"
        },
        "answer": "A",
        "answer_text": "维生素A"
    },
    "4-61": {
        "text": "在硝酸酸性下水解生成橙红色的药物（ ）",
        "options": {
            "A": "维生素A",
            "B": "维生素B1",
            "C": "维生素C",
            "D": "维生素D",
            "E": "维生素E"
        },
        "answer": "E",
        "answer_text": "维生素E"
    },
    "4-62": {
        "text": "用二氯乙烷溶解后，与三氯化锑作用生成橙红色，逐渐变为粉红色的药物（ ）",
        "options": {
            "A": "维生素A",
            "B": "维生素B1",
            "C": "维生素C",
            "D": "维生素D",
            "E": "维生素E"
        },
        "answer": "D",
        "answer_text": "维生素D"
    },
    "4-63": {
        "text": "在三氯醋酸存在下水解、脱羧、生成戊糖，再失水，转化为糠醛，加入吡啶，加热到50°C产生蓝色的药物（ ）",
        "options": {
            "A": "维生素A",
            "B": "维生素B1",
            "C": "维生素C",
            "D": "维生素D",
            "E": "维生素E"
        },
        "answer": "C",
        "answer_text": "维生素C"
    },
    "4-64": {
        "text": "炔雌醇可采用的含量测定方法（ ）",
        "options": {
            "A": "Kober反应比色法",
            "B": "异烟肼比色法",
            "C": "非水滴定法"
        },
        "answer": "A",
        "answer_text": "Kober反应比色法"
    },
    "4-65": {
        "text": "黄体酮可采用的含量测定方法（ ）",
        "options": {
            "A": "Kober反应比色法",
            "B": "异烟肼比色法",
            "C": "非水滴定法"
        },
        "answer": "B",
        "answer_text": "异烟肼比色法"
    },
    "4-66": {
        "text": "醋酸地塞米松应检查的杂质（ ）",
        "options": {
            "A": "甲醇和丙酮",
            "B": "水杨酸",
            "C": "硒",
            "D": "对氨基酚",
            "E": "对氨基苯甲酸"
        },
        "answer": "C",
        "answer_text": "硒"
    },
    "4-67": {
        "text": "地塞米松磷酸钠应检查的杂质（ ）",
        "options": {
            "A": "甲醇和丙酮",
            "B": "水杨酸",
            "C": "硒",
            "D": "对氨基酚",
            "E": "对氨基苯甲酸"
        },
        "answer": "A",
        "answer_text": "甲醇和丙酮"
    },
    "4-69": {
        "text": "青霉素钾可发生的反应（ ）",
        "options": {
            "A": "重氮化偶合反应",
            "B": "麦芽酚反应",
            "C": "焰色反应淡紫色",
            "D": "三氯化铁反应",
            "E": "硫色素反应"
        },
        "answer": "C",
        "answer_text": "焰色反应淡紫色"
    },
    "4-70": {
        "text": "普鲁卡因青霉素可发生的反应（ ）",
        "options": {
            "A": "重氮化偶合反应",
            "B": "麦芽酚反应",
            "C": "焰色反应淡紫色",
            "D": "三氯化铁反应",
            "E": "硫色素反应"
        },
        "answer": "A",
        "answer_text": "重氮化偶合反应"
    },
    "4-71": {
        "text": "盐酸四环素可发生的反应（ ）",
        "options": {
            "A": "重氮化偶合反应",
            "B": "麦芽酚反应",
            "C": "焰色反应淡紫色",
            "D": "三氯化铁反应",
            "E": "硫色素反应"
        },
        "answer": "D",
        "answer_text": "三氯化铁反应"
    },
    "4-72": {
        "text": "硫酸链霉素可发生的反应（ ）",
        "options": {
            "A": "重氮化偶合反应",
            "B": "麦芽酚反应",
            "C": "焰色反应淡紫色",
            "D": "三氯化铁反应",
            "E": "硫色素反应"
        },
        "answer": "B",
        "answer_text": "麦芽酚反应"
    },
    "4-73": {
        "text": "盐酸硫胺可发生的反应（ ）",
        "options": {
            "A": "重氮化偶合反应",
            "B": "麦芽酚反应",
            "C": "焰色反应淡紫色",
            "D": "三氯化铁反应",
            "E": "硫色素反应"
        },
        "answer": "E",
        "answer_text": "硫色素反应"
    },
    "4-74": {
        "text": "青霉素钠可发生的反应（ ）",
        "options": {
            "A": "坂口反应",
            "B": "焰色反应黄色",
            "C": "氯化物的鉴别反应",
            "D": "戊烯二醛反应",
            "E": "C17-a-醇酮基的呈色反应"
        },
        "answer": "B",
        "answer_text": "焰色反应黄色"
    },
    "4-75": {
        "text": "地塞米松可发生的反应（ ）",
        "options": {
            "A": "坂口反应",
            "B": "焰色反应黄色",
            "C": "氯化物的鉴别反应",
            "D": "戊烯二醛反应",
            "E": "C17-a-醇酮基的呈色反应"
        },
        "answer": "E",
        "answer_text": "C17-a-醇酮基的呈色反应"
    },
    "4-76": {
        "text": "盐酸四环素可发生的反应（ ）",
        "options": {
            "A": "坂口反应",
            "B": "焰色反应黄色",
            "C": "氯化物的鉴别反应",
            "D": "戊烯二醛反应",
            "E": "C17-a-醇酮基的呈色反应"
        },
        "answer": "C",
        "answer_text": "氯化物的鉴别反应"
    },
    "4-77": {
        "text": "硫酸链霉素可发生的反应（ ）",
        "options": {
            "A": "坂口反应",
            "B": "焰色反应黄色",
            "C": "氯化物的鉴别反应",
            "D": "戊烯二醛反应",
            "E": "C17-a-醇酮基的呈色反应"
        },
        "answer": "A",
        "answer_text": "坂口反应"
    },
    "4-78": {
        "text": "氢化可的松可发生的反应（ ）",
        "options": {
            "A": "坂口反应",
            "B": "焰色反应黄色",
            "C": "氯化物的鉴别反应",
            "D": "戊烯二醛反应",
            "E": "C17-a-醇酮基的呈色反应"
        },
        "answer": "E",
        "answer_text": "C17-a-醇酮基的呈色反应"
    },
    "4-79": {
        "text": "黄体酮可能存在的杂质（ ）",
        "options": {
            "A": "聚合物",
            "B": "链霉素B",
            "C": "降解杂质",
            "D": "其他甾体",
            "E": "游离生育酚"
        },
        "answer": "D",
        "answer_text": "其他甾体"
    },
    "4-80": {
        "text": "头孢他定可能存在的杂质（ ）",
        "options": {
            "A": "聚合物",
            "B": "链霉素B",
            "C": "降解杂质",
            "D": "其他甾体",
            "E": "游离生育酚"
        },
        "answer": "A",
        "answer_text": "聚合物"
    },
    "4-81": {
        "text": "盐酸四环素可能存在的杂质（ ）",
        "options": {
            "A": "聚合物",
            "B": "链霉素B",
            "C": "降解杂质",
            "D": "其他甾体",
            "E": "游离生育酚"
        },
        "answer": "C",
        "answer_text": "降解杂质"
    },
    "4-82": {
        "text": "硫酸链霉素可能存在的杂质（ ）",
        "options": {
            "A": "聚合物",
            "B": "链霉素B",
            "C": "降解杂质",
            "D": "其他甾体",
            "E": "游离生育酚"
        },
        "answer": "B",
        "answer_text": "链霉素B"
    },
    "4-83": {
        "text": "维生素E可能存在的杂质（ ）",
        "options": {
            "A": "聚合物",
            "B": "链霉素B",
            "C": "降解杂质",
            "D": "其他甾体",
            "E": "游离生育酚"
        },
        "answer": "E",
        "answer_text": "游离生育酚"
    },
    "5-1": {
        "text": "下列方面中，ICH达成共识，并已制定出相关技术要求的有（ ）",
        "options": {
            "A": "质量（Q）",
            "B": "安全性（S）",
            "C": "有效性（E）",
            "D": "综合要求（M）",
            "E": "均一性（U）"
        },
        "answer": "ABCD",
        "answer_text": "A.质量（Q）, B.安全性（S）, C.有效性（E）, D.综合要求（M）"
    },
    "5-2": {
        "text": "药物稳定性试验中的影响因素试验包括（ ）",
        "options": {
            "A": "高温试验",
            "B": "高湿度试验",
            "C": "强光照射试验",
            "D": "加速试验",
            "E": "长期试验"
        },
        "answer": "ABC",
        "answer_text": "A.高温试验, B.高湿度试验, C.强光照射试验"
    },
    "5-3": {
        "text": "制订药品质量标准时，鉴别方法的选择应遵循（ ）",
        "options": {
            "A": "方法具有一定专属性、灵敏性",
            "B": "尽可能选用化学方法",
            "C": "尽可能采用药典中收载的方法",
            "D": "化学法与仪器法相结合",
            "E": "每种药品选择一种方法鉴别即可"
        },
        "answer": "ACD",
        "answer_text": "A.方法具有一定专属性、灵敏性, C.尽可能采用药典中收载的方法, D.化学法与仪器法相结合"
    },
    "5-4": {
        "text": "色谱法系统适用性试验包括（ ）",
        "options": {
            "A": "检测限",
            "B": "柱效",
            "C": "重复性",
            "D": "分离度",
            "E": "拖尾因子",
            "F": "范围",
            "G": "线性"
        },
        "answer": "BCDE",
        "answer_text": "B.柱效, C.重复性, D.分离度, E.拖尾因子"
    },
    "5-5": {
        "text": "HPLC测定中，为达到系统适用性试验要求，可适当改变色谱条件，但不能改变（ ）",
        "options": {
            "A": "固定相种类",
            "B": "流动相组成",
            "C": "流动相流速",
            "D": "色谱柱长度",
            "E": "检测器类型"
        },
        "answer": "ABE",
        "answer_text": "A.固定相种类, B.流动相组成, E.检测器类型"
    },
    "5-6": {
        "text": "可用作气相色谱法的载气有",
        "options": {
            "A": "空气",
            "B": "氧气",
            "C": "氢气",
            "D": "氮气",
            "E": "氦气"
        },
        "answer": "CDE",
        "answer_text": "C.氢气, D.氮气, E.氦气"
    },
    "5-7": {
        "text": "能发生重氮化-偶合反应的药物有",
        "options": {
            "A": "水杨酸",
            "B": "阿司匹林",
            "C": "对氨基水杨酸钠",
            "D": "对乙酰氨基酚",
            "E": "盐酸普鲁卡因"
        },
        "answer": "CDE",
        "answer_text": "C.对氨基水杨酸钠, D.对乙酰氨基酚, E.盐酸普鲁卡因"
    },
    "5-8": {
        "text": "能采用亚硝酸钠滴定法测定含量的药物有",
        "options": {
            "A": "水杨酸",
            "B": "盐酸利多卡因",
            "C": "对氨基水杨酸钠",
            "D": "对乙酰氨基酚",
            "E": "盐酸普鲁卡因"
        },
        "answer": "CDE",
        "answer_text": "C.对氨基水杨酸钠, D.对乙酰氨基酚, E.盐酸普鲁卡因"
    },
    "5-9": {
        "text": "盐酸普鲁卡因常用的鉴别反应（ ）",
        "options": {
            "A": "重氮化-偶合反应",
            "B": "水解反应",
            "C": "氧化反应",
            "D": "碘化反应"
        },
        "answer": "AB",
        "answer_text": "A.重氮化-偶合反应, B.水解反应"
    },
    "5-10": {
        "text": "不属于酰苯胺类的药物有（ ）",
        "options": {
            "A": "盐酸利多卡因",
            "B": "苯佐卡因",
            "C": "盐酸丁卡因",
            "D": "盐酸普鲁卡因"
        },
        "answer": "BCD",
        "answer_text": "B.苯佐卡因, C.盐酸丁卡因, D.盐酸普鲁卡因"
    },
    "5-11": {
        "text": "用于鉴别巴比妥类药物的反应是",
        "options": {
            "A": "硫酸反应",
            "B": "银盐反应",
            "C": "硫酸荧光反应",
            "D": "二硝基氯苯反应",
            "E": "铜盐反应"
        },
        "answer": "BE",
        "answer_text": "B.银盐反应, E.铜盐反应"
    },
    "5-12": {
        "text": "用于鉴别苯巴比妥的反应是",
        "options": {
            "A": "硫酸-亚硝酸钠反应",
            "B": "甲醛-硫酸反应",
            "C": "分解反应",
            "D": "二硝基氯苯反应",
            "E": "硝化反应"
        },
        "answer": "ABE",
        "answer_text": "A.硫酸-亚硝酸钠反应, B.甲醛-硫酸反应, E.硝化反应"
    },
    "5-13": {
        "text": "巴比妥类药物分子结构中含有1,3-二酰亚胺基团的特性有",
        "options": {
            "A": "在水溶液中发生二级电离（1,5,5-取代除外）",
            "B": "与碱溶液共沸水解释放出氨气",
            "C": "与重金属离子反应",
            "D": "在浓硫酸中与香草醛的反应生成红棕色产物",
            "E": "在碱性介质中有紫外吸收光谱特征"
        },
        "answer": "ABCDE",
        "answer_text": "A.在水溶液中发生二级电离（1,5,5-取代除外）, B.与碱溶液共沸水解释放出氨气, C.与重金属离子反应, D.在浓硫酸中与香草醛的反应生成红棕色产物, E.在碱性介质中有紫外吸收光谱特征"
    },
    "5-14": {
        "text": "常用的鉴别苯并二氮卓类药物的反应有",
        "options": {
            "A": "降解产物反应",
            "B": "水解后呈芳伯胺反应",
            "C": "硫酸荧光反应",
            "D": "沉淀反应",
            "E": "二硝基氯苯反应"
        },
        "answer": "ABCD",
        "answer_text": "A.降解产物反应, B.水解后呈芳伯胺反应, C.硫酸荧光反应, D.沉淀反应"
    },
    "5-15": {
        "text": "维生素C的鉴别方法包括",
        "options": {
            "A": "糖类的反应",
            "B": "UV法",
            "C": "与2,6-二氯靛酚反应",
            "D": "Kober反应",
            "E": "麦芽酚反应"
        },
        "answer": "ABC",
        "answer_text": "A.糖类的反应, B.UV法, C.与2,6-二氯靛酚反应"
    },
    "5-16": {
        "text": "维生素B1的含量测定方法有",
        "options": {
            "A": "双相滴定法",
            "B": "UV法",
            "C": "酸性染料比色法",
            "D": "非水滴定法",
            "E": "硫色素荧光法"
        },
        "answer": "BDE",
        "answer_text": "B.UV法, D.非水滴定法, E.硫色素荧光法"
    },
    "5-17": {
        "text": "维生素A中存在的杂质包括",
        "options": {
            "A": "环氧化物",
            "B": "鲸醇",
            "C": "维生素A的异构体",
            "D": "维生素A2",
            "E": "维生素A酸"
        },
        "answer": "ABCDE",
        "answer_text": "A.环氧化物, B.鲸醇, C.维生素A的异构体, D.维生素A2, E.维生素A酸"
    },
    "5-18": {
        "text": "可与TTC试液反应的药物有",
        "options": {
            "A": "氢化可的松",
            "B": "地塞米松",
            "C": "黄体酮",
            "D": "甲睾酮",
            "E": "雌二醇"
        },
        "answer": "AB",
        "answer_text": "A.氢化可的松, B.地塞米松"
    },
    "5-19": {
        "text": "可与硝酸银试液反应的药物有",
        "options": {
            "A": "氢化可的松",
            "B": "炔雌醇",
            "C": "炔诺酮",
            "D": "甲睾酮",
            "E": "雌二醇"
        },
        "answer": "ABC",
        "answer_text": "A.氢化可的松, B.炔雌醇, C.炔诺酮"
    },
    "5-20": {
        "text": "测定黄体酮含量可采用的方法是",
        "options": {
            "A": "HPLC法",
            "B": "UV法",
            "C": "四氮唑比色法",
            "D": "异烟肼比色法",
            "E": "Kober反应比色法"
        },
        "answer": "ABD",
        "answer_text": "A.HPLC法, B.UV法, D.异烟肼比色法"
    },
    "5-21": {
        "text": "测定氢化可的松含量可采用的方法是",
        "options": {
            "A": "HPLC法",
            "B": "UV法",
            "C": "四氮唑比色法",
            "D": "异烟肼比色法",
            "E": "Kober反应比色法"
        },
        "answer": "ABCD",
        "answer_text": "A.HPLC法, B.UV法, C.四氮唑比色法, D.异烟肼比色法"
    },
    "5-22": {
        "text": "测定雌二醇含量可采用的方法是",
        "options": {
            "A": "HPLC法",
            "B": "UV法",
            "C": "四氮唑比色法",
            "D": "异烟肼比色法",
            "E": "Kober反应比色法"
        },
        "answer": "ABE",
        "answer_text": "A. HPLC法, B. UV法, E. Kober反应比色法"
    },
    "5-23": {
        "text": "可与2,4-二硝基苯肼试液反应的药物有",
        "options": {
            "A": "可的松",
            "B": "地塞米松",
            "C": "黄体酮",
            "D": "氢化可的松",
            "E": "雌二醇"
        },
        "answer": "ABCD",
        "answer_text": "A. 可的松, B. 地塞米松, C. 黄体酮, D. 氢化可的松"
    },
    "5-24": {
        "text": "可与重氮苯磺酸试液反应的药物有",
        "options": {
            "A": "氢化可的松",
            "B": "炔雌醇",
            "C": "炔诺酮",
            "D": "黄体酮",
            "E": "雌二醇"
        },
        "answer": "BE",
        "answer_text": "B. 炔雌醇, E. 雌二醇"
    },
    "5-25": {
        "text": "炔雌醇可发生的反应",
        "options": {
            "A": "分子结构中含甲酮基，在一定条件下可与亚硝基铁氰化钠反应显蓝紫色",
            "B": "分子结构中含酚羟基，可与重氮苯磺酸反应生成红色偶氮染料",
            "C": "分子结构中含C3-酮基，可与2,4-二硝基苯肼反应生成黄色的腙",
            "D": "可与硝酸银试液反应，生成白色沉淀",
            "E": "经氧瓶燃烧后，可显氟化物反应"
        },
        "answer": "BD",
        "answer_text": "B. 分子结构中含酚羟基，可与重氮苯磺酸反应生成红色偶氮染料, D. 可与硝酸银试液反应，生成白色沉淀"
    },
    "5-26": {
        "text": "黄体酮可发生的反应",
        "options": {
            "A": "分子结构中含甲酮基，在一定条件下可与亚硝基铁氰化钠反应显蓝紫色",
            "B": "分子结构中含酚羟基，可与重氮苯磺酸反应生成红色偶氮染料",
            "C": "分子结构中含C3-酮基，可与2,4-二硝基苯肼反应生成黄色的腙",
            "D": "可与硝酸银试液反应，生成白色沉淀",
            "E": "经氧瓶燃烧后，可显氟化物反应"
        },
        "answer": "AC",
        "answer_text": "A. 分子结构中含甲酮基，在一定条件下可与亚硝基铁氰化钠反应显蓝紫色, C. 分子结构中含C3-酮基，可与2,4-二硝基苯肼反应生成黄色的腙"
    },
    "5-27": {
        "text": "醋酸地塞米松可发生的反应",
        "options": {
            "A": "分子结构中含甲酮基，在一定条件下可与亚硝基铁氰化钠反应显蓝紫色",
            "B": "分子结构中含酚羟基，可与重氮苯磺酸反应生成红色偶氮染料",
            "C": "分子结构中含C3-酮基，可与2,4-二硝基苯肼反应生成黄色的腙",
            "D": "可与硝酸银试液反应，生成白色沉淀",
            "E": "经氧瓶燃烧后，可显氟化物反应"
        },
        "answer": "CE",
        "answer_text": "C. 分子结构中含C3-酮基，可与2,4-二硝基苯肼反应生成黄色的腙, E. 经氧瓶燃烧后，可显氟化物反应"
    },
    "5-28": {
        "text": "链霉素的鉴别反应包括",
        "options": {
            "A": "N-甲基葡萄糖胺反应",
            "B": "麦芽酚反应",
            "C": "坂口反应",
            "D": "硫色素反应",
            "E": "茚三酮反应"
        },
        "answer": "ABCE",
        "answer_text": "A. N-甲基葡萄糖胺反应, B. 麦芽酚反应, C. 坂口反应, E. 茚三酮反应"
    },
    "5-29": {
        "text": "具有旋光性的药物是",
        "options": {
            "A": "氨苄西林",
            "B": "硫酸庆大霉素",
            "C": "链霉素",
            "D": "头孢氨苄",
            "E": "盐酸四环素"
        },
        "answer": "ABCDE",
        "answer_text": "A. 氨苄西林, B. 硫酸庆大霉素, C. 链霉素, D. 头孢氨苄, E. 盐酸四环素"
    },
    "5-30": {
        "text": "具有紫外吸收的药物是",
        "options": {
            "A": "青霉素钠",
            "B": "硫酸庆大霉素",
            "C": "硫酸链霉素",
            "D": "头孢氨苄",
            "E": "盐酸四环素"
        },
        "answer": "CDE",
        "answer_text": "C. 硫酸链霉素, D. 头孢氨苄, E. 盐酸四环素"
    },
    "5-31": {
        "text": "具有酸碱两性的药物有",
        "options": {
            "A": "磺胺嘧啶",
            "B": "磺胺异噁唑",
            "C": "诺氟沙星",
            "D": "氧氟沙星",
            "E": "环丙沙星"
        },
        "answer": "ABCDE",
        "answer_text": "A. 磺胺嘧啶, B. 磺胺异噁唑, C. 诺氟沙星, D. 氧氟沙星, E. 环丙沙星"
    },
    "5-32": {
        "text": "磺胺类药物的鉴别方法有",
        "options": {
            "A": "与三氯化铁反应",
            "B": "红外光谱法",
            "C": "芳香第一胺的反应",
            "D": "与丙二酸反应",
            "E": "与硫酸铜反应",
            "F": "HPLC"
        },
        "answer": "BCEF",
        "answer_text": "B. 红外光谱法, C. 芳香第一胺的反应, E. 与硫酸铜反应, F. HPLC"
    },
    "5-33": {
        "text": "喹诺酮类药物的鉴别方法有",
        "options": {
            "A": "与三氯化铁反应",
            "B": "红外光谱法",
            "C": "芳香第一胺的反应",
            "D": "与丙二酸反应",
            "E": "与硫酸铜反应",
            "F": "HPLC"
        },
        "answer": "BDF",
        "answer_text": "B. 红外光谱法, D. 与丙二酸反应, F. HPLC"
    },
    "5-34": {
        "text": "需检查含量均匀度的制剂为",
        "options": {
            "A": "注射剂",
            "B": "小剂量片剂",
            "C": "滴眼剂",
            "D": "小剂量胶囊剂",
            "E": "软膏剂"
        },
        "answer": "BD",
        "answer_text": "B. 小剂量片剂, D. 小剂量胶囊剂"
    },
    "5-35": {
        "text": "片剂的常规检查项目包括",
        "options": {
            "A": "外观、色泽",
            "B": "重量差异",
            "C": "崩解时限",
            "D": "含量均匀度",
            "E": "溶出度"
        },
        "answer": "BC",
        "answer_text": "B. 重量差异, C. 崩解时限"
    },
    "5-36": {
        "text": "《中国药典》收载的溶出度测定法有",
        "options": {
            "A": "小杯法",
            "B": "过滤法",
            "C": "篮法",
            "D": "桨法"
        },
        "answer": "ACD",
        "answer_text": "A. 小杯法, C. 篮法, D. 桨法"
    },
    "5-37": {
        "text": "片剂中常见的赋形剂是",
        "options": {
            "A": "硬脂酸镁",
            "B": "焦亚硫酸钠",
            "C": "糊精",
            "D": "淀粉",
            "E": "滑石粉"
        },
        "answer": "ACDE",
        "answer_text": "A. 硬脂酸镁, C. 糊精, D. 淀粉, E. 滑石粉"
    },
    "5-38": {
        "text": "中国药典一部正文收载的药品有",
        "options": {
            "A": "单味制剂",
            "B": "中药材及饮片",
            "C": "药用辅料",
            "D": "成方制剂",
            "E": "植物油脂和提取物",
            "F": "生化制剂"
        },
        "answer": "ABDE",
        "answer_text": "A. 单味制剂, B. 中药材及饮片, D. 成方制剂, E. 植物油脂和提取物"
    },
    "5-39": {
        "text": "以下项目可用GC分析的有",
        "options": {
            "A": "冰片",
            "B": "麝香",
            "C": "肉桂油中含水量的测定",
            "D": "有机氯类农药残留",
            "E": "丁香酚"
        },
        "answer": "ABCDE",
        "answer_text": "A. 冰片, B. 麝香, C. 肉桂油中含水量的测定, D. 有机氯类农药残留, E. 丁香酚"
    },
    "6-1": {
        "text": "鉴别司可巴比妥钠和硫喷妥钠。",
        "options": {},
        "answer": "",
        "answer_text": "(注意看答案纸第一题)                  司可巴比妥钠    硫喷妥钠\n碘试液         褪色                           -\n铜盐反应     紫色                       绿色"
    },
    "6-2": {
        "text": "杂质限量的含义？",
        "options": {},
        "answer": "",
        "answer_text": "药物中所含杂质的最大允许量称作杂质的限量。"
    },
    "6-3": {
        "text": "“恒重”的含义？",
        "options": {},
        "answer": "",
        "answer_text": "“恒重”是指供试品连续两次干燥或炽灼后的重量差异在0.3mg以下。"
    },
    "6-4": {
        "text": "气相色谱法的进样方式？",
        "options": {},
        "answer": "",
        "answer_text": "气相色谱法进样方式一般可采用溶液直接进样或顶空进样。"
    },
    "6-5": {
        "text": "在色谱法中，检查拖尾因子是否符合规定是为了保证____。除另有规定外，峰高法定量时拖尾因子应为___。",
        "options": {},
        "answer": "",
        "answer_text": "(1). 保证分离效果和测量精度，(2). 0.95~1.05。"
    },
    "6-6": {
        "text": "高效液色谱系统的适用性试验通常包括____、____、____和____四个指标。",
        "options": {},
        "answer": "",
        "answer_text": "理论板数、分离度、重复性和拖尾因子"
    },
    "6-7": {
        "text": "高效液相色谱法，衡量柱效的参数是____；除另有规定外，定量分析时分离度应大于____。",
        "options": {},
        "answer": "",
        "answer_text": "理论塔板数；1.5"
    },

    "6-8": {
        "text": "紫外分光光度法进行测定时，一般供试品溶液的吸光度读数，以在____之间的误差最小。",
        "options": {},
        "answer": "",
        "answer_text": "0.3－0.7"
    },
    "6-9": {
        "text": "药品质量标准分析方法验证的目的是______。验证内容有：。",
        "options": {},
        "answer": "",
        "answer_text": "(1)证明所采用的方法适合于相应检测要求。(2)：准确度、精密度（包括重复性、中间精密度和重现性）、专属性、检测限、定量限、线性、范围和耐用性。"
    },
    "6-10": {
        "text": "滴定分析（容量分析）的滴定方式可分为四种：____。",
        "options": {},
        "answer": "",
        "answer_text": "直接滴定法、返滴定法、置换滴定法、间接滴定法"
    },
    "6-11": {
        "text": "高效液相色谱法常用检测器有：______。",
        "options": {},
        "answer": "",
        "answer_text": "紫外检测器、二极管阵列检测器、荧光检测器、示差折光检测器、蒸发光散射检测器、电化学检测器和质谱检测器"
    },

    "6-12": {
        "text": "色谱法可根据分离方法分为：________。",
        "options": {},
        "answer": "",
        "answer_text": "纸色谱法、薄层色谱法、柱色谱法、气相色谱法、高效液相色谱法等"
    },
    "6-13": {
        "text": "_______是采取在药物的吸收曲线上选取两点，测出各自的吸收度，计算其差值；_______是利用药物在不同pH值溶液中的电离级数不同，产生紫外吸收光谱的情况不同，计算吸收度之差。",
        "options": {},
        "answer": "",
        "answer_text": "(1).双波长分光光度法; (2).差示分光光度法。"
    },
    "6-14": {
        "text": "___系指该方法测定的结果与真实值或参考值接近的程度，一般用____表示。",
        "options": {},
        "answer": "",
        "answer_text": "(1).准确度; (2).回收率（％）"
    },

    "6-15": {
        "text": "___系指在规定的测试条件下同一个均匀的供试品，经多次取样测定所得结果之间的接近程度。一般用___表示。",
        "options": {},
        "answer": "",
        "answer_text": "(1) 精密度; (2) 偏差、标准偏差或相对标准偏差"
    },
    "6-16": {
        "text": "有机破坏方法一般包括以下两种方法湿法破坏和干法破坏，其中湿法破坏适用于___药物分析的前处理；干法破坏适用于___药物分析的前处理；根据破坏方式的不同，干法破坏可分为___。",
        "options": {},
        "answer": "",
        "answer_text": "(1).含氮有机合成药物分析的前处理；(2).含卤素、硫、磷等有机药物分析的前处理；(3).高温炽灼法和氧瓶燃烧法"
    },
    "6-17": {
        "text": "在分析含金属或卤素的有机药物之前，需要进行适当的处理，分析方法分为以下两类___。",
        "options": {},
        "answer": "",
        "answer_text": "不经有机破坏的分析方法和经有机破坏的分析方法"
    },
    "6-18": {
        "text": "巴比妥类药物结构中含有___结构，与碱共沸而水解产生___，可使红色石蕊试纸变___。",
        "options": {},
        "answer": "",
        "answer_text": "酰亚胺; 氨气; 蓝"
    },
    "6-19": {
        "text": "苯巴比妥的甲醛-硫酸反应现象是生成___。",
        "options": {},
        "answer": "",
        "answer_text": "玫瑰红色产物"
    },
    "6-20": {
        "text": "中国药典中收录的注射剂的无菌检查法有___和___两种。",
        "options": {},
        "answer": "",
        "answer_text": "直接接种法和薄膜过滤法"
    },
    "6-21": {
        "text": "中国药典中收录的注射剂的可见异物检查法有___法和___法。",
        "options": {},
        "answer": "",
        "answer_text": "灯检法和光散射法"
    },

    "6-22": {
        "text": "不溶性微粒检查法系在___检查符合规定后，用以检查溶液型静脉注射剂中不溶性微粒的大小及数量。",
        "options": {},
        "answer": "",
        "answer_text": "可见异物"
    },
    "6-23": {
        "text": "《中国药典》规定，不溶性微粒检查法有___和___。",
        "options": {},
        "answer": "",
        "answer_text": "光阻法;显微计数法"
    },
    "6-24": {
        "text": "溶出度测定时，一般初试应取供试品的片数为___片。",
        "options": {},
        "answer": "",
        "answer_text": "6"
    },

    "6-25": {
        "text": "原料药分析与制剂分析的含量测定的结果表示方法不同，原料以___表示，制剂一般以___表示（抗生素无菌注射用制剂也可以实际含量表示）。",
        "options": {},
        "answer": "",
        "answer_text": "实际含量；标示量"
    },
    "6-26": {
        "text": "含量均匀度测定时，一般初试应取供试品的片数为___片。",
        "options": {},
        "answer": "",
        "answer_text": "10"
    },
    "6-27": {
        "text": "___检查的目的是在于控制每片（个）含量的均一性，以保证用药剂量的准确。",
        "options": {},
        "answer": "",
        "answer_text": "含量均匀度"
    },
    # 计算题
    "7-1": {
        "text": "氨基水杨酸中间氨基酚的检查：称取本品3.0g，置50ml烧杯中，加无水乙醚25ml，用玻棒搅拌1min，注意将乙醚液滤入分液漏斗中，不溶物再用无水乙醚提取2次，每次25ml，乙醚液滤入同一分液漏斗中，加水10ml与甲基橙指示剂1滴。振摇后用盐酸标准溶液（0.02mol/L）滴定，并将滴定结果用空白试验校正，消耗盐酸标准溶液（0.02mol/L）不得过0.30ml。计算间氨基酚（Mr=109）的限量。",
        "options": {},
        "answer": "latex:",
        "answer_text": "\\frac{0.02\\times 0.30 \\times 109 \\times 10^{-3}}{3.0} \\times 100 \\% = 0.022 \\%"
    },
    "7-2": {
        "text": "取对乙酰氨基酚2.0g，加水100ml，加热溶解后冷却，滤过，取滤液25ml，依法检查氯化物（中国药典，附录VIIIA），所发生的浑浊反应与标准氯化钠溶液5.0ml（每1ml相当于10g的Cl-）制成的对照液比较，不得更浓，问氯化物的限量为多少？",
        "options": {},
        "answer": "latex:",
        "answer_text": "L = \\frac{c \\times V } {m} \\times 100 \\% = \\frac{0.01 \\times 5}{2 \\times 10^{3} \\times \\frac{25}{100}} \\times 100 \\% = 0.01 \\%"
    },
    "7-3": {
        "text": "称取维生素C 0.5000g溶于1000ml的0.02mol/L的硫酸溶液中，精密吸取此溶液2ml，准确稀释至100ml，取此溶液在1cm厚的石英皿中，在245nm处的测定其吸光度是0.551，已知在245nm处的百分吸光系数为560，求维生素C的百分含量。",
        "options": {},
        "answer": "latex:",
        "answer_text": "\\% = \\frac{\\frac{0.551}{560\\times 1 \\times 100} \\times 50 \\times 1000}{0.5000} \\times 100 \\% = 98.4\\%"
    },
    "7-4": {
        "text": "非那西丁含量测定：精密称取本品0.3630g，加稀盐酸回流1小时，放冷，用亚硝酸钠液（0.1010mol/L)滴定，用去20.00m1。每1ml亚硝酸钠液（0.1mol/L)相当于17.92mg的C10H13O2N。计算非那西丁的含量。",
        "options": {},
        "answer": "latex:",
        "answer_text": "\\% = \\frac{\\frac{0.1010}{0.1} \\times 17.92 \\times 20.00 \\times 10^{-3}}{0.3630} \\times 100 \\% = 99.72 \\%"
    },
    "7-5": {
        "text": "司可巴比妥钠的测定：精密称定本品0.1012 g，，置250ml碘量瓶中，加水10ml，振摇使溶解，精密加溴滴定液(0.05mol/L)25ml，再加盐酸5ml，立即密塞并振摇1min，在暗处静置15min后，注意微开瓶塞，加碘化钾试液10ml，立即密塞，摇匀后用硫代硫酸钠滴定液（F=1.040）滴定，至近终点时，加淀粉指示液，继续滴定至蓝色消失，消耗硫代硫酸钠滴定液15.70ml，并将滴定结果用空白试验校正，空白试验消耗硫代硫酸钠滴定液23. 07ml，。每1ml溴滴定液0.05mol/L)相当于13.01mg的C12H17N2NaO3。计算司可巴比妥钠的含量。",
        "options": {},
        "answer": "latex:",
        "answer_text": "\\% = \\frac{13.01 \\times (23.07-15.70) \\times 1.010 \\times 10^{-3}}{0.1012} \\times 100 \\% = 98.5 \\%"
    },
    "7-6": {
        "text": "苯巴比妥0.1585g，加pH=9.6的缓冲溶液稀释至100.0ml，精密量取5ml，同法稀释至200.0ml，摇匀，滤过，再取续滤液25.0ml稀释至100.0ml作为供试品溶液；另精密称取苯巴比妥对照品适量，同法稀释成10.1g/ml的溶液作为对照品溶液。取上述两种溶液，照分光光度法，在240nm波长处分别测得供试品和对照品的吸收度分别为0.427和0.438，计算苯巴比妥的含量。",
        "options": {},
        "answer": "latex:",
        "answer_text": "D = 160, \\% = \\frac{\\frac{0.427}{0.438} \\times 10.1 \\times 160 \\times 100 \\times 10^{-6}}{0.1585} \\times 100 \\% = \\frac{0.1575}{0.1585} \\times 100 \\% = 99.4 \\%"
    },
}

def display_questions(start, end):
    st.title('药物分析学试卷展示')
    st.header('选择题')
    st.subheader('[A型题]')

    for question_id, question in questions.items():
        if start <= int(question_id) <= end:
            st.write(f'{question_id}. {question["text"]}')
            for option_key, option_value in question['options'].items():
                st.write(f'{option_key}. {option_value}')
            st.write('---')

def display_question(question_number, question_data):
    st.subheader(f"题目 {question_number}:")
    st.write(question_data['text'])

def search_question(keyword):
    results = []
    for question_number, question_data in questions.items():
        if keyword in question_data['text']:
            results.append(question_number)
    return results

def main():
    st.title("药物分析学试卷展示应用")
    # display_questions(1,7)
    # 搜索框
    search_keyword = st.text_input('输入关键字搜索题目：')

    # 搜索按钮
    search_button = st.button('搜索')

    if search_button:
        # 执行搜索
        search_results = search_question(search_keyword)

        # 显示搜索结果
        if search_results:
            st.markdown('### 搜索结果：')
            for question_num in search_results:
                # Retrieve question data based on the question number
                question_data = questions.get(str(question_num))
                # Display the question and options
                if question_data:
                    st.markdown(f"**{question_num}.{question_data['text']}**")
                    for option, text in question_data['options'].items():
                        st.markdown(f'- {option}. {text}')
                    if question_data["answer"] == "latex:":
                        latex_code = question_data["answer_text"]  # 获取公式文字的变量
                        rendered_latex = r"$$" + latex_code + r"$$"
                        st.markdown(rendered_latex, unsafe_allow_html=True)
                    else:
                        st.markdown(f'答案：{question_data["answer"]} - <span style="background-color: yellow;">{question_data["answer_text"]}</span>', unsafe_allow_html=True)
                    st.markdown('---')
                else:
                    st.error("Question not found!")
        else:
            st.markdown('### 搜索结果：无匹配题目')

    # 显示所有题目
    st.markdown('### 所有题目：')
    for question_num, question_data in questions.items():
        st.markdown(f'**题目 {question_num}:** {question_data["text"]}')
        for option, text in question_data['options'].items():
            st.markdown(f'- {option}. {text}')
        st.markdown('---')


if __name__ == '__main__':
    main()


